[
    {
        "job_role": "Analyst",
        "company_name": "OYO",
        "info": "This fast-paced and growing organization gives you an oppurtunity to own and deliver end-to-end projects.",
        "content": "FORESIGHT(2021): Summer Internship at OYO |Alok Munshi\n\n--\n\nListen\n\nBrief Introduction\n\nHi, I’m Alok Munshi, a final-year undergraduate pursuing a Major in the Department of Chemical Engineering and a Minor in Mathematics and Computing from the Indian Institute of Technology, Kharagpur. I did my internship with OYO as a Business Analyst Intern in summer 2021. I was selected for the role as a part of their on-campus recruitment program ‘OYO HEADSTART.’\n\nSelection Procedure\n\nOYO came to campus in the first week of November and was open for all the departments. Out of all the applicants, a total of 305 students got shortlisted for the online test, which had questions in the form of MCQs on aptitude, basics of Data Science and Machine Learning, probability, and statistics, and had 3 questions on SQL where we were asked to write down SQL queries based on schema diagram.\n\nBased on online test scores, they had shortlisted 36 students for the Group Discussion round. There were 4 panels, each consisting of 9 students, and the topic of the Group Discussion was general, not a technical group discussion.\n\nAfter the Group Discussion round, 16 students were shortlisted for the personal interviews. They asked a case study and a few HR questions to wrap it up in the personal interview.\n\nFinally, 8 students got the offer letter.\n\nHow to prepare for them?\n\nFamiliarize yourself with SQL query writing from tabular database formats and schema diagrams. You can refer to w3schools.com or sqlbolt.com for practice. Read about the basics of Data Science and Machine Learning concepts and practice questions on probability and statistics.\n\nYour Project Details\n\nI was assigned a multi-function project with the conversion and growth team at OYO, where I improved the average lifetime ratings of OYO on the Google Play Store and the Apple App Store. I worked on analyzing the problems, designing and implementing new rating and review strategies leading to significant growth in OYO app views, and increasing the number of ratings and reviews on stores. I got a chance to learn and use tools like Google Analytics, Hive Databases, MoEngage, Big Query, Google Play console, and a few more.\n\nHow was your experience working from home? What difficulties did you face?\n\nOverall it was a good experience. OYO implemented 4 working days a week policy for May because of the uprising in the covid cases. Although the office environment was missing, everyone in the organization was easily reachable and available whenever in need. The mentors and senior authorities were very supportive and helpful and contributed a lot to learning and implementing new things.\n\nWhat effect could Covid have on the upcoming internship process?\n\nThe campus isn’t opening soon, and the upcoming internship process would be carried out in the same online manner as last year. Organizations have pretty well adapted to this online medium and the work-from-home environment, so be prepared. There will be many companies coming and recruiting, and don’t lose hope if you cannot secure an offer in the initial days. There are many opportunities available off-campus as well. Keep an eye on them, and all the best!\n\nAccording to you, who should ideally apply for this internship?\n\nIf you’re interested in working with a fast-paced and growing organization where you have an opportunity to own and deliver end-to-end projects, this is one of the best places available.\n\nParting advice\n\nWork on communication and soft skills and be clear with what you want to accomplish in the coming years. Don’t apply for companies just to get a CDC internship."
    },
    {
        "job_role": "Analyst",
        "company_name": "Capital One",
        "info": "Anyone with agood analytical mind and having problem-solving skills can apply for this company",
        "content": "FORESIGHT(2018): Summer Internship Capital One| Harsh Raj\n\n--\n\nListen\n\nBrief Introduction:\n\nCapital One Financial Corporation is a bank holding company specializing in credit cards, auto loans, banking and savings products. In India, they have their datalabs focused on making analytical products and helping the business. With the aim of “changing banking for good”, datalabs look forward to make customer-friendly product.\n\nSelection Procedure:\n\nThe first stage of the selection procedure for analyst profile will be a test comprising usually of 30 questions within 35 minutes. The question will be from data interpretation, logical reasoning and Quant. The key for the test is speed and accuracy as they would be negative marking.The second stage will be a series of case interviews where your problem-solving skills will be tested. It is mandatory not to make any calculation mistake in this round.\n\nHow to prepare for them:\n\nFor the written test, practice of any CAT material will help. For the case interview, ‘Case in Point’ book can be referred. Sample case interview for capital one can be found on youtube and is quite helpful.\n\nYour Project Details:\n\nThe project was aimed at exploring various pricing techniques for different types of options available in their portfolio and their python implementation.\n\nCompany Culture:\n\nThe culture is quite unique. No one has a personal cabin. You may find yourself sitting beside senior managers or director and working, interacting and discussing various things. People working there are quite amazing and energetic, you won’t even know when you get involved in discussion with them and topics will vary from finance, analytics, football, party, world politics, places to visit and whatnot. Mentors and buddies are allotted to interns who will help them with everything throughout the internship duration.\n\nAccording to you who should ideally apply for the intern:\n\nAnyone with a good analytical mind and having problem-solving skills can apply for this company.\n\nAnd what advice will you give to them:\n\nTry to avoid negative marking in the test and in the interview, try to interact with interviewer as much as possible and avoid calculation mistake.Overall, be confident, have a belief in yourself. Don’t get disheartened, even if you get rejected in a few companies. It’s not the result but the learning process during preparation, that matters."
    }
]