[
    {
        "job_role": "Consultancy",
        "company_name": "Accenture",
        "info": "be thorough with your CV, have a detailed explanation of the projects mentioned, prepare a proper introduction highlighting all essential points",
        "content": "FORESIGHT(2024) | Internship at Accenture | Archana Satapathy\n\n--\n\nListen\n\nHello everyone, I am Archana Satapathy, a pre-final year student at IITKharagpur majoring in Mining Engineering enrolled in its B.Tech course.I am a boarder of Sister Nivedita Hall of Residence. I shall join as aStrategy and Consulting Intern at Accenture this summer.\n\n2. How did you get into Accenture? What was the selection procedure?\n\nI entered Accenture through the Career Development Centre (CDC) atIIT Kharagpur. The selection process consisted of one online assessment along with two rounds of interviews.\n\nThe online assessment was about an hour long and had questions based on critical thinking and logical reasoning. There was a Psychometric evaluation section as well.\n\nThe first round of interview had questions based on my CV, an explanation of projects, and questions based on the skills mentioned. It lasted for about 40–45 minutes.\n\nThe second round of interview was held on the same day immediately after the first round which was the HR round where there were situation-based questions, and a few questions on CV and it lasted for about 30–40 minutes.\n\n3. How to prepare for them?\n\nFor the assessment round, solving questions on different topics like graphs, patterns, probability, profit analysis, analogies, visual puzzles become important for a better pace. For the Psychometric evaluation, remain careful while answering as the questions get reframed and they check for similar answers in the repeated questions.\n\nFor the interview round, be thorough with your CV, have a detailed explanation of the projects mentioned, prepare a proper introduction highlighting all essential points, read a little bit about the company their values and goals before sitting for the interview.\n\nFor the HR round prepare answers to some common questions like what are your strengths and weaknesses, why did you choose this company, the offered role, etc. I followed the book ‘Bury The Hatchet with case problems’ which had cases and probable questions for the HR round. Last but not least stay calm and composed throughout the interview. Even if you get stuck while solving any case communicate with the interviewer they will guide you in a certain direction. Confidence is important but do catch the hints.\n\n4. When did you start preparing for this role and according to you what is the ideal time for aspirants to begin their preparation?\n\nI would suggest to start preparing from the beginning of summer itself. For this profile, they wanted people with basic coding skills, MS Excel, Fundamental concepts of Machine Learning, and basic algorithms that take time to understand. Having a schedule and staying persistent will ease it.\n\n5. What difficulties did you face while preparing for this Company/Profile? How did you overcome them?\n\nSince, for the very first time Accenture was recruiting for this profile, I focused majorly on the technical part due to which I was left with less time for solving cases and preparing for the aptitude test.\n\nTo begin with I started watching ‘Case Interviews Cracked’ playlist and focused on the type of problems rather than the volume. Having a supportive peer group and seniors who were always ready to help made the journey easier.\n\n6. Are there any specific requirements such as department, CGPA, or other criteria for this position? Additionally, do certain PORs or EAAs enhance one’s chances of securing this internship?\n\nIt was open to all the departments (only for B.Tech courses) and as such no CGPA criteria but having a CGPA greater than 8 is a plus as it increases chances of shortlisting. PORs and EAAs do not play a significant role but they do highlight your time management skills.\n\n7. According to you, who should ideally apply for this job?\n\nAnyone who has structured thinking can analyze the data and has knowledge about technological advancements (mainly AI) should apply for this profile. It is however encouraged that all of you should give it a try.\n\n8. Kindly attach your CV/Resume. What are some of the major points youthink would be valid to mention in your CV while targeting this profile?\n\nEach CV is unique and there should not be any comparison made. Some of the major points that are valid to mention are:- Keep your CV as versatile as possible highlighting important projects, achievements, courses taken, and any competition you were part of.- Align your CV according to the requirements and mention relevant skills.- Describe each line in your CV starting with an action word and provide statistics to highlight the impact.\n\n9. Lastly, what advice would you like to give to the students aiming to grab CDC internships this year?\n\nI would advise you to use your time effectively to develop the relevant skills and make your own projects. If you get an internship it’s well and good but do not spend the entire time searching for it. Contact your seniors whenever you need any help as they might be the best ones to guide you. Form a friend group with similar goals to discuss the case studies. It might get hectic at times but stay patient throughout the process. Stay consistent with your efforts and everything will eventually fall into place.All the best!"
    },
    {
        "job_role": "Consultancy",
        "company_name": "McKinsey & Company",
        "info": "Management Consulting as a role is something that you cannot just build up within a day or a month. It’s the whole personification of how your personality is; how inquisitive, how curious you are",
        "content": "FORESIGHT(2024) | Internship at McKinsey & Company | Samarth Singh\n\n--\n\nListen\n\n1) Brief introduction and description of the offered role\n\nI’ll be interning in the role of Summer Intern Business Analyst at McKinsey & Company. Briefly, It is a role that is aligned to management consulting as its cor consulting. So there were no expectations that you should have from the program, as the work gets as dynamic as it could. Also, it is the first time McKinsey is hiring UG Interns and in general, it is going to be something that other management consulting internships there are for undergraduate students.\n\n2) How did you get into McKinsey & Co.? What was the selection procedure?\n\nThe selection procedure is considered to be very rigorous in management consulting; it was similar to other management consulting firms as well. McKinsey & Company, BCG, Bain & Co. and LEK. These were some of the management consulting companies that were hiring through the CDC. They came over here for selection through the CDC portal itself.\n\nWe applied with our CVs followed by a CV shortlisting process where they shortlisted several candidates according to the needs that they wanted to hire for the summer intern. After the CV shortlisting, there were also two buddies allotted to you from McKinsey.\n\nTwo buddies are there to help you throughout the process so that if you have any doubt regarding if this is the right role for you?; how to prepare for it; how to present yourself to have the best shot of making it. My buddies at McKinsey were very helpful. They helped me understand what McKinsey has to offer for a UG student. Secondly, they were ready to answer all of the doubts that undergraduate students will have before an interview.\n\nSo after that on the day of our interview, we had one round that was the only deciding round. It was a round where we discussed my CV first. We discussed some pointers about it; about my past experiences and then we moved on to solve a study. After that, we had a very brief conversation and then we ended the interview.\n\n3) How to prepare for them?\n\nConsulting and Management Consulting as a role is something that you cannot just build up within a day or a month. It’s the whole personification of how your personality is; how inquisitive, how curious you are to a lot of things, and how you are readily able to understand and able to adapt to different situations and able to learn about different industries. As a Management Consultant, You look forward to being staffed in various industries that are there to offer along with various functional roles and various studies that will be going on in different functional parts of a study.\n\nSo you will have to have that analytical skill, aptitude, and curiosity to explore what’s there to offer in-depth and bring out the best in your clients. So to prepare for the interview one standard thing that all companies have in Management Consultants is we prepare cases throughout. So for case preparation, there was something that I followed was a structure that was not very linear, but was a mix of a lot of resources. For me telling it out the resources will be in this order advising someone to start with:\n\nCase Interview cracked IIT Bombay video series. The four videos will give you a great insight into how the conversation goes and what it is about. So the videos are at an average of one hour each but they’re very insightful for a starting point. Next ahead you should go through the case interview cracked book, but the chapter till drilling was something that I studied till.\n\nAfter that, I went to Victor Cheng’s content, and the videos were there on YouTube for Victor Cheng’s consulting preparation. They have been something that has been going on for a long time. Victor Cheng’s materials give you a very good insight into what exactly consulting Industries across the globe are with its whole essence of “What consultants are supposed to do?” “What kind of behavior is expected from a consultant?” “What do you do in consulting?” and he takes you through a lot of different basics that are very necessary and after this point, one will have a good idea of what consulting is.\n\nNow you can start dwelling on checking how case interviews are. So there are two processes to it. You need to find what is adaptable and most suitable for your situation.\n\nOne process is you just read about cases in the book itself and prepare your thought process accordingly. That is what I did. I read a lot of cases about how they were being solved before reading the solution, I just used to think for myself and take myself on the journey, but not utilizing the whole 30 minutes of doing it with someone. I just wanted to cover as many cases as I could through this.\n\nThe second method is to just start by practicing cases watching a few videos of how case interviews are done people doing it with someone one-on-one and then you find a partner for yourself who is also preparing for the same and again find a partner that you also think has the same aspirations as you, as he/she and you should be putting the same amount of time so that you both progress together. So having a partner with whom you get comfortable and then he/she plans to switch profiles is something that might hurt your preparation. So have a partner that has a very strong resolution towards preparing for this role.\n\nNow compared to the first method, you watch a lot of videos before you read about the case and you watch the videos on how cases are being solved and what kind of different case studies are there to solve in this interview and then you get under preparation focusing on your presentation, on-the-spot thinking and maintaining composure and structure throughout the mock interviews. So this was the first process where you study the material first and then you get a hang of it then you practice. The second one was where you practice directly with someone and you want to go watch a case, try to do it yourself, and then you check out the solution. So these two are the starting points, I will advise you very highly to complete this process very thoroughly and as early as possible. Now, you can check out some standard books that are out there.\n\nIIM Ahmedabad casebook and SRCC casebooks; I personally liked SRCC especially because of the way they present a solution and the variety of cases there. It is very easy for one to read the book and get a grasp of what the solution is and how it is taken through a process.SRCC also mentions which year, the company asked about this case in interviews itself in the recent years only.\n\nApart from these two, you should also check out the Communique guesstimates compilation book which is something that helped me personally quite a lot to get comfortable with “out of the box” thinking. To be very honest the guesstimates compilation by communique was something that is a very necessary fundamental that one needs to have because in various cases, you never know what kind of guesstimate you are supposed to make or what kind of guesstimate you are supposed to skip or just make an assumption and move on, but just to have an idea about how different kinds of question could come around involving guesstimates this book is a must. Once you are done with all this material you can head towards by reaching out to your +1 batches and senior batches on their preparation and what their interview process has been and ask them to do a case with you. You will get amazing insightful inputs from your senior batches.\n\nSo there were some steps that my buddies used, and the case preparation was timed while we were practicing cases. The timer was to ensure that you are not wasting time around and you are very thorough with what you are saying how many questions you are asking and how much time you are spending on each process. So during the interview itself, once you have seen the videos you can form your structure of how you take a case question with yourself.\n\nSo this is where you note down the questions where you ask some questions on the case itself. Then you reiterate, and then you get ahead with forming them with a preliminary answer. You check with the interviewer if he or she is okay with your answer or what your track is going to be in that process and then you go ahead and then you have recommendations and suggestions with this your end of the case. But this is something that you can change, one need not follow a set structure they can always change things up that is suitable to one’s personality.\n\nNext to this is to be practical at the start of your preparation and make sure you are making the Case Notes while you’re solving a case during your preparation phase cleanly and thoroughly, one should not leave this aspect that they will improve that in the end. Else one develops a habit of solving cases in that way only that you will have to change once again when you are closer to your interviews.\n\nSo from the start only make very good and crisp case notes and case pointers that you’re doing while on the case. And once you’re done with all of this, you should check out materials from universities across the globe. I mean Top Business Schools across the world; Their case books go in a lot of depth into various concepts of Business and Consulting for example pricing cases, mergers and acquisitions, growth cases, etc. The cases are very insightful, giving you experience of various demographics. One will find it to be very intuitive and aptitude-heavy methods that are being used here that are derived from the fundamentals.\n\n4) When did you start preparing for this role and according to you what is the ideal time for aspirants to begin their preparation?\n\nI did a lot of case preparation after my second-year summer, but later I switched to a dual degree. So I was not only prepping for CDC that year but this summer also. I did not start that early personally because I knew I had a bit of preparation at the back of my hand. So I needed to just brush it up and study more and practice more but for one ideally, if they are focused and you are having aspirations then they should start as soon as possible. So that you can prepare for the interviews of other profiles while you are giving tests during the CDC internship. You will be having group discussions, and test rounds for numerous companies, so it’s not suggested to leave the preparation for later.\n\nYou might be traveling, you will be busy with other different things that will be going on around you as there will be other profiles that you might be aiming for so start as early as possible. Even if you’re not a consulting aspirant, having case preparation helps a lot in any kind of interview because of what it gives you. It gives you an edge in that you can structure your answers. You can structure your whole conversation and structure your whole interview in a way that is more presentable in any given scenario. Hence, Case Preparation will help you in any given scenario and profile, having a very small knowledge of how this is being done will do wonders in any different interviews that you’re sitting for. The ideal time to learn this would be something around one month before the interviews, but again, it depends on how aspirational you are and how sure you are about having this. A lot of students do not get shortlisted as a large number of students apply and the shortlist is actually on the lower end of the double digits. Hence people think they’ll start preparing for it once the shortlist comes out. Still, it is not a demotivating factor that you are not well prepped and your batchmates are more prepared than you. You still can cover up given the right methodology on how you are studying and how you’re preparing yourself.\n\n5) What difficulties did you face while preparing for this Company/Profile? How did you overcome them?\n\nIn terms of difficulties, YES, there will be cases that you will be out of ideas, cases that are very tough to go through that might not click with you at the first instance. So this should not be demotivating for anyone who is preparing for it because you always need to be ready with an answer and come out with your best-case scenarios utilizing your toolkit properly you can produce a structure, understanding the raw data provided without having zero knowledge of the industry.\n\nBut these scenarios will give you a better chance to work on this aspect where you might be shunted upon what the industry is about and you have no idea during an interview. For me to overcome this first part, came with your general knowledge and business acumen. General knowledge and business acumen are two different things. General knowledge is about the new current updates and what policies are in motion or effect whereas business acumen will be insights into a specific industry and this could be divided into two aspects, what functional groups there are inside and what outside influences are there to an industry or a MNC.\n\nHaving insights into functional operations is important apart from that there might be industry insights across various industries. There are some trade secrets in every industry, you need not know every single trade secret, but you need to have an understanding of what industries are about. At the bottom line, you should be aware of the difference between an airplane manufacturing company and an airline company.\n\nThat is the bottom line that you should be aware of to what business acumen is out there. Some good preparation strategies to build up your business acumen are to watch YouTube case studies in general on government policies, how they are being built up, different company policies, how the company has spanned out, growth of a specific company. I would highly recommend Think School, it was something that I followed very closely. They covered business across industries and a lot of different strategies for international and national governance. They cover a lot of things, and their way of covering is very structured in a way that one would be able to adapt to this way very well.\n\n6) Are there any specific requirements such as department, CGPA, or other criteria for this position? Additionally, do certain PORs or EAAs enhance one’s chances of securing this internship?\n\nYou need not have a specific department, CGPA, or exact criteria, but your CV in general and in the broader sense should be a reflection of you working to the best of your ability and utilizing your time properly throughout your college years. I’ll rephrase this part once again. Your CV should convey a story that you always have been trying to do best. You have been curious throughout the years that you have spent in your college. You have always been there to try out different things and excel at them also.\n\nYou need not excel at each and everything, but you should be able to stand out because of your own experiences, what you have done, about what you have been through. From a CV one needs to understand or evaluate that if you have the aptitude or ability to adapt to such a new work environment, giving output at high efficiency.\n\nHence, these are something that are looked upon. Now transposing it to our KGP culture. Yes, positions of responsibility provide you an added exposure to manage teams, work in different teams, face scenarios, and work towards a common goal as a team. It gives you a very great exposure to honing your communication skills, presentation skills, and various other challenges that you face throughout a Position of Responsibility tenure, helping you with your aptitude and your mental solitude. But in the end, it is not necessary to have a position of responsibility.\n\nAgain, there are no such hard-bound criteria. But your CV should be a very good reflection of how you are there, trying your best, striving for the best, and achieving a lot of different things throughout your years.\n\n7) According to you, who should ideally apply for this job?\n\nThis will be very self-reflective. In brief, a student who is inquisitive, curious throughout, and ready to work long hours to make my goals come through, along with this thorough and sincere character. In brief, students who are ready to adapt, learn, and strive for the best will be ideally applicable for this job. And I believe it will be all of us as we are here in IIT Kharagpur. But in the second instance, people who want to have interest in this profile. A lot of people have an interest in tech and that is very well aligned with their interest in technology and various other tech roles that are there to offer. So it does not mean that these are different things, but it’s just people’s interest in different roles. And if they’re aspirational for this profile, McKinsey provides you with an amazing starting point.\n\n8) Lastly, what advice would you like to give to the students aiming to grab CDC internships this year?\n\nDon’t get demotivated. Keep trying throughout but it’s fine if it doesn’t align with your aspirations, as a person you all are much bigger than just this. CDC is not a true reflection of what KGP has to offer and it is not a reflection of you. CDC, to be very honest, can be very random at times or there could not be enough opportunities or opportunities that are made for you.\n\nOne need not worry as things in life will take time as we are all starting. We all are just undergraduates, to find our exact fit role and exact job profile that we love to work upon, takes time for everyone. So you might not find an internship or you might even find an internship, but you might not even like it. So there could be various situations. CDC is something that students do stress a lot about. But in my opinion, to be honest, They should NOT because you are graduating from a top prestigious IIT and you’ll figure your life out anyhow possible and you’ll be doing great. You’ve already made it once, you’ll make it once again. And CDC in general for internship and placement are a very small thing that you won’t even recall, once you are 10 or 15 years down in your career.\n\n9) What are some of the major points you think would be valid to mention in your CV while targeting this profile?\n\nFrom my personal experience, it could be anything that you want to tell your interviewer or tell the people who are looking at your CV. For me personally, I just mentioned what I thought brought out the most impact on me, challenged me a lot, and also something that I like. So for example, in my extracurricular activities, I put down some of my hobbies including landscape photography and volunteering at various organizations. This was something that I liked and if asked about it, I could talk about it. So it need not be necessarily that you need to follow a set format. You can be yourself while you are creating and pouring yourself down on that one white paper. So make a CV that is a true reflection of yourself and bring out not just the best in you, but you in general, how you are, what you are, what you strive for and what have you done so far."
    },
    {
        "job_role": "Consultancy",
        "company_name": "BCG",
        "info": "To excel in case solving and develop strong business acumen, I suggest starting with Victor Cheng’s YouTube playlist to grasp the case fundamentals. Then, dive into solving cases from reputable sources like the IIM -A and IIM -B casebooks",
        "content": "--\n\n1\n\nListen\n\n1) Brief introduction and description of offered role\n\nA) Hey guys, Sanil this side. I am a fourth-year student of the Department of Industrial and Systems Engineering and a boarder of MMM Hall of Residence. Previously, I have worked at multiple organizations such as Huddle, the National University of Singapore, Infinity Box and I will be joining the Boston Consulting Group (BCG) as a Summer Associate in the forthcoming summer. It is a pure consulting role, where I’ll work on assigned cases alongside diverse stakeholders, including clients, to devise strategic solutions for their challenges.\n\n2) How did you get into Boston Consulting Group? What was the selection procedure?\n\nA) BCG has a pretty standard consulting selection process. First, we had to submit our resumes on the CV Portal. Students are shortlisted based on their past experiences, CG, Position of Responsibility, Competitions, Extracurriculars, and so on. Then you are assigned a buddy (in most cases a KGPian) for the buddy process. Post the buddy rounds, I had my first round with the Project Lead at BCG. My second round was taken by the Managing Director and the third and last round by a Partner at BCG. After multiple rounds, the candidates are selected based on problem-solving acumen, structured case approach, and communication skills.\n\n3) How to prepare for them?\n\nA) To excel in case solving and develop strong business acumen, I suggest starting with Victor Cheng’s YouTube playlist to grasp the case fundamentals. Then, dive into solving cases from reputable sources like the IIM -A and IIM -B casebooks, and utilize resources like Case Interview Cracked for partnered practice with peers serving as case prep partners. Additionally, exploring casebooks such as the Wharton Case Book and SRCC Case Compendium can offer further exposure to a variety of cases.\n\n4) When did you start preparing for this role and according to you what is the ideal time for aspirants to begin their preparation?\n\nA) I believe candidates participating in the CDC Internship Session shouldn’t limit themselves to just consulting roles. It’s crucial to diversify options. Therefore, alongside preparing for other profiles, it’s wise to allocate a dedicated 1–2 hour slot daily for case preparation. Typically, dedicating around 1–1.5 months to case prep allows for a solid grasp of various case types and structuring methods. Consistent practice with peers is key, establishing a feedback loop to ensure incorporation of key takeaways from each case.\n\n5) What difficulties did you face while preparing to be a Consult at Boston Consulting Group? How did you overcome them?\n\nA) The major roadblock that the students applying for consulting roles face is the uncertainty revolving around the shortlisting process. I would recommend all the students applying for this role have faith and believe in their capabilities. A strong case prep can greatly improve your chances of securing internships in various other profiles and companies too. So, keep the prep good, help your friends, and don’t put all your eggs in one basket. Consulting shortlists can get random at one point. So, prepare well for other profiles as well.\n\n6) Are there any specific requirements such as department, CGPA, or other criteria for this position? Additionally, do certain PORs or EAAs enhance one’s chances of securing this internship?\n\nA) A well-rounded profile across all the sections significantly enhances the likelihood of receiving a shortlist. Moreover, an exceptionally high CGPA boosts your chances of being shortlisted in many profiles. So start attending classes and study well for your exams\n\n7) According to you, who should ideally apply for this job?\n\nA) Consulting attracts individuals who love real problem-solving through strategies and excel in managing multiple stakeholders simultaneously. Moreover, it appeals to those who are prepared to commit to long hours and seek a well-defined professional advancement ladder.\n\n8) Lastly, what advice would you like to give to the students aiming to grab CDC internships this year?\n\nA) An important suggestion from my end to all my fellow juniors apart from the existing generic fundae in different profiles, is ‘Always talk to KGP Alumni.’ They have gone through the same process before, they are well-versed with the different tricks and processes required to grab internships and placements in your so-called dream companies. I have seen many students engaging with alumni primarily to secure internships or jobs. However, it’s important to recognize that alumni often genuinely enjoy assisting their juniors in need. Therefore, don’t overlook the opportunity of grabbing such a valuable asset."
    },
    {
        "job_role": "Consultancy",
        "company_name": "L.E.K Consulting",
        "info": "When it comes to preparing for consulting interviews, one of the most important steps is to begin by crafting a strong CV. Ensure it showcases a balanced profile, emphasizing your academic accomplishments, previous internships, positions of responsibility (PORs), and involvement in extracurricular activities.",
        "content": "--\n\n1\n\nListen\n\n1) Brief introduction and description of the offered role\n\nHello, Abhyank this side. I am a 4th-year student of the Department of Geology and Geophysics and a boarder of Pt. Madan Mohan Malaviya Hall of Residence. I’ll be joining L.E.K. Consulting as part of their Summer Associate Program. With the program, interns are expected to get a thorough experience similar to that of a full-time associate at the company. Getting them to understand the know-how of consulting is their primary objective. Interns work with case teams and participate extensively in real-time client interactions while getting mentored by seasoned consultants.\n\n2) How did you get into L. E. K. Consulting? What was the selection procedure?\n\nOn Day 1, we encountered an intense but rather exhilarating selection process. It commenced with a senior consultant presenting me with a case study centered around a prominent healthcare entity. Subsequently, I faced a guesstimate round, where I was tasked to estimate the number of Ferris Wheels in the US. These initial rounds were followed by a Partner Round and an HR round, each contributing to the overall evaluation process. The last two rounds were mainly about my resume and past experiences evaluating a cultural fit with the company.\n\n3) How to prepare for them?\n\nWhen it comes to preparing for consulting interviews, one of the most important steps is to begin by crafting a strong CV. Ensure it showcases a balanced profile, emphasizing your academic accomplishments, previous internships, positions of responsibility (PORs), and involvement in extracurricular activities. Reviewing shortlisted resumes from seniors can provide valuable insights into the expectations and standards.\n\nExplore some resources that will help you become more familiar with guesstimates and case interviews. There are some great YouTube channels out there that offer excellent tutorials. Victor Cheng, Aaditya Agarwal, and IIT Bombay CIC are just a few examples of channels that provide valuable guidance. Gain a deep understanding of frameworks, specifically those related to profitability and market entry, and participate in collaborative practice sessions with a small group of 3–4 peers.\n\nImplement your learnings by practicing with useful sources such as Day One, Case Interviews Cracked, Case Compendium, and other Case Books from the likes of IIM A/B/C. Utilize the opportunity to participate in several practice rounds with seniors and assigned buddies who can provide their expertise to help you refine your approach.\n\nWhen starting, it’s immensely crucial to focus on structuring your thoughts rather than solely aiming for the correct solution. Select a range of case studies from different industries and employ a MECE (mutually exclusive, collectively exhaustive) strategy when developing your solutions. Strive for constant improvement after each case, prioritizing the quality of your cases rather than the quantity.\n\n4) When did you start preparing for this role and according to you what is the ideal time for aspirants to begin their preparation?\n\nI started my preparation with a slight delay but was fortunate enough to receive guidance from seniors to compensate for the lost time. I recommend everyone to initiate their preparation by focusing on crafting their CVs initially. This process calls for thorough attention and a significant time commitment.\n\nIdeally, aspiring candidates can kickstart their case prep around June, allowing ample time to gradually ramp up the intensity of these sessions. Starting early provides the advantage of structuring your preparation meticulously and also mitigating the likelihood of last-minute hurdles or rushed efforts.\n\n5) What difficulties did you face while preparing to be at L. E. K. Consulting? How did you overcome them?\n\nParticularly, navigating the compressed timeline between shortlists, buddy rounds, and the actual interviews can be a challenge for many. However, maintaining a robust preparation regimen beforehand was instrumental in overcoming the same. By dedicating sufficient time well before and familiarizing oneself with case interview frameworks, you can be better equipped to navigate the demanding schedule.\n\nStaying connected with seniors emerged as a crucial strategy for managing the anxiety posed during these days. Their first-hand experiences and insights proved invaluable in offering guidance and support throughout the period. Their advice not only helped me stay focused but also provided reassurance during moments of doubt.\n\n6) Are there any specific requirements such as department, CGPA, or other criteria for this position? Additionally, do certain PORs or EAAs enhance one’s chances of securing this internship?\n\nWhile there are no specific departmental requirements, maintaining a decent CGPA certainly enhances your chances of securing a shortlist. Although there are no hard cutoffs, a higher CGPA is generally advantageous.\n\nHighlighting your involvement with positions of responsibility (PORs) can greatly strengthen your candidature. It showcases your accountability and leadership skills, which are highly valued in the consulting role. Similarly, participation in extracurricular academic activities (EAAs) reflects a well-rounded profile and a genuine interest in fields beyond academics.\n\nMoreover, past internships, especially those relevant to consulting or demonstrating analytical and problem-solving abilities, can further help your application.\n\n7) According to you, who should ideally apply for this job?\n\nConsulting presents an intriguing opportunity for individuals with a natural aptitude for problem-solving and structured thinking. If you are someone who has a knack for solving complex challenges and thrives in fast-paced environments, you can give consulting a try.\n\nIt’ll offer you the opportunity to work across a wide range of sectors and collaborate with the best minds to solve complex business and strategy cases. The dynamic and challenging nature of the work creates a unique opportunity for rapid learning and helps you drive meaningful impact around real-world problems.\n\n8) Kindly attach your CV/Resume. What are some of the major points you think would be valid to mention in your CV while targeting this profile?\n\nOne valuable piece of advice I received from a senior was to review numerous CVs while staying true to your strengths. If you believe that your academic achievements are your greatest strength, don’t hesitate to showcase them proudly. The same principle applies to internships, PORs, or EAAs. Highlight your unique skills as companies seek individuals with diverse backgrounds and distinctive abilities.\n\n9) Lastly, what advice would you like to give to the students aiming to grab CDC internships this year?\n\nFirst and foremost, it’s important to maintain perspective throughout the process. While securing an internship is undeniably crucial, it’s important to keep in mind that not obtaining one in no way defines your capabilities. Understanding this perspective can help alleviate unnecessary pressure and allow you to approach the process with a more balanced mindset.\n\nThe internship application process can be mentally taxing, so don’t hesitate to reach out to your peers and seniors for support. Engage in open and honest conversations, share experiences, and lean on each other for guidance and encouragement. Remember, we’re all in this together, and supporting one another creates a healthy environment for growth and success as a community.\n\nYou need to stay resilient and focus on growth over this period. Regardless of the outcome, view the internship application process as a valuable learning experience. Take the opportunity to reflect on your strengths and areas for development, and use this insight to refine your skills and strategies for future opportunities."
    },
    {
        "job_role": "Consultancy",
        "company_name": "BCG",
        "info": "Make the CV impact-driven, start with impact words, and use numbers to justify this whenever necessary. A “STAR” approach often works well. Since all you have is a 1 pager CV to cover as many spikes as possible, it is optimal to focus on cumulatively maximizing the number of spikes rather than over-stretching on a single sector.",
        "content": "Foresight(2024) : Internship at BCG | Aorkodeep Mandal |\n\n--\n\nListen\n\n1)Brief introduction and description of the offered role\n\nHi everyone, I am Aorkodeep Mandal, a 4th-year Undergraduate student in the Department of Electrical Engineering with a Masters in Financial Engineering. I am a Placement Committee Member at CDC, IIT Kharagpur. I have interned with organizations like McMaster University, Columbia Business School, and The StartupLab. On campus, I have also taken up leadership roles at E-Cell, Finance Club, HJB Hall, and ShARE.\n\nI have been offered an Internship at The Boston Consulting Group (BCG) for the summer of 2024. This is a Front Office Management Consulting role where the selected candidate joins as a Summer Associate.\n\n2)How did you get into Boston Consulting Group? What was the selection procedure?\n\nThe selection process had 3 primary steps.CV ShortlistingBuddy RoundsCase Interviews.\n\nCV Shortlisting: In my opinion, this is the most important step. From a pool of over 1000 applicants, only a handful (12 to 20) candidates make it through. The CV for Consulting is unique and needs thorough preparation.\n\nBuddy Rounds: Once you make it through the CV Shortlisting, you are allotted 2 buddies. This is consistent across all the Consulting Firms that hire through CDC with the number varying between 1 and 2. Buddies help you out with queries that you may have before the interviews ranging from Case Prep to workplace info., expectations, and specifics.\n\nCase Interviews: Depending on the firm, you might be subjected to 1 to 3 rounds of interviews. The general hierarchy of rounds is Consultant Round, Project Lead (PL) Round, and Partner or MDP Round. Depending on the firm, these rounds can either be eliminatory or cumulatively graded.\n\n3)How to prepare for them?\n\nCV Prep:\n\nA Consulting Firm divides your CV into segments and looks for “Spikes”. Make sure to cover as many spikes as possible in the components mentioned.\n\nAcademic Spike: Having a good CGPA and academic track record is expected. In addition to that, scholarships, grants, paper publications, top-notch departmental rank, and DepC are pointers to be covered to have a spike in this section.\n\nWork-Ex Spike: Impact is honey to the ears of Consult. Having a decent track of internships/projects in brand corporates, reputed foreign universities, or work-ex in an impactful or relevant role leading to social good is appreciated.PORs Spike: Leadership positions on campus, such as VP, Placecomm, Institute Representatives, flagbearers of Cells and Fests, governing batch at a major society or club, etc. add towards this spike.Extra-Curricular Activities: This is an often neglected yet fairly important metric for consulting firms. National/International achievements, social work, entrepreneurial experience, etc. are often judging criteria.Competitions/Awards: Brand Competitions such as Inter IIT, Hult Prize, competitions conducted by brand corporates, GC, etc are important for a spike in this section.\n\nIt is important to keep a few more pointers in mind. Make the CV impact-driven, start with impact words, and use numbers to justify this whenever necessary. A “STAR” approach often works well. Since all you have is a 1 pager CV to cover as many spikes as possible, it is optimal to focus on cumulatively maximizing the number of spikes rather than over-stretching on a single sector. Get your CV reviewed by as many relevant people as you can and keep upgrading your drafts.\n\nBuddy Rounds:\n\nBuddy rounds are non-evaluative and have the sole purpose of preparing you for D-Day. Maximize the help you can extract from your buddies, with cases, sample answers to typical interview questions, and seek regular feedback. Although buddies generally do not decide your selection/rejection outcome, it is always helpful to be very well prepared before you form an impression in front of them. You should have prepared an ample number of cases with your case group (here, case group refers to the friend circle that practices cases with you) to be super confident before the chit-chat.\n\nInterview Rounds:\n\nCase Prep and a grip on the general HR questions will set you sail. These are the things to cover: Guesstimates, Cases - Profitability, Growth, Market Entry, Pricing, and Unconventional. Although M&A cases are not asked at an intern level, 1-2 cases in that domain won’t hurt.\n\nThese are some of the resources to follow:\n\nGuesstimates: The Guessing Game by Communique, IIT KGP.Cases: Day One (IITM), Case Interviews Cracked (IITB), IIMA Casebook, etc.Playlists to follow: Case Interviews Cracked IIT B, Victor Cheng - Look Over My Shoulder\n\nHR Prep: A good introduction expressing the person that you are and a few standard questions showing your grit and interest towards the role and alignment with the company.\n\n4)When did you start preparing for this role and according to you what is the ideal time for aspirants to begin their preparation?\n\nAs discussed, there are 2 elements to it: CV Prep and Case Prep.\n\nYour CV is a culmination of your college life experiences, so, there’s no ideal time to start. However, if you are planning to start now, the best time to start is yesterday :)\n\nWell, talking about Case Prep, 40 - 45 days before the interview rounds should be fine if you put in diligent efforts daily.\n\n5)What difficulties did you face while preparing for this Company/Profile? How did you overcome them?\n\nCase rounds are communication-heavy, which means, that even while you’re thinking through the case or structuring your thoughts, it is necessary to keep the communication flowing with your interviewer. At times, I felt overwhelmed with my thoughts that maintaining the communication stream felt distracting, however, as you practice more, you get a sense of working this out.\n\nTo take your case in the right direction, it is important to ask relevant questions in a structured manner. Structuring cases are ad hoc and there’s always a guilt of asking stuff at a later stage if they should have been covered earlier. However, again, the simple funda of life applies here, the more you practice, the drill to be on point gets better every time.\n\n6)Are there any specific requirements such as department, CGPA, or other criteria for this position? Additionally, do certain PORs or EAAs enhance one’s chances of securing this internship?\n\nThe best part about this role is that it is open to all the departments without bias, however, a decent enough CGPA is expected. Also, as mentioned earlier, PORs with good enough exposure to managerial and authoritative work add a spike. Exceptional achievements in EAAs are a plus point.\n\n7)According to you, who should ideally apply for this job?\n\nIn my opinion, people who love to solve problems, work in teams, have demonstrated effective leadership, and are ready to withstand hours of work are ideal for this role. Also, as this role demands a lot of travel and dynamic shifts, someone who is adaptable to changes should have a good deal with this role.\n\nHowever, this is one of the best job roles to have at this level where you get to explore different industries and work with top-tier management at such an early age. Therefore, I recommend\n\neveryone to give this a shot and get hands-on experience, helping them decide their career path.\n\n8)What are some of the major points you think would be valid to mention in your CV while targeting this profile?\n\nAs discussed earlier, a well-crafted CV is quite important for this role. It should be a good fit with your Brand Internships, Achievements, PORs, Competitions, Extracurriculars, etc.\n\n9)Lastly, what advice would you like to give to the students aiming to grab CDC internships this year?\n\nFor the Junta preparing for CDC Internships, it is better to keep yourself hedged. Prepare for at least 2 profiles if your profile has a limited scope of opportunity, for ex. Consult and Finance.The best part about this journey is the people you encounter. Relax buddy, everyone has their ups and downs during this phase. It is quite important to have friends who are reliable, comforting, and at the same time, push you to be the best version of yourself. Make sure that you speak to as many relevant seniors as possible. End of the day, you can not control the variables that are not in your hand, and trust me, there are a lot of these variables. What you can do is focus on your prep and make yourself an asset.\n\nWith that, wishing you all the best for CDC Internships!"
    },
    {
        "job_role": "Consultancy",
        "company_name": "Bain and Company",
        "info": "The major part of preparation is practising cases with your batchies or seniors, who will act as the interviewer and guide you through the case. You can practise guesstimates on your own as well.",
        "content": "FORESIGHT(2023): Summer Internship at Bain and Company | Ragini Laskar |\n\n--\n\nListen\n\n1) Brief Introduction\n\nHey guys, my name is Ragini Laskar. I am a fourth-year undergraduate student from the Department of Mining Engineering enrolled in its dual degree course of Mining and Safety Engineering. I am an upcoming associate consultant intern at Bain and Company. I have previously interned at firms like KPMG and have also taken up leadership roles in campus organizations like 180 Degrees Consulting, IIT Kharagpur and ShARE, IIT Kharagpur.\n\n2) How did you get into Bain and Company? What was the selection procedure?\n\nI got into Bain with the help of the Career Development Centre, IIT Kharagpur. It was one of the consulting firms that recruited interns through an on-campus process for the year 2022.\n\nThe process was as follows :\n\n1. CV Shortlist: The initial round of screening was based on our resumes. I submitted my CV on the CDC portal post which I received a shortlist confirmation\n\n2. Buddy Rounds: The shortlisted people are then allocated buddies. A buddy is allocated to clarify doubts, provide suggestions and most importantly to practise cases with. NOTE that these rounds are non-evaluative and are not counted as official interview rounds but should be treated as mock interviews in order to be better prepared for the official rounds.\n\n3. Official Interview Rounds: There are generally 3–4 rounds of interviews conducted depending on the candidate and the requirement of the firm.\n\nThe above-mentioned 3 rounds of interviews will be definitely conducted. Additional rounds with a partner/ manager might be taken depending on the process.\n\nAfter qualifying all these rounds, congratulations you are offered the position of an intern in the firm!\n\n3) How to prepare for them?\n\nThe are three important aspects of consult preparation:\n\nFor understanding concepts:\n\nFor cases and guesstimates practise:\n\nNOTE: The major part of preparation is practising cases with your batchies or seniors, who will act as the interviewer and guide you through the case. You can practise guesstimates on your own as well. An ideal approach would be to form a case group with 2–3 people interested in the same profile to practise cases consistently with and additionally practise a few cases with people who have gone through the consulting interview process to obtain more critical feedback.\n\n3. HR prep: A classy introduction goes a long way, but dont overdo it! Apart from intro, a few basic questions that are expected in such interviews are:\n\nA well-answered HR question is valued and a decent amount of weightage is given to your answers as they try to evaluate your fit not only to the role but also to the company culture\n\nAn ideal way to prepare for this can be\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem\n\n5) According to you, who should ideally apply for this job?\n\nAnyone with a knack for problem-solving and who possesses good communication skills can surely apply!\n\n6) Any specific advice you want to give to the junta sitting for internships this year.\n\n7) What are some of the major points you think would be valid to mention in your CV while targeting this profile?(any specific suggestions you would like to make?)\n\nAs mentioned before a few points that will be valid to mention in your CV are:\n\nAll the best for the upcoming CDC! Feel free to reach out in case of further queries"
    },
    {
        "job_role": "Consultancy",
        "company_name": "BCG",
        "info": "I would suggest thoroughly going through the books “Case Interview Cracked” and “Day 1.0: The Finance and Consulting Interview Guide”. All the available cases must be practiced with another person rather than going through them alone.",
        "content": "FORESIGHT(2023): Summer Internship at BCG| Dipanki Mukherjee Pabreja|\n\n--\n\nListen\n\n1) Brief Introduction\n\nHi, I am Dipanki Mukherjee Pabreja, a pre-final year student from the Civil Engineering department, and I shall be Interning at Boston Consulting Group this summer.\n\n2) How did you get into BCG? What was the selection procedure?\n\nThe following procedure is followed:\n\nCV Selection is the most critical aspect, as it is during this round that most of the candidates are eliminated. Around 1 CV is shortlisted for every 20 candidates.\n\nAfter CV Shortlisting, during our selections, two rounds took place. A project manager took my 1st round of Interview. This round generally involves the interviewer asking a guesstimate or a case question followed by a few HR questions.\n\nI was asked a guesstimate based on a topic that aligned with my interest that the Interview and I had talked about while introducing myself, followed by that a few HR Questions were asked like “What was the most challenging thing I have faced”.\n\nIn the third and final round, a partner takes the Interview, which mainly involves a case question. I was asked about a profitability case.\n\n3) How to prepare for them?\n\nCV Making:\n\nThe first thing one needs to do to get a shortlist for the interview rounds is to create a stellar CV. Consult firms look for spikes ( high points) in your CV. This can range from having a POR to attending various conferences, being part of international events, case studies or Internships.\n\nIt is essential to utilise your summers properly so that you can get hold of imminent internships or even apply for certificates like FRM/CFA. This gives the interviewer an idea that you are an all-rounder with diversified interests and experience.\n\nA POR gives the understanding you have been accountable and have managed different works in the past and have excelled in most of them. One also needs to maintain a decent CGPA. On average, 2–3 spikes are enough to get a shortlist.\n\nPast work in areas similar to that in consulting also helps as it showcases that you have previous experience and have successfully implemented and showcased your work and understand how client-facing roles work.\n\nGuesstimates and Case Questions:\n\nVarious resources are available on the net for the guesstimate and case questions. I would suggest thoroughly going through the books “Case Interview Cracked” and “Day 1.0: The Finance and Consulting Interview Guide”. All the available cases must be practiced with another person rather than going through them alone.\n\nThis gives an understanding of how one needs to think while a person is asking a question and if you can communicate your solution as effectively as it has been chalked out inside your mind.\n\nThus, try to find peers interested in similar profiles and start practicing cases with them from various sources to become proficient in all existing cases.\n\nCV Review and HR Preparation:\n\nPrepare your CV well, as the interviewer might also ask to explain certain aspects of your CV. Many times guesstimates and case questions are asked based on the things written on the CV.\n\nIt is essential to prepare HR Questions beforehand as well. Consultants prefer a structured answer, so one must answer these questions accordingly. It is easier if one has already practiced early, so one is not surprised by the questions asked.\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem\n\nTrying out guesstimates and case questions might become a bit daunting the first time. Various kinds of cases are there, and it gets difficult to understand how to structure them and solve such questions.\n\nHence it is essential that, alongside practicing with peers, you take constant help from seniors who have gone through the process so that they can point out the shortcomings and help you figure out a way to solve such questions.\n\nHave your CV Reviewed by multiple people to mitigate any errors; as stated before, CV Shortlisting is taken very seriously by consulting firms.\n\n5) According to you, who should ideally apply for this job?\n\nConsultants solve problems for firms; hence if you enjoy solving problems and chalking out practical solutions, this job is for you.\n\nConsulting is the way to go if a person wants to experience all different industries. It allows you to work out solutions for various firms and help them manage themselves better, giving an idea of numerous industries in a brief time period.\n\nConsulting also involves extensive working hours and travel, so one should choose accordingly.\n\n6) Any specific advice you want to give to the junta sitting for internships this year?\n\nTry to find where your interests lie and prepare for that profile accordingly. Various factors come into play during the internship season, so prepare your best and do not be disheartened by any setback.\n\nOne might feel uncomfortable even during the preparation hence try to be with like-minded people and have the support of everyone.\n\nTry to be optimistic; in the end, things will always go well. Best of luck."
    },
    {
        "job_role": "Consultancy",
        "company_name": "LEK",
        "info": "The unique thing about solving cases is that it’s important to solve cases with a partner — in this way, one of you can take the role of the interviewer and the other of the interviewee and you can get a better learning experience.",
        "content": "FORESIGHT(2023): Summer Internship at LEK Consulting| Diya Sarkar|\n\n--\n\nListen\n\n1) Brief Introduction\n\nHello! My name is Diya Sarkar. I am a 3rd-year undergraduate student from the Department of Chemical Engineering, enrolled in its BTech course. I’m a boarder of Mother Teresa Hall of Residence. I am a debater and former governor at the Debating Society, and a former member of Kharagpur Data Analytics Group. I currently reside in Mumbai. I will be joining LEK Consulting as a Summer Associate this summer.\n\n2) How did you get into LEK? What was the selection procedure?\n\nThe selection procedure started off with CV shortlisting, followed by a buddy round, a few rounds of case interviews and finally a personal interview.\n\nFor the CV shortlisting, LEK (like other consulting profiles) generally looks for “spikes” in your CV — this looks like excellent PoRs, CGPA, extra-curriculars, internships or projects. The more spikes your CV has, the better the chances for getting shortlisted. It is not necessary to have prior consulting experience (I did not have any), however internships at well-known companies (brand names) are valued.\n\nAfter getting shortlisted, you are assigned a “buddy” from LEK, with whom you collaboratively solve cases and learn how to prepare for the interviews.\n\nPost the buddy round, there are a few rounds of case interviews, where you’ll generally be asked cases of three types — guesstimates, profitability or market entry. In my instance, my PI and case interview were combined — so I answered questions based on my previous work experience, why I wanted to join consulting (and LEK specifically) and other standard HR questions followed by a case problem. This is to say that these rounds can be flexible and are different for different people, so make sure you keep an open mind and are able to adapt accordingly.\n\n3) How to prepare for them?\n\nThere are two kinds of interviews you need to prepare for — case and personal interviews.\n\nPreparing for cases is similar to preparing for any technical role — you go through casebooks and solve cases and you watch videos of mock case interviews. The unique thing about solving cases is that it’s important to solve cases with a partner — in this way, one of you can take the role of the interviewer and the other of the interviewee and you can get a better learning experience. You can refer to ISB, IITM or IIMA for their casebooks. Each casebook has a slightly different framework, so make sure you stick to what works best for you and become really well versed in that framework. Apart from that, you can refer to the Youtube channel Case Interviews Cracked to see how case interviews generally go. Another important aspect of case interviews is that the interviewer is testing your ability to think logically — so it’s okay if you don’t get to the final answer right away! You should be very communicative with your interviewer at every step through your case-solving process so that they know how you’re thinking.\n\nFor personal interviews, you should be able to explain your past work and your interest in joining the firm/field very well. Consultants are expected to be good at communication, so make sure you’re able to express yourself clearly and concisely when answering these questions. You can refer to the book “How to Answer the 64 Toughest Interview Questions” (don’t be intimidated by the name) for some standard HR questions.\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nI initially faced difficulties in properly communicating with my interviewer while solving cases. I think this was because I had a very results oriented approach — that I should somehow arrive at the right answer. This meant I rushed and was not always clear about my process and was even more so unable to communicate it. It’s important to be very thorough and go step by step while solving cases. Treat your interviewer like your collaborator — they want to help you reach the right answer. When starting out, it’s okay to take a lot of time to solve a case; if that means your fundamentals are clear. My main takeaways are: don’t hesitate in asking for clarifications and don’t rush to the final solution.\n\n5) According to you, who should ideally apply for this job?\n\nI don’t think there’s a specific “type” of person who is ideal for consultancy. Broadly, you should be open to learning new things in various fields and be willing to take a lot of accountability and initiative. Apart from that, being expressive and good at communication are important. However, I think the latter skills can be learnt and anyone willing to do so should go ahead and apply.\n\n6) Any specific advice you want to give to the junta sitting for internships this year.\n\nMy main piece of advice would be to keep reaching out to seniors for professional as well as personal advice during the intern season. CDC is a difficult and confusing process and you don’t want to lose out on any opportunity due to lack of information. Your seniors have probably gone through exactly what you’re going through right now and have more perspective given they’re now on the other side. Remember that it’s always better to ask a silly doubt and clear it, than to keep having silly misconceptions. I personally aspired for and also did much better than I ever would have if I were on my own because of the guidance and encouragement given to me by some amazing seniors.\n\n7) What are some of the major points you think would be valid to mention in your CV while targeting this profile?(any specific suggestions you would like to make?)\n\nClearly explain your previous work experience such that even someone who doesn’t necessarily have a lot of knowledge on the subject can understand what you did. The STAR framework is useful for figuring out a general structure for your CV. It’s worth it to put in extra time to format your CV well — 1 page long, minimum whitespace, no grammatical or spelling errors. This is especially true for non-tech roles such as consultancy, where the first step is generally a CV shortlist."
    },
    {
        "job_role": "Consultancy",
        "company_name": "LEK",
        "info": "Consulting shortlists are purely CV-based with no department biases (CG does matter, though, unfortunately).",
        "content": "FORESIGHT(2023): Summer Internship at LEK | Ram Sundaram |\n\n--\n\n1\n\nListen\n\n1) Brief Introduction\n\nAhh, the familiar “Intro De”.\n\nI’ll try to write this as frankly as possible and in the same spirit of honesty; I’ll also disclose that I’m also writing this in quite a hurry, aiming to finish this within the duration of a 2-hour flight, so please excuse me for grammar issues and anything else nonsensical.\n\nI’m also unsure if I’m allowed to swear in SWG articles, so I’ll be creative here and there. Additionally, I will assume that the reader is familiar with the basic CDC profiles and their general requirements. If not, here they are:\n\nI’ll start off, then, with the cookie-cutter KGP intro.\n\nMy name is Ram Sundaram. I’m a 3rd year (as of the time of writing this) undergraduate student of the Department of Biotechnology enrolled in its BTech course. I am a boarder of Vidyasagar Hall of Residence. I am from Bangalore, Karnataka.\n\nWith that done, some other stuff about me are that I’m currently the Head Finance at Business Club. I’m interested in a bunch of stuff like data analytics, finance, economics, and machine learning, but I haven’t really delved super deep into anything. I do quite like my core as well, but yeah, I ain’t pursuing that shoot because opportunities are severely limited, and a Master’s Degree is a minimum requirement, if not a PhD. I’m a lazy human being, so that’s not for me, for now, at least. I also did quite a bit of CP during my CDC prep and was actually focused on obtaining an analytics/SDE role, but as things would have it, I wouldn’t end up with any of the Day 1 Tech shortlists I wanted (probably due to a combination of my highly non-circuital department and my own underperformance in tests) and ended up in the most non-CP role possible with LEK Consulting, which I am nonetheless extremely grateful for.\n\n2) How did you get into LEK? What was the selection procedure?\n\nHow did I get into LEK? Well, to be honest, I’m still searching for the answer myself right now. I’m still a bit gob smacked as to how it all happened. However, I’ll do my best to summarize it here.\n\nSo, it all started off with my CV. Unbeknownst to me, I had a strong “Consulting CV” and ended up with two out of three big consulting shortlists. I’ll elucidate the CV requirements in a later section.\n\nI then got a call from a PlaceComm around a week before Day 1 informing me of the same. Usually, companies release shortlists a day or two before Day 1, but consulting companies like to be extremely early and take their pick of the best. In fact, they actually fight amongst each other in quite a comical fashion to get the first pick, with BCG and Bain having quite the dramatic selections last year, fighting over individual candidates. If anything, LEK lost out in this battle last year. BCG and Bain were able to select their desired candidates almost a week before Day 1, while LEK was left holding the bag and had to wait until Day 1. This year, I fully expect LEK not to fall into this trap again and select their guys and gals well beforehand.\n\nShortly after the shortlist call, I got an email from the LEK HR representatives themselves assigning me a “buddy”. All consulting companies use this buddy system. They assign you a buddy who’s a full-time junior employee (usually fresh out of college themselves). You can talk to your buddy, ask them any questions you have, and do case prep with them. Maintain a good rapport with your buddy, and they may put in a strong word for you with their management (who finally decide whether to select you or not). However, interactions with your buddy generally are very chill and relaxed. You don’t have to worry here. Your buddy is just here to help. My buddy was extremely helpful, did 2 or 3 cases with me over the phone, and helped me with all my questions about the interview procedure.\n\nSo, after this, we’re supposed to have “buddy rounds”, where we have a supposedly non-evaluative session with some of the more senior employees. Even though they say non-evaluative, believe me, these are very evaluative. They’re effectively the actual interviews themselves. Now, for me, there was some colossal duck-up, and LEK actually completely forgot about my existence during these Day 0 rounds (Day 0 is any interview procedure before Day 1) So, I wasn’t informed about these buddy rounds. So, I actually had a sped-up version of these buddy rounds on Day 1 itself. However, I’ve heard from my fellow interns at LEK and went through a similar experience with my Bain shortlist as well (they ultimately rejected me), so I can still tell you what happens here.\n\nNow, you usually have 2–3 interview rounds. The first one is with a manager; if you make it to the second, it’s with a partner at the firm. You can’t get in without the partner approving you. Think of him/her as the final boss. The interviews themselves could involve anything. They usually have cases or guesstimates (I will explain these below), but it could even be an ordinary discussion regarding the most random shoot. Personally, here’s how my interview rounds went:\n\nFor me, this entire interview process happened on Day 1, but usually, they conduct these a week before and informally extend offers by then. Then they make you sit for an interview on Day 1 as a technicality because they aren’t supposed to give out offers beforehand. This is so they can nab the good candidates earlier and prevent them from sitting for any other company interviews.\n\nIn general, the above-listed buddy round and interview process is a shared interview procedure among all consulting firms.\n\n3) How to prepare for them?\n\nNow, the first and, honestly, the most crucial step is making a brilliant CV to even get that shortlist. Consulting shortlists are purely CV-based with no department biases (CG does matter, though, unfortunately). I’ll talk about the actual things that make an excellent consulting CV in a later section, but one thing I’ll emphasize here is that you need to put effort into getting that CV perfect, even if it means spending hours on end fixing minute formatting details on ERP’s god-awful CV platform. Imagine being stuck in never-ending traffic on your way to the mall while your movie started 10 minutes ago in the theatre. That’s how frustrating it feels to make CVs on ERP.\n\nNow, onto post-shortlist preparation. Before that, let me just quickly explain what cases and guesstimates are. These are the most popular types of questions in consulting interviews. Guesstimates make you answer a strange question like “How many cigarettes are sold in a day in India?” and you have to walk the interviewer through your solution, segmenting things and coming up with a final answer. So, for example, in the above question, you could divide it into segments of the population that smoke, like college students, working professionals, etc. and break it down further to give a final number.\n\nCases are similar but are meant to emulate real-life consulting scenarios. Obviously, solving a real case takes months while you have a 20-minute interview, so they’re far simpler. There are different types of cases that you’ll learn about as you go through the prep materials, but they usually involve a vague question like “An electronics company has been facing losses recently. Figure out how to fix it.” You’ll then be expected to ask questions to the interviewer to find out more details about the company and drill down to the exact nature of the problem.\n\nAgain, if cases seem complicated, believe me, they are not, and you’ll understand quickly after looking at a few samples in the resources I’ll provide.\n\nAnyhow, back to the shoot you were here for. While it’s advisable to learn the basics and understand how cases work beforehand, please do not spend a significant amount of time of your CDC prep on cases in the hope of a consult shortlist. Consult shortlists are few and far between and extremely variable. If you are even slightly inclined to any other role that could use some prep, I’d advise you to focus on that until you get a consult shortlist. Once you get the shortlist, however, it’s time to shift gears and chug cases!\n\nI’ll first elucidate on the general strategy for preparing for consulting and then talk about my own personal preparation and the resources I used.\n\nI’d divide consult prep into two broad steps:\n\nHonestly, with enough dedication, case prep can be completed in a week or two. Hence, I advise only starting after a shortlist and doing something like CP or anything else in the meantime. Do Step 1 beforehand if you’re serious about consulting, but generally, wait until the shortlist to chug cases in Step 2.\n\nAlright, on to actual concrete things you can start right now and resources you can look at. While there are many routes for prepping, here’s what I did:\n\n4) What are some of the major points you think would be valid to mention in your CV while targeting this profile?(any specific suggestions you would like to make?)\n\nAlright, now for the most critical part of this blog, in my opinion. Your CV is everything for consulting. You’re in if you have the right CV. So, as I mentioned earlier, if you’re serious about this, put a lot of effort into making an undeniably brilliant CV. Now, in general, consulting companies look for a sort of all-round CV that needs a “spike” in every section. Also, there’s absolutely no department bias here; all are treated as equals. So, without any further ado, let’s look at the various CV sections and the possible “spikes”:\n\nTo summarise, try to have an all-round CV with spikes in different sections that make you stand out from the crowd. Also, spend a lot of time perfecting your CV to avoid correctable grammar and formatting errors.\n\n5) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nThe main problem I faced specifically with case prep was the frustration of being unable to solve cases. Initially, as with any new task, you will struggle, but seeing friends who had started prep earlier being able to solve cases quickly kinda sucked. It’s especially hard when you know your future hangs in the balance and depends on your ability to solve cases. In the end, I just put my head down, tried to solve as many as I could and eventually got the hang of it.\n\nApart from this, there was the standard CDC mental trauma. CDC is a ducked-up time for one’s mind, in my experience. You go to dark places, and all you really have to hang onto are your friends who are going through the same thing. But they’re all you need anyways.\n\n6) According to you, who should ideally apply for this job?\n\nIn my opinion, unless you really detest consulting and don’t want to “risk” getting offered an esteemed consulting job, apply. There’s no harm in applying; if you get shortlisted, fantastic!\n\n7) Any specific advice you want to give to the junta sitting for internships this year?\n\nI think I’ll use this medium to address two of the main talking points of CDC.\n\nFirst and foremost, as I mentioned earlier, your mind goes to dark places during this time. In KGP especially, there’s this extreme pressure to get your summer sorted, and that has messed-up ramifications. I recall stressing out over not getting shortlists and just launching into obscenity-filled tirades against certain companies (some still reserve a special place of abhorrence in my heart). I remember being the most nervous I was before my first interview with Bain and even ended up vomiting just a few minutes before the interview out of stress. I also screwed up the interview, so that just piled on the pressure. But at the end of the day, I had my closest friends going through the same thing as me, and the beautiful 5-year people were always there to help out, forcing me to consume some form of nutrition on Day 1 when I had no energy remaining to give another interview. The RR sessions helped a lot too, especially once we were back on campus (Day 0 interviews were online). To summarise, everyone goes through shoot during CDC; it’s perfectly normal. But, go through it together, please. Don’t keep it to yourself. Get together and launch into tirades about annoying companies, have RR sessions about PlaceComms and the process itself, and scream away your woes; it all helps. The important thing is reaching out. On that note, if anyone has reached this far into the article and is going through something and wants to reach out to me for any questions or anything in general, feel free to mail me at rams.dude@gmail.com (don’t ask for the backstory of the mail ID, please). I’ll get in touch asap and try to help as much as I can.\n\nThe last thing I wanted to address is the “To CP or Not To CP” question that crops up in everyone’s mind. I’ll try to keep my answer brief and lay down some facts beforehand. Generally, only a few Investment Bank roles (a lot like Goldman Sachs and JPMC still require a bit of CP in their tests), consulting roles, and the rare product roles don’t require some form of programming knowledge or CP. And this year, the scenario with hiring in a lot of IBs is still up in the air. So, not doing CP is a risk. However, if you absolutely detest technical roles and do not see yourself in any sort of SDE or Analytics role, then I’d say your time is best utilised elsewhere. However, if even a slight part of you doesn’t mind this kind of a role, CP is a vast safety net if the other options don’t work out. Also, always keep in mind that there’s a substantial off-campus world out there, too, even larger than the on-campus world, to be honest. It just needs a little searching (both LinkedIn and soul searching).\n\nAll the best, guys!"
    },
    {
        "job_role": "Consultancy",
        "company_name": "BCG",
        "info": "Those who love a fast-paced line with challenging problem statements, that can change the commercial or public sector as we know it, should put in a fight for consulting.",
        "content": "FORESIGHT(2023): Summer Internship at BCG| Aryansh Singh|\n\n--\n\n1\n\nListen\n\n1) Brief Introduction.Hey guys, Aryansh this side. I am a fourth year student of the department of Humanities and Social Sciences and a boarder of Patel Hall of Residence. In the past, I have worked at multiple organizations like Zomato, Invest India, Harvard Business School and now I am working as a Summer Associate at the Boston Consulting Group (BCG).\n\n2) How did you get into BCG? What was the selection procedure?Firstly, there are pre-placement talks, the shortlisting process started, which could depends on variety of factors such as CGPA, Position of Responsibilities, Past Experience, Extracurriculars and so on. After that, consulting firms generally have a buddy or case rounds. In my case, the first case round was taken by a Project Leader and the second by a Managing Director & Senior Partner at the firm. After multiple rounds, the candidates were selected on the basis of problem solving attitude, approach towards the case and communication and other skillset.\n\n3) How to prepare for them?You need to have a structured approach towards case preparation, alongside some good friends who can help you do extensive case practice.. Practice cases and guesstimates from books such as DayOne, Case Interviews Cracked and IIM-A Casebook. Those who prefer YouTube playlists can also refer to Victor Cheng’s video lectures.\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?The timeline between the CV submission, shortlist release and buddy/caserounds is often varying and can be very short too. In order to ensure goodcase skills, I believe candidates should be farsighted and do the requiredpractice beforehand. In our case also, I had a few amazing friends who helped me prepare beforehand, to ensure peace of mind during the final weeks.\n\n5) According to you, who should ideally apply for this job?Consulting is a natural fit for people with structured thinking and attention to detail. It is also a great opportunity to get exposure on a diverse set ofindustries, projects and problem statements that can help an individual gain considerable experiences across domains. Those who love a fast-paced line with challenging problem statements, that can change the commercial or public sector as we know it, should put in a fight for consulting.\n\n6) Kindly attach your resume. What are some of the major points you think would be valid to mention in your CV while targeting this profile? (any specific suggestions you would like to make?)A good CGPA helps a lot in getting shortlists (Not just for consulting, but ingeneral for CDC). Good exposure in past internships with meaningful work, that might be from any domain, be it Strategy or Finance or Tech, wil surely help you shine out. Some entrepreneurial experience or acts of initiative might also help you boost your chances of getting shortlisted.\n\n7) Any specific advice you want to give to the junta sitting for internships this year?You’ll hear a lot of competition, tips-tricks, rumors, toxicity and what not when it comes to preparation or shortlists or transparency of process. There might be a constant sense of insecurity about your preparation or what you deserve. But always remember: There is no right path to a particular role, for everyone has to pave their own journey. There will be a whole lot of random variables, but the right mindset will always take you places. Getting an internship is not the end of the world; being happy is."
    },
    {
        "job_role": "Consultancy",
        "company_name": "Bain and Co.",
        "info": "In order to prepare for the interview process at Bain, there are two things that one must prepare for: Guesstimates and Business Cases.",
        "content": "FORESIGHT(2023): Summer Internship at Bain and Co. | Bharat Uday|\n\n--\n\nListen\n\n1) Brief Introduction\n\nMy name is Bharat Uday. I am from the Department of Electrical Engineering enrolled in its B. Tech course. During the CDC Internship drive, I received an internship from Bain and Co. at their New Delhi (Gurugram) office.\n\n2) How did you get into Bain & Company? What was the selection procedure?\n\nSo this was the first time Bain and Co. came to campus to offer the ACI role (Associate Consultant Intern). The selection process comprised 3 major segments. The first was CV shortlisting; this is where all your past experiences, extracurriculars, PORs and achievements are evaluated. Next up, after CVs were shortlisted, we had the Buddy Sessions wherein a Buddy (i.e. a person working in Bain) is allotted to you, with whom you can prepare for the upcoming interviews; this involves case prep and guesstimate prep. Post the buddy round, we had a manager interview and then finally a partner round which mainly included questions from your CV and general HR questions and one case or guesstimate.\n\n3) How to prepare for them?\n\nIn order to prepare for the interview process at Bain, there are two things that one must prepare for: Guesstimates and Business Cases. There is no such extensive preparation that is required for consulting interviews. You just have to be very articulate, clear and have good quantitative abilities. So to prepare for these, I used majorly two books during the last 2 weeks before my interviews: Case Interviews Cracked (CIC — IIT Bombay) and Day 1 (IIT Madras). Guesstimates can also be practised from the same books. However, more than just the “book” oriented prep, it is more important to have an overall case prep in groups. So it is always advised to make a small group of people who would sit together daily and prepare for these cases and guesstimates. This is a process where one person is the interviewer and asks the other (interviewee) to proceed with the case or the guesstimate.\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nMajorly the problems I faced while preparing for interviews at Bain was that this was the first time it was coming to campus, so there were no seniors to talk to about what the process is actually like and what all happens during the process, so I had to contact ACIs from other IITs and talk to them about how the process proceeds further. Secondly, finding a case group is a challenging task, where everyone is motivated enough for consulting case prep and wants to take time out.\n\n5) According to you, who should ideally apply for this job?\n\nThis job is basically for people who like to solve business problems, have business acumen and have a slight analytical background. Also, no specific skill set is required for a management consulting job, so nothing as such is needed like other roles of finance, quant or SDE.\n\n6) Any specific advice you want to give to the junta sitting for internships this year.\n\nAdvice from my end would be that CDC is a very challenging and long process that takes a lot of toll on one’s mental and emotional health. I just want everyone to be part of groups, prepare together and stay in touch with seniors and mentors throughout the process. Also, it is essential to understand that a particular company might always be the right fit for you, and that can be grounds for rejection as well, and you never have to take rejections personally.\n\n7) Kindly attach your resume. What are some of the major points you think would be valid to mention in your CV while targeting this profile?(any specific suggestions you would like to make?)\n\nSo CV is one of the most important aspects of the selection process at Bain. They would generally look for peaks in order to shortlist CVs."
    }
]