[
    {
        "job_role": "Core",
        "company_name": "Texas Instruments",
        "info": "don’t lose hope. It’s a marathon, not a sprint. Keep putting your best foot forward, stay persistent, and trust in your abilities.",
        "content": "FORESIGHT(2024) | Internship at Texas Instruments | Kshitij Banerjee\n\n--\n\nListen\n\nHi, I am Kshitij Banerjee, a 3rd year undergraduate student of IIT KGP in the department of Electrical Engineering. I got an offer from Texas Instruments for an internship in the summer of 2024 from the on-campus CDC internship drive.\n\n2. How did you get into Texas Instruments? What was the selection procedure?\n\nThe selection process consisted of three stages: CV submission, an online test, and an online interview. The online test comprised four sections: Embedded software, Analog, Digital, Signal Processing, and an aptitude section. Candidates could select two profiles; I opted for Embedded and Digital. The Embedded section included fundamental C questions, while the Digital section covered topics like flip-flops and adders.\n\nDuring the one hour interview with a company manager, I faced detailed inquiries about my projects, including one involving Arduino. It is important therefore to have a sound knowledge about your projects which you have mentioned as the interviewer might delve deeper into them. Additionally, there were basic queries about C programming.\n\n3. How to prepare for them?\n\nAs electrical students cover embedded systems in the 6th semester, there weren’t specific questions on this topic. However, possessing fundamental knowledge of microcontrollers, assembly language, etc., can be advantageous. For digital and analog profiles, the courses from the 3rd and 4th semesters suffice.\n\n4. When did you start preparing for this role and according to you what is the ideal time for aspirants to begin their preparation?\n\nI didn’t specifically gear my preparation towards this role. I had two CVs ready, one tailored for software and the other for core profiles. Proficiency in your second-year courses will suffice for this role, and you can refresh your knowledge during the summer break.\n\n5. What difficulties did you face while preparing for this Company/Profile? How did you overcome them?\n\nDifficulty in finding suitable practice questions can be a challenge. One can refer to Gautam Saha’s slides for digital topics and Himanshu Agarwal’s YouTube channel for analog questions. While familiarity with Verilog can be beneficial, it’s not mandatory.\n\n6. Are there any specific requirements such as department, CGPA, or other criteria for this position? Additionally, do certain PORs or EAAs enhance one’s chances of securing this internship?\n\nPreference is given to candidates from circuital branches as their coursework directly correlates with the job profiles. While there isn’t a strict CGPA requirement, a CGPA above 7.5 is considered satisfactory. Participation in PORs/EAAs may not heavily influence selection, but experience in relevant extracurricular activities such as robotics clubs could potentially enhance candidacy.\n\n7. According to you, who should ideally apply for this job?\n\nThe ideal candidate for this job would be someone with a genuine interest in the core aspects of the profile. Specifically, individuals with a strong foundation and extensive knowledge in areas such as semiconductors, microprocessors, and computer architecture are well-suited to apply.\n\n8. What are some of the major points you think would be valid to mention in your CV while targeting this profile?\n\nOne major point to highlight in your CV is any relevant projects you&#39;ve undertaken within domains related to the CDC internship. These projects serve as tangible evidence of your practical skills and understanding in these areas, making them highly beneficial additions to your resume.\n\nWhen elaborating on such projects, consider including details such as the problem statement, your approach or methodology, key challenges faced, and most importantly, the outcomes or results achieved.\n\n9. Lastly, what advice would you like to give to the students aiming to grab CDC internships this year?\n\nIt’s easy to assume that the selection process is solely merit-based, where the most skilled candidates rise to the top. While skills are crucial, there’s a layer of unpredictability that often surprises many applicants. You might witness someone less experienced landing an internship on day one while the brightest minds wait in anticipation for weeks or even longer.\n\nThis might feel discouraging, but here’s the thing: the CDC selection process isn’t always a perfect reflection of your abilities. Factors like timing, the specific needs of the teams, and yes, luck, can heavily influence who gets shortlisted and when.\n\nSo, my advice to you all is this: don’t lose hope. It’s a marathon, not a sprint. Keep putting your best foot forward, stay persistent, and trust in your abilities. Sometimes, the process might seem partial or arbitrary, but remember, it’s just that — a process. Your time will come, and when it does, all the waiting and uncertainty will feel worth it."
    },
    {
        "job_role": "Core",
        "company_name": "Dr Reddy",
        "info": "For the GD round, knowledge of unit operations and other basic concepts was required. This round is one of the biggest hurdles in the entire selection procedure, as more than 50% of students are eliminated at this round",
        "content": "FORESIGHT(2024) |Internship at Dr Reddy | Tarun Goyal\n\n--\n\nListen\n\n1. Brief Introduction description of offered role:\n\nHello! I am Tarun Goyal, a 5th-year undergraduate student from the Department of Chemical Engineering enrolled in its dual degree course. I got a summer internship at DRL on day 3.\n\nThe role offered was Core (Technical Training at Manufacturing and R&D sites) — This role was open to Chemical and Mechanical Engineering students. I have got the manufacturing role at Pydibhimavaram(Vizag)\n\n2. How did you get into Dr. Reddy’s Laboratories? What was the selection procedure?\n\nThe selection procedure of the core profile consists of 4 rounds:\n\n· First and foremost, there is a round of CV shortlisting. You have to submit your CV through the ERP.\n\nThey did not specify CG criteria, although most people with CG over 7 get shortlisted for the subsequent round.\n\n· Online test (duration — 1hr) — The test mainly had questions based on core Chemical Engineering (easy + average level questions), psychometric and reasoning-based questions, and a few basic questions from chemistry (biomolecule & polymers). 70 students qualified for the GD round (core profile).\n\n· Group Discussion round — The GD round was the primary elimination round. It was technical. Every group (10 students) was given a different topic to discuss. The GD problem was about fluidized bed reactors. 30 students (+2 got extended shortlist later) qualified for the interview round (core profile).\n\n· Interview — There were two interviews for approximately 35–40 minutes of technical + 5–10 minutes of HR interview. The interviewer asked the first question, “Do you have an interest in pharma, and do you want to go for the core?” then I was asked to introduce myself. I was asked situation-based questions on actual problems in pharma, and I needed to answer them using very basic chemical engineering concepts. Even someone who passed every semester can answer those questions. Most of my interview questions revolved around the humidity. Some questions that were asked -\n\n1) “How will you make a tablet from a powder?”\n\n2) “If you have to coat a powder on a tablet, how will you do that?”\n\n3) “You want to protect your capsule from a humid environment. How will you ensure that?”\n\n4) “You have a powder in an open environment. What will affect it’s flowability?”\n\n5) “If you are using an air dryer in a process and the environmental conditions are not the same every day, how will you take care of the humidity of the air?”\n\nand many more questions. My interview was a bit longer than others, and he was very impressed with my way of answering. He didn’t want the exact terms but how you think and approach the problem.\n\nAnd according to your answer, he will drive the interview in that direction. He was very supportive and patient to hear you and shared many things during the interview. He helped me figure out the correct approach for answers to some questions. The very last question was about dry-bulb and wet-bulb temperature.\n\nThen the HR round was there, which was online. She just asked me to introduce myself, then I told her about leading the team of ‘chem-quest’, so she just asked what that contest’s problem statement was.\n\nThen she asked me about my family and if I was a B-tech to dual conversion or dual from the start. What other options do I have during the Jossa counseling? Then she asked me about my preference for location wise and role wise. She hinted at the end, “See you soon at work.” we hung up the call.\n\nBoth the interviewers were peaceful, jolly, calm, and mature people who tried to understand the other person.\n\nFinally, 7 students were selected for the core profile (from CH duals), 1 student (from B-tech CH), others from the Mechanical department (I guess 3–4)\n\n3. How to prepare for them?\n\nA) For the test round, solving 11th-12th chemistry questions (biomolecule, polymer, and chemistry in everyday life) and aptitude questions will be good enough to get through it.\n\nFor the GD round, knowledge of unit operations and other basic concepts was required. This round is one of the biggest hurdles in the entire selection procedure, as more than 50% of students are eliminated at this round. But, thinking about the problem statement in terms of whatever basic concepts you have studied can be helpful.\n\nFor the interview, They don’t ask about your CV. One should be clear with the basic concepts of chemical engineering and their application in real-life problems.\n\n4. When did you start preparing for this role and according to you what is the ideal time for aspirants to begin their preparation?\n\nI started preparing a day before the online test. I think if a person is regular with classes, he/she doesn’t need any further time to study. Just need to practice some basic rules of GD and give mock interviews & GD. So the ideal time for anyone targeting a core role in chemical engineering can even be a day before the online test or the day before GD.\n\n5. What difficulties did you face while preparing for this Profile? How did you overcome this problem?\n\nI never prepared anything for the profile as such in 3rd year, I started studying core, but still, my basics weren’t clear. However, I knew things to some extent. Like it wasn’t Greek to me. Throughout the process, I tried to use the concepts of chemical engineering from the 5th — 7th semester.\n\n6. Are there any specific requirements such as department, CGPA, or other criteria for this position? Additionally, do certain PORs or EAAs enhance one’s chances of securing this internship?\n\nIt’s open only for 2 departments; moreover, if you are from chemical, you competition is very low here, CGPA — no criteria No other criteria other than you are interested in core or pharma. I don’t think they are looking for past interns/pors or EAAs they don’t even look at CVs after CV shortlisting\n\n7. According to you, who should ideally apply for this job?\n\nAnyone who is interested in core and wants to understand or evaluate the practical implications of their core domain knowledge or wants to know how the pharma industry works can apply for this profile. Aside from that, I feel that everyone with even a slight amount of curiosity should apply because the experience would be unique, and you could get motivated after working there.\n\n8. Any specific advice you want to give the junta, sitting for internships this year.\n\nI have a few pieces of advice for students who will be sitting for the internship this year-\n\nTips for CV-\n\nMake a separate CV for separate roles. I have seen people making one CV and applying in every role like you cannot apply with a data science CV in a core profile. Give time to prepare the CV for independent roles.\n\nTips for Test-\n\nNCERT — biomolecules polymers and chemistry in everyday life practice logical and reasoning questions. Time is the key try to finish as early as possible\n\nTips for GD-\n\nIf you know about the topic, do start the discussion but don’t discuss everything in one go, or don’t jump to later points. In GD, they give you 4 questions to discuss, and you have 5 minutes. If you start, discuss your views on 1st point, then keep quiet and let others speak. When discussing the 2nd point, only talk about the 2nd point; don’t discuss any other point. 3–4 points in total would be sufficient. At last, you can talk about any point you would like to add. Stay attentive, or at least show yourself attentive.\n\nThings to avoid during GD-\n\ndon’t start if you have no idea on the 1st question. Let others speak, and you catch up with your understanding\n\ndon’t speak irrelevant talk quality, not quantity\n\ndon’t just start and end at last, giving no chance to others to speak. This is teamwork, not a boring lecture,\n\ndon’t repeat points,\n\ndon’t cut others in between,\n\ndon’t get aggressive or dominant,\n\ndon’t jump over other points. Go step by step. The questions are given for a reason.\n\nTips for Interview-\n\nHave faith and confidence in you.\n\nIf you have no idea, say, “I don’t know” or “I don’t remember.”\n\nWhen the interviewer tells you about something, try to hear it clearly and understand it. If unclear, repeat his words by saying, “Just to be sure…” or ask the interviewer what you haven’t understood. This gives the sense you are trying to learn. Try to use this not more than twice but at least once.\n\nAsk your friends what questions were asked so that you are mentally prepared for such questions and you don’t go blank suddenly.\n\nGeneral Tips — (what helped my profile to go up)\n\n1) Everyone is in a white shirt and black pants — try to have different color formals. Some will say how that matters, so everything matters. No one wants to see the same thing again & again. I was very well identified by my dress color. I was able to stand out in the crowd of black & white.\n\n2) have a smile on your face when interacting with the interviewer like I got it naturally. Everyone wants to see happy faces\n\n3) Listen carefully — during the GD, the evaluating person gave his intro (I don’t remember his name). Still, I was showing so much attentiveness towards him that he started his intro while looking at everyone, but at a certain point, he only had eye contact with me. (this was the golden thing for my GD selection).\n\n4) Everyone says the CDC is just fake people with less knowledge get better opportunities, but remember, it’s not just about knowledge. It’s about how you present, how you show yourself. Presentation and standing out of the crowd ease your path to a large extent. Give time for proper outfit and appearance.\n\n5) Look professional. Don’t take a page of CV and a copy with a loose tie, and un-buttoned collar button that looks so unprofessional. Have proper attire. The CV should be in a file with other supporting documents and have a professional diary while entering the room. Tie the collar button properly along with a proper tie. If you are unwilling to button the collar button, don’t wear a tie. Have proper perfume before going for the interview. Have a trimmed or properly shaped beard.\n\n6) As you meet the interviewer, greet them with a smile. Everyone loves that.\n\n7) Be confident about what you say. DRL interviews are one of the most peaceful interviews you gonna ever have.\n\n9. What are some of the major points that would be valid to mention in your CV while targeting this profile?\n\nThey hardly see the CV or ask anything from the CV. At least in our case, they weren’t grilling anyone on the CV. but having a proper specific Core CV for this would be beneficial to mention the competitions in which you participated or led the team.\n\nMention your past internships or industrial training, mention core projects and manufacturing-related projects or internships and try to relate the concepts learned in the past internships and projects to the interviewer’s questions by saying, “Like if I take the case from my past internship …” I used this when he asked me about something related to manufacturing.\n\nBEST OF LUCK!!!"
    },
    {
        "job_role": "Core",
        "company_name": "Nvidia",
        "info": "I studied the basics of Verilog from Prof. Indraneel Sengupta’s NPTEL Course. Similarly, I went through a bit of Computer Architecture (the first 10–12 lectures) from the NPTEL course on the same.",
        "content": "--\n\nListen\n\n1) Brief introduction and description of the offered role.\n\nMy name is Sneharghya Debnath. I am a third-year undergraduate student of the Department of Electronics and Electrical Communication Engineering enrolled in its BTech course. I’m from Kolkata, West Bengal. I received an internship offer from Nvidia in 2023 in the Hardware Profile. As an ASIC intern, one has to work on the design and verification of digital ICs.\n\n2) How did you get into Nvidia? What was the selection procedure?\n\nThere were two rounds — an MCQ test and a technical interview of 45 minutes.\n\n3) How to prepare for them?\n\nThe course on Digital Electronics in the 4th semester and the NPTEL course on Digital Electronics by Prof. Gautam Saha are sufficient for the concepts required. It is also good to have some knowledge of analog electronics — the underlying principles of digital circuits, for which Razavi is a great book. For the programming section — the 1st year course on Programming and Data Structures is sufficient (the Data Structures part isn’t even required). For the aptitude section, it is best to practice from the previous year’s papers. Verilog and Computer Architecture weren’t covered in my coursework as I just completed my 4th semester. I studied the basics of Verilog from Prof. Indraneel Sengupta’s NPTEL Course. Similarly, I went through a bit of Computer Architecture (the first 10–12 lectures) from the NPTEL course on the same. It is good to go through the concept of Static Timing Analysis, for which any YouTube Video is sufficient. For the puzzles asked in the interview, I went through some of the GFG puzzles.\n\n4) When did you start preparing for this role and according to you what is the ideal time for aspirants to begin their preparation?\n\nI started preparation in the summer break after my 4th semester. According to me, this is the ideal time for aspirants to start their preparation.\n\n5) What difficulties did you face while preparing for this Company/Profile? How did you overcome them?\n\nThe best way to understand/verify a complicated circuit is through simulations. Verilog simulations are helpful for understanding the digital circuits, while SPICE simulations can help in proper understanding of transistor-level functions. For any difficulty I faced during the preparation, first I used to consult books/notes/online material followed by simulation if not resolved by the above.\n\n6) Are there any specific requirements such as department, CGPA, or other criteria for this position? Additionally, do certain PORs or EAAs enhance one’s chances of securing this internship?\n\nStudents from Departments like CSE, ECE, and EE can only apply for the internship at Nvidia in the Hardware Role. The company had a CGPA cutoff of greater than 8. PORs are not necessary.\n\n7) According to you, who should ideally apply for this job?\n\nStudents having a keen interest in Digital Electronics and Computer Architecture should apply for this internship.\n\n8) Kindly attach your CV/Resume. What are some of the major points you think would be valid to mention in your CV while targeting this profile?\n\nMajor Points to include in CV are:\n\n9) Lastly, what advice would you like to give to the students aiming to grab CDC internships this year?\n\nIt is very useful to solve the previous year’s questions to ace the MCQ test. For the interview round, the key is to be confident and share your thoughts, even if you’re unsure. The interviewers are more interested in your problem-solving skills and thinking approach than the answer."
    },
    {
        "job_role": "Core",
        "company_name": "JLR",
        "info": "The most important chapters asked here are Mechanics of Solids, Fluid Mechanics, Design of Machine Elements, Kinematics and Kinetics of Machines, Basic Thermodynamics(including all the cycles there in the syllabus), and IC Engines.",
        "content": "--\n\nListen\n\n1) Brief introduction and description of the offered role\n\nA: My name is Sayantan Sarkar. I am a third-year undergraduate student of the Department of Mechanical Engineering, enrolled in its B. Tech course. I am from Howrah, West Bengal, and a boarder of JCB Hall of Residence.\n\nI have been offered an internship in the Mechatronics profile of Jaguar Land Rover. This is a core profile and mainly delves into the automotive industry. JLR is a fast-progressing company manufacturing luxury cars and is the luxury brand of TATA.\n\n2) How did you get into Jaguar Land Rover? What was the selection procedure?\n\nA; I am a huge automotive enthusiast and I was primarily aiming for the core profile in the CDC Internship process. Being in TeamKART, the official Formula Student Team of IIT Kharagpur, I was already aware of the intricacies of automotive engineering and this helped me a lot in getting selected to JLR. Apart from that, my passion for core mechanical engineering was another driving factor behind my selection.\n\nThe selection procedure consisted of 2 rounds:\n\n3) How to prepare for them?\n\nA: Aptitude Section: For this section, there is no strategy of preparation. It all comes from IQ and lots of practice. Here, students generally solve the questions in GFG and many other websites that offer aptitude questions. You can practice them in your leisure time, but there is no requirement for a dedicated timeline of preparation.\n\nMechatronics Section: For this part, You need to cover the concepts of the subjects in the curriculum of the Mechanical Engineering Department and the related disciplines. The most important chapters asked here are Mechanics of Solids, Fluid Mechanics, Design of Machine Elements, Kinematics and Kinetics of Machines, Basic Thermodynamics(including all the cycles there in the syllabus), and IC Engines. A knowledge of Basic Electronics is important too. However, the Basic Electronics course is conducted in most of the departments, so it carries on well. Solving the last 10 years of GATE Mechanical PYQ will surely help in acing this section since plenty of questions come of similar pattern.\n\nCoding Section: For students applying solely for the Mechatronics profile, only 2 coding questions were asked, and were of medium level. For preparing, regular practice of easy and medium-level competitive programming problems on platforms like Codeforces and Leetcode will do. The coding round has less weightage for this profile and questions are doable too.\n\n4) When did you start preparing for this role and according to you what is the ideal time for aspirants to begin their preparation?\n\nA: Preparation starts from the day you start reading Science. Every concept you gain, and every problem you solve adds to the insights you gain and eventually helps in the long run. Being in TeamKART, we were trained extensively in theoretical as well as hands-on training during our tenure. Also, being in other research groups like ARK and KRSSG in their mechanical teams, every work I did, the designs I contributed, and the environment that I got, added more and more to my love for core mechanical engineering, and hence the knowledge came forth almost spontaneously. As the summer vacation started, I started revising my concepts from my second-year courses and also started practicing MCQ questions. I was aiming mainly for JLR and Bajaj since they were the only 2 core mechanical companies(especially, in automotive roles) coming within CDC Day 2. I also found some nice projects to work on under a few professors which diversified my role.\n\nAccording to me, the ideal time for starting preparation is as soon as the summer vacation begins. Many students start to get involved in mugging up random things for CDC during the semester and feel like being ahead of time will help. Maybe it does but sacrificing semester studies is not worth it, is what I feel. Whatever others might tell, CG, to some extent, MATTERS, at least it is required to keep CG above 8. The companies might not give a CG cutoff officially, but internally, it does help in filtering out students. So, better concentrate on the semester when it is going on. It is advisable to find core projects and extensively work on them during the 3 months of vacation. You can also take up Internships and projects in other IITs or Industries, only if it gives you ample time to carry out your preparation simultaneously.\n\n5) What difficulties did you face while preparing for this Company/Profile? How did you overcome them?\n\nA: The major difficulties I faced during my preparation were:\n\n6) Are there any specific requirements such as department, CGPA, or other criteria for this position? Additionally, do certain PORs or EAAs enhance one’s chances of securing this internship?\n\nA: The specific requirements are as follows:\n\n7) According to you, who should ideally apply for this job?\n\nA: According to me, people with true dedication to core mechanical fields, be it interest in vehicle dynamics, be it fluids or robotics, etc. are advised to surely apply for this profile. Again, there is this system that if you apply for more than one profile, you will still have only one test. For example, if you are applying for both mechatronics and software, then you will have a single test with aptitude, mechatronics, and software sections, with 3 coding questions instead of 2 and higher weightage on software. So, selection in a profile is where you scored higher. The chances of selection in those cases are lesser. So, avoid applying in more than one profile. Another point is if you are not seriously targeting your future in the core, it is not recommended to waste your time preparing intensively for this job. Better invest it wisely in preparing for your profile. Don’t just fall for peer pressure.\n\n8) Kindly attach your CV/Resume. What are some of the major points you think would be valid to mention in your CV while targeting this profile?\n\nA: My CV at the time of applying for CDC is attached in the Google form. The major points you need to highlight in your CV for people targeting this profile are as follows:\n\n9) Lastly, what advice would you like to give to the students aiming to grab CDC internships this year?\n\nA: Last advice I would give all of you aiming to grab CDC this season, BELIEVE IN YOURSELF. You have skills you have never thought of. As I said before, accept this as a phase of life. Don’t take it as a necessity of your life like you did during your entrance preparations. Rather, take it as a learning process. For example, suppose, you read 3rd-year courses during this time at the end of the 2nd year, even if you don’t crack the exam, you will lessen your load during the upcoming semester. If you appear for GATE the following year, again that will be useful, since you know the concepts and already tried yourself at the PYQs. As I said, every knowledge you intake, you will get paid for that for sure someday. CDC is a long process, continues till next year April, and happens in 2 phases. Keep patience and move on. If you get selected in interviews, don’t consider it as a question-answer session, rather look at it as a discussion. The more you get a vibe check, the more successful you will be. They always want you to reach the answer by some means, and they have no reason to demote you. Be honest, and be true to yourself. Don’t fake answers. If you can’t answer some questions, admit it. If you want to take time, ask them for 2 minutes to think. And don’t think quietly, talk with yourself while thinking of an answer. This will help the Interviewer know your thought process. This increases your chances of selection. Well, even after all of this, if nothing happens, you have MITACS, DAAD, SPARK, and a lot of other internships coming ahead. Then there are projects here too under the professors. Life is way too big. Don’t just get stopped by any hurdle coming by. Move forward. The world is waiting for you. Remember, you are an IITian.\n\nALL THE BEST EVERYONE !!!"
    },
    {
        "job_role": "Core",
        "company_name": "Bajaj Auto",
        "info": "For the technical test, it’s crucial to have a solid grasp of core mechanical subjects like Solid Mechanics, Thermodynamics, Heat Transfer etc. and should also have a decent understanding of some first year mathematics",
        "content": "FORESIGHT(2024) |Internship at Bajaj Auto | Ashutosh Dash\n\n--\n\nListen\n\nHello everyone! My name is Ashutosh Dash. I am a 4th year undergraduate student of the department of Mechanical Engineering with a specialization in Financial Engineering. I am from Bhubaneswar, Odisha. I will be joining Bajaj Auto as a summer intern in its R&D Department for the summer of ‘24.\n\n2. How did you get into Bajaj Auto ? What was the selection procedure?\n\n3. How to prepare for them?\n\nPreparation for Bajaj Auto’s selection process should be methodical and precise. For the technical test, it’s crucial to have a solid grasp of core mechanical subjects like Solid Mechanics, Thermodynamics, Heat Transfer etc. and should also have a decent understanding of some first year mathematics stuff like numerical estimations, solving differential equations etc. Revision from class notes and additional problems from textbooks can be very helpful as and when you encounter these courses in your semesters. For the psychometric and interview rounds, it’s beneficial to get your core and basic concepts of mechanical engineering clear and have a thorough understanding of what you have learnt through your semesters. Familiarity with your own projects and coursework is key, as these are common topics during interviews. Confidence and fluency both during interview and psychometric tests are some of the soft skills that you should develop in the last days of your preparation.\n\n4. When did you start preparing for this role, and what is the ideal time for aspirants to begin their preparation?\n\nI started preparing for this role towards the end of my third year, practically during the summer vacation before the internship selection sessions. Ideally, aspirants should begin their preparation at least 3–4 months before the internship season starts. Prior to this they should be involved enough in the courses throughout the semesters in the courses they take both as Core as well as Depth Electives. This can smoothen their preparations, instigate more confidence in them and help them avoid last minute rush and rough preparations. In case a candidate has been sincere enough throughout their semesters, 3–4 months is an ample amount of time to strengthen their understanding of both core mechanical concepts and develop soft skills essential for acing multiple rounds of interviews.\n\n5. What difficulties did you face while preparing for this Company/Profile? How did you overcome them?\n\nThe MCQ test that you will initially face will have 90 questions to be completed within 90 minutes, placing a significant emphasis on your speed and accuracy. Without a solid understanding of the concepts, you may find it challenging to answer a substantial number of questions within the allotted time. Therefore, my suggestion would be to keep practicing as many questions as possible once you conclude your preparation, so that you can be at your best possible speed and accuracy on the day of the test\n\nOne major challenge was balancing the preparation for multiple profiles, as each of them have distinct requirements. To manage this, I structured my study schedule to allocate specific times for core mechanical subjects as well as other profiles that I was preparing for.\n\nOne piece of advice would be in case you are going for preparations for multiple profiles and one of them is core, then you may choose the others to be non-technical profiles as choosing a mixture of both core as well as technical profiles like SDE and Data Science will more often lead you towards a greater cloud of confusion and will hinder the completeness of your preparation towards either of the chosen profiles. Whenever and wherever stuck, I would suggest engaging in discussions with peers, seniors and professors in order to obtain deeper insights and to get your doubts clarified effectively.\n\n6. Are there any specific requirements such as department, CGPA, or other criteria for this position? Additionally, do certain PORs or EAAs enhance one’s chances of securing this internship?\n\nThe internship at Bajaj Auto primarily targets mechanical engineering students, although candidates from related fields are also considered if they have relevant skills. A CGPA of above 8.5 is generally preferred (although the cut off to sit for tests is 7.0) and CGPA does hold a great deal of importance atleast during the interviews.\n\nOne more important aspect is the quality of projects that you would have done in your respective departments. They actually get a lot of content to hold conversation with you and engage with your interests in case you have any such interesting projects in your resume. So my suggestion would be to at least have two or more projects written on your resume in order to craft the interview in your desired direction and to base it on the topics in which you feel most confident about.\n\nHolding positions of responsibility or engaging in extracurricular activities can also enhance a candidate’s profile by demonstrating leadership and teamwork skills but in case anyone doesn’t have them, they need to worry as these are just brownie points and the recruiters do not stress very much on these segments during the interview.\n\n7. According to you, who should ideally apply for this job?\n\nThis role is best suited for individuals who are passionate about the automotive industry, particularly those with a strong foundation in mechanical engineering principles. It is also well-suited for someone who is interested in mechanical engineering and wants to explore more about the industrial and real-life applications of the academics that they have learnt till then. This role is also well suited for people who want to explore cross-domain applications of mechanical engineering like how mechanical engineering can intersect with emerging technologies like EVs etc.\n\n8. Kindly attach your CV/Resume. What are some of the major points you think would be valid to mention in CV while targeting this profile?\n\nKey points to include in the CV for this role would be relevant coursework, projects, and any internships that demonstrate applied mechanical engineering skills. Additionally, leadership roles in technical clubs or teams can also be significant, as they show an ability to manage projects and work collaboratively.\n\n9. Lastly, what advice would you like to give to the students aiming to grab CDC internships this year?\n\nMy advice would be to focus on understanding your core subjects thoroughly and to get involved in hands-on projects or research that can showcase your skills. Try to maintain your CGPA as high as possible by focussing on the academics taught during the semesters, as it stands out as a crucial parameter of judgment atleast for core profiles. In case you can, try to maintain a well-rounded profile with extracurricular activities that highlight your leadership and teamwork capabilities. Lastly, be proactive in seeking feedback on your CV and prepare diligently for interviews by reviewing common questions and practicing with peers or mentors."
    },
    {
        "job_role": "Core",
        "company_name": "Texas Instruments",
        "info": "It is essential to focus on getting your fundamentals right. The companies do not expect the students to know about advanced jargon but certainly gauge your interest in the domain and clarity in fundamental concepts.",
        "content": "FORESIGHT(2024) : Internship at Texas Instruments | Avi Saraf |\n\n--\n\nListen\n\n1)Brief introduction and description of offered role\n\nHi Fellas! I am Avi Saraf, a 3rd year undergraduate student of Electrical Engineering. I am currently doing my Summer Internship at Texas Instruments, as an Analog Engineering Intern. I am passionate about hands-on Electronics. I am also excited about the transformation andchanging face of mobility in India.\n\n2) How did you get into Texas Instruments ? What was the selection procedure?\n\nThe selection procedure is fairly simple, unlike other companies, which generally involve multiple rounds.\n\nFor TI, after the CV submission, there was a written test based on the roles one has applied for. The test was conducted on 17 July 2023. It consisted of 3 sections — Aptitude, Analog, and Digital (since I had applied for Analog and Digital profiles). After shortlisting, a technical interview was conducted on Day 2.\n\nTI had offered 4 profiles — Analog, Digital, Signal Processing, and Embedded. One can apply for at most 2 of them.\n\n3) How to prepare for them?\n\nIt is essential to focus on getting your fundamentals right. The companies do not expect the students to know about advanced jargon but certainly gauge your interest in the domain and clarity in fundamental concepts.TI Analog interviews often revolve around RC circuits — covering concepts such as transient response, steady-state response, frequency response, feedback, op-amps (sometimes), amplifiers, etc. You may be asked to sketch a circuit and estimate voltages/ currents at any given node/ branch. As the interview progresses, the complexity of the circuit may increase -depending on your responses to the questions. You may refer to Himanshu Agarwal’s playlist to practice RC-circuit interview questions. For Dual degree students, the interviews generally are much more rigorous and exhaustive.\n\n4) When did you start preparing for this role and according to you, what is the ideal time for aspirants to begin their preparation?\n\nWhile I had started approaching seniors in the Spring semester to get an idea about the roles and selection procedures, I started my preparation only in May 2023.\n\nFor digital — the course contents are not sufficient, and it is expected that students have familiarity with Static Timing Analysis (STA), Hardware description language (eg- Verilog), CMOS logic, and basics of Computer Architecture (a 3rd Year course). You may refer to Prof. Onur Mutlu’s lectures/ slides for Computer Architecture, and Prof. ISG’s NPTEL for Verilog.\n\n5) What difficulties did you face while preparing for this Company/Profile? How did you overcome them?\n\nI faced some difficulties in keeping a consistent schedule during the vacations since I had other involvements, too. I wanted to cover basics of Power Electronics, for which I did not get sufficient time. However, I prepared short notes for new concepts and revised them before tests. I solved some PYQs from tests conducted in previous years to understand the pattern of questions.\n\n6) Are there any specific requirements such as department, CGPA, or other criteria for this position? Additionally, do certain PORs or EAAs enhance one’s chances of securing this internship?\n\nTI is open for circuital departments EE and ECE for all roles. It is open for CSE, MnC, and ISE for select roles. TI does not have a very high CGPS cutoff and does not attach too much importance to your CGPA. A decent CGPA of 8+ should be fine, although it is not rigid. PORs are not considered, but if you have done any projects, it may help during the interview.\n\n7) According to you, who should ideally apply for this job?\n\nIf you are among the ones who are still soul-searching to find out which profiles you are made for — worry not, for there are many more like you! An internship is a good opportunity to get first- hand exposure to working in the industry in a role you are passionate about. Remember to be open-minded and explore new domains. TI is a very dynamic organisation having the largest markets in Analog products — which power everyday devices you see around. If you’re excited by what the semiconductor industry offers and are passionate about electronics, you should consider applying for TI.\n\n8) Kindly attach your CV/Resume. What are some of the major points you think would be valid to mention in CV while targeting this profile?\n\nTI does not focus too much on the CV. However, mentioning any projects you have done in Electronics or related areas would be good. Ensure you are familiar with the project details and have basic working knowledge if it comes up for discussion in the interview.\n\nIf you have done any good projects and are passionate, feel free to mention it in the interview — that would surely make a mark! The interviewers are senior engineers at TI, from domains such as Data Converters (ADC, DAC, etc.), Power Products (Converters, Gate drivers, etc), RF, Audio, etc in Analog. For Digital — TI has various teams working on Memory, transceivers, microprocessors, etc. It is always good to strike a conversation in the interview so that the panel can get to know you better.\n\n9) Lastly, what advice would you like to give to the students aiming to grab CDC internships this year?\n\n1. Try getting familiarised with the Industry: Attending PPT will give you a glimpse of the products at the company. When you start appreciating the scale at which the semiconductor industry operates and how it enables the world all around us — you will certainly develop a keen interest. For example — I spoke at length about the semiconductor crisis of 2022–23 (which greatly affected the automotive and consumer electronics industries) about my views during my interview.\n\n2. Make sure to gave good grasp over fundamentals: If you have a good grasp over fundamentals, you are equipped to handle any challenge that maybe given to you. For all roles, basic working knowledge will be required in Signals &amp; Systems, Microelectronics, Digital Electronics, and Control Systems (basic understanding of feedback).\n\n3. Believe in yourself: The internship selection process may feel intimidating at first, but it is important to keep going and have faith in yourself. There’s lots to learn and each one of you will have charted a unique path. Finally, feel free to get in touch in case of any queries (Contact no. — 9051386495).Good Luck!Avi Saraf"
    },
    {
        "job_role": "Core",
        "company_name": "Bajaj",
        "info": "Knowledge of basic statistics, probability, Permutation and Combination is a must and you can practice additional questions from CAT's previous papers, solve puzzles from brainstellar.com",
        "content": "FORESIGHT(2023): Summer Internship at Bajaj | Sreyash Layek |\n\n--\n\nListen\n\nBrief Introduction\n\nHello everyone! My name is Sreyash Layek. I am a fourth-year undergraduate student of the Department of Electrical Engineering enrolled in its Dual Degree program with a specialization in Machine Learning and Signal Processing. I will be joining Bajaj Auto as a summer intern in its R&D EEE Department for the summer of ‘23.\n\nHow did you get into Bajaj? What was the selection procedure?\n\nBajaj Auto came on Day 2 of the Internship drive and was opened for AE, ME, EE, EC and IM branches for CV submissions. After CV shortlisting, the selected candidates were invited for an MCQ test.\n\nThe MCQ Test consisted of 90 questions which had to be completed in a window of 90 minutes. The test comprised of 4 sections namely-\n\nThe shortlisted candidates were then invited for the interview rounds. There were 2 rounds- One Technical Round and one HR round.\n\nTechnical Round: Very Basic questions from Electrical circuits, Transient states were asked. Then, I had a project in my resume that used CNN to detect Covid-19 through cough samples. They asked me to explain the model architecture and subsequent questions followed where we discussed how we can deploy the project in real-time. This round typically lasted for around 20 minutes.\n\nHR Round: Thetion Technical Round was followed by an HR Round, where I was asked about my choice of MTech specialization. It was followed by a brief discussion on my projects and we again discussed how some of them can be improved and deployed to solve some of the existing challenges. Also, we had a small discussion regarding my PORs on campus. This lasted for another 20 minutes.\n\nAfter the HR round, within 15 minutes I was informed about my selection in Bajaj Auto.\n\nHow to prepare for them?\n\nFor the MCQ Test, English/comprehension questions are fairly intuitive and you don’t need preparation for that. For Analytical and Statistical, knowledge of basic statistics, probability, Permutation and Combination is a must and you can practice additional questions from CAT's previous papers, solve puzzles from brainstellar.com and solve ample probability, analytical questions from the web.\n\nFor the technical questions, following the course curriculum of EE is enough. Special care must be given to studying some core EE courses like Power Electronics, Controls and Electrical Machines. Also, be thorough with the knowledge of Basic Electronics.\n\nQuestions asked are easy and don’t involve lengthy calculations, having basic knowledge works for most cases.\n\nFor the interview rounds, be very thorough with your CV and you must be able to explain all your projects well. Confidence is key and they check your confidence and problem handling skills along with the generic technical skills.\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nThe MCQ test will require you to solve 90 questions in 90 minutes, so the test is heavily dependent on how quickly one can solve questions. If you are not thorough with the concepts, you won’t be able to finish a considerable number of questions on time.\n\nSpend most time of your summer practicing analytical statistical questions as no matter which profile you sit for, these will come in handy. Additionally, revise all previous EE courses to perform well in the test.\n\nAccording to you, who should ideally apply for this job?\n\nStudents interested in core Electrical Engineering and having an interest in Automotive industry/ Electric Vehicles should apply for this internship.\n\nAny specific advice you want to give to the junta sitting for internships this year?\n\nWhat are some of the major points you think would be valid to mention in your CV while targeting this profile?\n\nHaving a project in the respective field often helps, but it’s not a requirement. (I, personally, didn’t have any core projects on my resume).\n\nHave a decent CG(preferably >8.00, it will be even better if >8.50).This should get you through most of the CG shortlisting.\n\nMention any coursework that you find relevant to the internship, this could be a great conversation starter if you don’t have projects to mention in your CV."
    },
    {
        "job_role": "Core",
        "company_name": "Bajaj",
        "info": "One needs to be sure about the projects they have put in the CV from the point, even if the person has contributed, don’t mention that you have done a total project in CV.",
        "content": "FORESIGHT(2023): Summer Internship at Bajaj | Venkata Sai Saran Grandhe |\n\n--\n\nListen\n\nIntroduction:\n\nHello everyone! I am Venkata Sai Saran Grandhe, a fourth-year undergraduate student ofthe Department of Mechanical Engineering. I am from Nehru Hall of Residence. For the last CDC session, I was focused on the core profile only, and I got my CDC internship in Bajaj for the research and development domain but then didn’t take the internship because I got the research intern in France and I am currently doing that.\n\nHow did you get into Bajaj? What was the selection procedure?\n\nRegarding the selection process, first, there was a technical task which was total mechanical engineering questions which also included some syllabus from 3rd year by then I didn’t complete my 3rd year but I just referred to some topics online by referring to some online synopsis but I wasn’t that perfect on 3rd year so I totally focused on the mechanical topics of first year a little bit and 2nd year. So after the test, the people who are qualified in this test, so I don’t know the criteria on which they shortlist us maybe a cut-off, after this there was a psychometric test, by this what I mean is they ask some real-life questions, eg;- what happens when you are leading a team and team members are not working how would you manage total things, how genuine are you, how you manage time, so these were the question asked and was roughly a 30–40 min test.\n\nI think there is no standard answer to this question; it’s all about how genuine you are. So what I observed is, if you are trying to convince the examiner that you are a good guy then you will definitely miss some points in the first and last question, so my suggestion in this point is be yourself, don’t try to impress the examiner.\n\nAfter this, there was a direct interview. The first round was the technical round, I was asked questions based on my project and academics and after this, I was shortlisted in the HR round, they asked my interest and why I wanted to pursue an internship in Bajaj and they discussed some points about how my work life would be and how my work would be as an intern.\n\nSo this is the brief process for the Bajaj intern.\n\nHow to prepare for them?\n\nOkay so, considering the online test was the initial core mechanical question so I had all my notes neatly written and organised so I just referred to my notes and it was kindly easy because I was the one writing them. In case anyone has not written notes, suppose we have much online material for GATE There is kind of short synopsis and important concepts, there is anyone doesn’t have notes prepared they can use this, in my case I had notes written and for one or two topics I referred the online material. Many people plan to go through all the NPTEL lectures in each subject but this is a total waste of time because questions would be on the periphery level, and no one will ask you to derive. For this round, you don’t need to stress more on the details. You just need to have a basic idea of what the chapter is, what are the different formulas and how you apply formulas.\n\nAnd for the interview round, one needs to be sure about the projects they have put in the CV from the point, even if the person has contributed, don’t mention that you have done a total project in CV, mention the point you have done because the interviewer will surely see the bullet point and ask you questions. For example, my one project was a robotic arm, so I used a fibre mechanism so I mentioned that this is the work I was involved in. The interviewer asked for minute details of the project so I was able to explain. So when you are about to give the interview, be sure about every point of the project mentioned. And regarding the interview technical aspects the interviewer will ask you what are your courses in the curriculum the course you tell defines the question he gonna ask, he knows all the courses you have undergone in your last semester, which you should be mentioning in your CV, mention the 3 courses you are totally strong in order of strength because the first course you gonna mention will be the first question asked.\n\nFor these 3 or 2 courses I suggest everyone who is planning for core CDC go through every detail of these courses, even the derivation because even though it was not asked to me, it was asked to my friend to derive an equation. I would suggest that you have at least a structural idea of how things work in the courses you’re gonna mention.\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nYeah so I want to specifically mention one point there is any person focusing on core CDC intern considering the number of opportunities and competition it is very difficult to ensure that person gets intern on the first day, maybe his friend from the same department who is focusing on software or data they will be getting intern on Day 1 or there would be more of the people getting intern in initial days. Bajaj was on the 2nd day so I had many friends from mechanical who were placed on Day 1. It was not for a longer duration but I felt I should have applied for these and I would be constantly comparing myself with my friend, so the thing is don’t compare yourself with friends applying in other profiles so just be on your point and don’t feel sad or don’t feel disheartened when you didn’t get selected\n\nOn Day 1 I got shortlisted into ITC but I was unable to make to the GD round so at that moment I was totally frustrated because I did not get the first company which selected me for the further round so just stay motivated and don’t compare yourself with other, everyone life is unique and also preparation and also there is a small fraction of luck for CDC interview I don’t say that it’s totally luck but I would say 1% luck matter. Just be sure with your preparation and be confident. If you are confident you will definitely get one day or the other.\n\nAccording to you, who should ideally apply for this job?\n\nConsidering this automobile company, this company expects someone from mechanical who is totally motivated towards the core and who has a decent CGPA so at the time of applying I had a CGPA greater than 9 and I have heard that a CGPA greater than 8 or 8.5 is suitable for core interview because the company is looking for someone inclined towards mechanical and your CGPA reflects your academic, this is one the key aspects the company looks for so I think a decent CGPA is must, and considering the second aspect, they also need project inclined towards mechanical. These two are the main aspects regarding just profile.\n\nAny specific advice you want to give to the junta sitting for internships this year?\n\nI just want to add one point for the people who are focusing on core mechanical jobs, let the interviewer know how interested you are in working on the core side because you need to stand out from other people who are applying for this job by showing how motivated you are for working with machinery and how motivated you are in doing research it may be worth mentioning some point like in my case we didn’t have IC engines when I was applying for the job, but in interview, I mentioned that I was highly fascinated that how engines worked and I studied some topics and I am free for questions in this way I expressed my interest that I want to stay in the core. I think this was the key factor that the interviewer selected because he saw the spark in me.\n\nThe second thing is even if there is someone who is interested but doesn’t have enough project just contact your engineer because there would be a mechanical engineering design project which they can use in their CV and they can complete in a span of 10–15 days\n\nThe third piece of advice I wanna add is if someone is interested to apply in these jobs they should learn software related to mechanical engineering or some designing software like Solid work or some data analysis software because these are the tools you apply to analyse any mechanical engineering projects. If you already have skill in this it would be an additional thing the interviewer is going to look at and the probability of hiring you increases.\n\nWhat are some of the major points you think would be valid to mention in your CV while targeting this profile?\n\nAs I mentioned in the skills part add the software I just mentioned if you know about them and used them previously POR doesn’t have that value in the case of core jobs but having the POR gives them the confidence that you are good in managing stuff on your own, you are good in leadership, try to include a POR but this is not mandatory like consultancy profile, but it is an add on to your CV.\n\nRegarding the courses you mention other than academic courses, suppose there are some CAD course and engineering simulation courses which you might have covered on other platforms, that would be attractive for the companies or there would be some computation course which you would have learnt from a YouTube playlist, you can mention that these are course or I have the basic idea. These all things will be sufficient.\n\nNote: Prepare your CV thoroughly before going to an interview."
    },
    {
        "job_role": "Core",
        "company_name": "Bajaj",
        "info": "For questions related to the electrical core, one should know the basics of electrical machines, analog and digital electronics, measurements, and instrumentation.",
        "content": "FORESIGHT(2023): Summer Internship at Bajaj | Preeti Nilanjana |\n\n--\n\nListen\n\n1) Brief Introduction\n\nHello, I’m Preeti Nilanjana, a 3rd-year Department of Electrical Engineering undergraduate student enrolled in its B.Tech course.\n\n2) How did you get into Bajaj? What was the selection procedure?\n\nI was targeting core companies for my internship, so I applied. The first round was a written round with some maths questions, especially probability and statistics, mental ability questions, basic cp questions, and core electrical questions. It was for 90 minutes. If you score above certain marks, you must appear for a self-assessment test for around 15 minutes. Then comes the interview round and then the HR round.\n\n3) How to prepare for them?\n\nAptitude and probability statistics questions were solvable. For questions related to the electrical core, one should know the basics of electrical machines, analog and digital electronics, measurements, and instrumentation. For the interview round, in my case, they asked me about what topics I was more interested in and asked me questions related to them. You can expect questions about the projects you have mentioned in your CV. For the HR round, one should know about the company and the field in which it offers an internship.\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nAs I spent my first and second years online, I faced issues. I was worried because I did not have any practical knowledge. As fewer core companies come for an internship, one can prepare some other profiles. Revising analog and digital electronics and electrical machines will help a lot.\n\n5) According to you, who should ideally apply for this job?\n\nAnyone interested in EVs, electronics, and machines can apply for this job. It will help you to explore more in the field of electric vehicles and related areas.\n\n6) Any specific advice you want to give to the junta sitting for internships this year.\n\nIt will be a new process for you, and even if you do not get shortlisted for your desired companies, feel encouraged. If you target specific companies, prepare accordingly. In interviews, be confident and do not lie or bluff. If the interviewer asks if you have any questions for them, do not say no. You can ask about the role the company is offering or anything related to the company; it will show your curiosity about the job.\n\n7) What are some of the major points you think would be valid to mention in your CV while targeting this profile? (Any specific suggestions you would like to make?)\n\nThe interviewer goes through your CV and asks questions about it. Mentioning one or two projects will be good. The interviewer asked me questions related to the project I mentioned. Suppose you have done any internships before; you can mention them in your CV. Only add topics that you know about. You will make the wrong impression if you cannot explain things written in your CV."
    },
    {
        "job_role": "Core",
        "company_name": "Jaguar Land Rover| Polu Sreenidhi",
        "info": "Good and clear understanding of basic fundamentals and theory is needed. And it would be better to take some useful courses like VLSI, Mixed IC Design etc (in platforms like Coursera) or do any self-project in this summer related to their domain.",
        "content": "FORESIGHT(2023): Summer Internship at Jaguar Land Rover| Polu Sreenidhi |\n\n--\n\nListen\n\n1)Brief Intro\n\nI am Polu Sreenidhi. I am a 3rd year UG student of the Department of EE enrolled in its B-Tech 4-year course. I got my summer internship at Jaguar Land Rover under EV powertrain profile through CDC.\n\n2)How did you get into JLR? What was the selection procedure?\n\nTest:\n\na. JLR opens for three profiles — software, EV (EE and EECE), Mechanical\n\nb. Any combination (SDE / EV / Mech or any two can be written (SDE + EV / SDE + Mech)\n\nc. I have written only for the EV profile\n\nd. The test consists of three parts — Aptitude, Technical and coding round.\n\ne. The marking scheme is in such a way that the difficulty increases as you write correct answers: Easy -1 mark, average — 3 marks, difficult — 5 marks. This applies to both Aptitude and Technical rounds. The coding part consists of three coding questions.\n\nInterview:\n\nIn the technical round, they will ask questions mostly from the CV — related to projects, your sem courses, and your experiences in that particular profile. They test you mostly on your fundamental understanding, your way of approaching the question, and your problem-solving skills. They may ask some basic coding questions as well. Mostly they concentrated on my CV. One has to be perfect with their CV.\n\n3)How did you prepare for them?I revised analog and digital circuits and machines which were taught in the 3rd and 4th semesters. And I have gone through some video lectures for better clarification of the topics — Razavi for analog circuits, NPTEL video lectures for both digital circuits and machines. Once reading and covering lectures is done, I started solving Previous papers and Interview Questions(very important). One can refer to Interviewbit, geeks for geeks, or Glassdoor(requires login with Gmail) for these questions.\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?6) Any specific advice you want to give to the junta sitting for internships this year?\n\nI wasted most of my time deciding between core and non-core. I have spoken to some of my seniors and taken their suggestions. If you are interested in the core and are confident then start your preparation with the core itself. Three months of summer duration is very peak time for CDC preparation. Dividing your daily tasks and managing the time for preparation is very important. Divide your work for the three months properly. If you have any doubts regarding any topics or you may not be able to solve any problems, ping your seniors or friends, and seek their guidance and help. Refer to some good suggested videos on youtube for better understanding. Talk to seniors or discuss with your friends who are preparing for the same profile so that you can learn more and you can build up your confidence as well. Practicing previous paper questions is very important. You will get a good amount of ideas on the depth of the questions and how to manage your time during the exams. For the aptitude section, it is better to practice some questions before the exams so that you would not spend much time on these questions\n\n5) According to you, who should ideally apply for this job?\n\nHaving a clear knowledge of a particular profile is very important before starting preparation. As there are limited core companies, students who are really interested in core and want to pursue a career in the core domain can apply for this profile. One has to dedicate a lot of their time to solving and preparing for the core. A good CG of 8+ or 8.5+ is preferable.\n\n6)Any specific advice you want to give to the junta sitting for internships this year.\n\nSome advice I would like to give — Having clear knowledge on their particular domain is very important and going through some of the recent research/any papers may give them some idea on their domain. It is better to start preparation as soon as possible. Good and clear understanding of basic fundamentals and theory is needed. And it would be better to take some useful courses like VLSI, Mixed IC Design etc (in platforms like Coursera) or do any self-project in this summer related to their domain. And as a part of preparation solving previous questions is very important as it gives an insight into the depth of the paper. And also practicing some aptitude questions will be really helpful during exams so that more time can be given to technical questions.\n\n7) What are some of the major points you think would be valid to mention in your CV while targeting this profile?(any specific suggestions you would like to make?)\n\nAny projects, courses, or competitions related to the profile would be really helpful."
    },
    {
        "job_role": "Core",
        "company_name": "Jaguar Land Rover| Avinash Kumar",
        "info": "Start with revising the power related courses (if you are Electrical), digital and electronics circuit. Questions related to minimization of gate, multiplexer is frequently being asked.",
        "content": "FORESIGHT(2023): Summer Internship at Jaguar Land Rover| Avinash Kumar |\n\n--\n\nListen\n\nBrief Introduction:\n\nHello, my name is Avinash Kumar. I am from the electrical department enrolled in its Instrumentation Engineering Course. I am from Nawada, Bihar.\n\nHow did you get into JLR? What was the selection procedure?\n\nThere were only 2 steps in total, 1st is the online examination and the 2nd is the interview round.\n\nJLR came for roles in our campus. One can choose any roles. I chose EV powertrain and the software profiles. In the examination there were 3 sections as I remember. 1st section consists of mental ability and basic mathematics questions and the difficulty of the questions was of self-adjusting in nature. In the 2nd section there were 15–20 (exact count don’t remember) questions and most of the questions was from the Power related stuffs and based on the direct formulas.\n\nIt would be good if you could practice GATE questions related to this topic. Some of the same as of the GATE. In the 3rd section, there were 3 coding questions (I won’t discuss about this).\n\nFor the interview round, JLR came on day 2. It started with a general introduction. Then asked me a question regarding the interests and what I have done in this regard. After he asked me about the project mentioned in very great detail. He asked me to implement the Alpha-Beta pruning and min-max algorithm (This algorithm was mentioned in the resume). After that he asked me question regarding the Digital electronics (as I already told them that I am interested in the digital electronics circuit). He asked me to code D flip-flop in Verilog. Finally, they asked some basic questions regarding analog electronics. The panel was very friendly and helpful whenever I got stuck and made some minor mistakes.\n\nHow to prepare for them?\n\nStart with revising the power related courses (if you are Electrical), digital and electronics circuit. Questions related to minimization of gate, multiplexer is frequently being asked. Once you are done with these topics and feel confident, learning time analysis and the basics of Verilog would be useful. When asked, I said these courses has not been covered in the course and it will be taught in the upcoming semesters. For Verilog you can refer to lecture series by Prof. Indranil Sen Gupta and do some assignments for programming in Verilog.\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem.\n\nAs such I did not face any difficulties during the procedure. I would advise you to stay cool and confident during the exam. Don’t panic during the interview. Questions being asked are logical and can be solved with the cool mindset and following the standard procedure if you face any difficulty in some of the questions. Most important do not forget to revise the basics as these are building blocks of your entire preparation.\n\nAccording to you, who should ideally apply for this job?\n\nAnyone who is interested in core or covered the curriculum in great detail during the semester if not sure about the profile can sit for the process.\n\nAny specific advice you want to give to the junta sitting for internships this year.\n\nYou need to understand the fact that CDC is very chaotic and random in nature. In some of the companies’ test you might feel down but don’t let it affect your health. Stay confident and believe on the process and yourself.\n\nDuring the interview answer the questions calmly, boldly and listen to the panel calmly and patiently. Ask them to clarify if you have any doubt regarding the questions. Always try to share your thought process with them, as they focus more on the thought process rather than the final answer. If you have something about yourself then mention it in the introduction only as this may drive the whole interview towards your interests and the field in which you are interested.\n\nWhat are some of the major points you think would be valid to mention in your CV while targeting this profile?\n\nThey focus much on the resume part at least in my case. So, mention those things or related stuffs in which you are very much confident. You can do some self-projects to mention."
    },
    {
        "job_role": "Core",
        "company_name": "NVIDIA",
        "info": "The most important step is revising all the topics covered in 2nd-year digital electronics course; questions can be asked from basic circuits, registers, flip flops, multiplexers, PLL etc.",
        "content": "FORESIGHT(2023): Summer Internship at NVIDIA | Madhav Raju Nair |\n\n--\n\nListen\n\n1) Brief Introduction\n\nHello everyone! My name is Madhav Raju Nair, I am a fourth-year undergraduate student pursuing my major in electronics and electrical communication engineering along with a minor in computer science and a micro in embedded systems. I am currently working at NVIDIA, Bangalore as a summer intern in the Sys-Perf Verification team. I’m from Thiruvananthapuram, Kerala.\n\nTo give a brief background about myself, I have been passionate about robotics and embedded electronics since my first year as I worked on projects at Technology Robotix Society(TRS) and Areal Robotics Kharagpur(ARK). By the end of third year, after completing the department coursework till then, I was majorly interested in the fields of computer architecture and hardware security. I have previously worked under Prof. S.K.Nandy, Department of Computation and Data Sciences, IISc Bangalore on the project “FPGA simulation of a multi-core reconfigurable processor” and Prof. Debdeep Mukhopadhyay, Department of Computer Science and Engineering , IIT Kharagpur on the project “Deriving Security Constructs from Natural Language”.\n\n2) How did you get into Nvidia? What was the selection procedure?\n\nThe selection process had 2 stages; a written exam followed by an online interview.\n\nWritten exam : To appear for the NVIDIA written exam there was a CG cut off of 8. The online exam was of one hour duration and had nearly 20 questions if I remember correctly. Needless to say, camera/microphone were to be kept on during the test and tab change/ window minimization was prevented; but luckily, navigation between sections was allowed which lets you complete easier ones first. Apart from the general aptitude questions, the test covered programming fundamentals,basic probability and statistics, and digital electronics. Most of the digital electronics questions could be answered using topics covered in the 2nd year courses + some timing/verilog.\n\nInterview : After shortlisting, one round of online interviews was conducted. I was interviewed by a panel of 3 people and all of them were very friendly in nature. First I was asked to introduce myself and go through my CV briefly. I had a relevant project on my CV so we spent a couple of minutes discussing it. Then they moved on to questions from digital electronics most of which required a good understanding of the basics. Then a few simple programming questions were asked (in my case, about trees) in which they evidently gave importance to your approach.In some of the questions, I did not know the answer directly, but was able to discuss my thought process with them and arrive at the final soln. At last, a bunch of HR questions, why do you want to join the company, what kind of work are you expecting to do etc. were also asked.\n\n3) How to prepare for them?\n\nThe most important step is revising all the topics covered in 2nd-year digital electronics course; questions can be asked from basic circuits, registers, flip flops, multiplexers, PLL etc. Further, it’ll be helpful to have an understanding of computer architecture, fundamentals of Verilog and timing analysis.As for the core topics study material, I am not able to provide a centralised repo or anything; I have used kgp course material, NPTEL lectures, Open Courseware, easy-and-popular Youtube playlists for different topics.\n\nRevising first year PDS coursework and then completing any of the DSA courses available online will be more than sufficient for the coding questions. [Rigourous practice of CP is not necessary for NVIDIA at least]. Lastly, aptitude questions, reasoning, puzzles etc can be practised from many resources available online.\n\nAccording to me, for the interview prep, focusing on the basics is important as one tends to spend the most amount of time on HR prep and CV prep during those days. You just have to remember an overview of the projects and courses mentioned on your CV since most of the questions are on your understanding of the fundamentals and a detailed scrutiny of CV is not going to happen. On the other hand, if there’s a relevant project mentioned on your CV that the panel may be interested in hearing about, be prepared to talk about it and steer the discussion in a way to emphasise your individual contribution and results.\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nAs I was targeting core profile since the beginning, NVIDIA was on top of my list. But when the CDC internship drive was nearing, I was getting a bit overwhelmed as I tried to revise a lot of the advanced concepts and memorise all the work I’d put on my cv. At this point, talking to seniors who’d previously cracked NVIDIA helped a lot as they advised me to rather focus on the basics and keep calm. Maintaining a good physical and mental condition to give the tests and interviews during/after the hectic CDC week is another challenge; it is important to not lose hope, as there’s a good chance that you will end up with a good summer intern/research project.\n\n5) According to you, who should ideally apply for this job?\n\nThere’s a misconception that NVIDIA is a company for core enthusiasts, and even while working here it is mentioned quite often that it isn’t a pure core company, and they have a lot of roles where ug ece knowledge is not applicable, in addition to low-level software dev roles. If you have the slightest interest in digital design and satisfy the criteria to apply, definitely do so. NVIDIA is a world renowned company, they do offer a competitive salary and the additional perks are pretty good — so do give it a shot\n\n6) Any specific advice you want to give to the junta sitting for internships this year?\n\n→ Do not ever not apply to a good company thinking you wouldn’t get in. Sometimes they would just be looking for a person whose aptitude they like regardless of their no. of previous internships or PoRs\n\n→ During the interview be honest while answering the questions, and do not try to fake answers. It’s usually more rewarding to go through your real thought process than panicking.\n\n→ Keep letting your interviewer know how you’re approaching the problem in steps, continuous interaction eases the atmosphere and they even help you get to the final solution sometimes.\n\n→ Do not let the pressure cloud your vision and judgment. As it happens, regardless of the #Day1 pressure, many amazing companies choose to come to the CDC drive later if that’s what matches with their schedule.\n\n→ KGP summers are sultry and tiring; it is important to keep yourself hydrated and maintain a proper diet.\n\nIf anyone would like to discuss any CDC related matter that you think I might be able to help with, you can reach out to me at — https://www.linkedin.com/in/madhav-raju-nair-339b8754/\n\n7) What are some of the major points you think would be valid to mention in your CV while targeting this profile?\n\n→ Be it coursework, projects or internships write them in the order of how confident you are about them! highlight/bold sentences you’d like recruiters to notice.\n\n→ Any research/experience is good experience even if it isn’t exactly matching with the job role. As I already mentioned, in case of NVIDIA, your knowledge in the subject is way more important than the density of your CV.\n\n→ if there are relevant projects, prepare small 2 min paragraphs on them; you will mostly be asked to ‘briefly’ explain them. You should be able to give a good summary without getting lost in the details."
    },
    {
        "job_role": "Core",
        "company_name": "Texas Instruments",
        "info": "I would highly recommend taking the Digital electronics course by Prof. Gautam Saha or going through his NPTEL lectures. It covers almost everything needed for the Digital profile",
        "content": "FORESIGHT(2023): Summer Internship at Texas Instruments| Ajay Yogendra|\n\n--\n\nListen\n\n1) Brief Introduction\n\nHello! My name is Ajay Yogendra. I am a 3rd year undergraduate in the department of Electronics and Electrical Communication Engineering. I will be doing my internship at Texas Instruments in the summer of 2023. I got this opportunity through the on-campus CDC internship drive.\n\n2) What was the selection procedure?\n\nThe selection procedure consisted of a CV submission, an online test, and an interview.\n\nThe test had five sections: a compulsory aptitude section and sections for each of the profiles, Analog, Digital, Embedded software, and Signal processing. Each of the sections had a mix of MCQs and numerical questions. Each section had a specified time limit, and one could not navigate between sections. Questions in the “Digital” section mainly focussed on static timing analysis, logic design, and the behavior of a given logic design under various input conditions, such as the number of clock pulses.\n\nIn the interview round, I was mainly asked about the projects mentioned in my CV. I was asked to explain the sequence of steps that I followed in each of them. Later I was asked some simple questions based on a logic design using given logic blocks. Throughout the interview, always think aloud and let the interviewer know your thought process.\n\n3) How to prepare for them?\n\nI would highly recommend taking the Digital electronics course by Prof. Gautam Saha or going through his NPTEL lectures. It covers almost everything needed for the Digital profile. One can ace the selection tests by simply practicing the problems in the book by M. Morris Mano that is followed in the above course. I also recommend learning the basics of Verilog by following the lectures of Prof. Indranil Sengupta and the tutorial on asic-world.com. Using Verilog, one can implement and simulate all the digital logic elements designed in the digital electronics course. For the topics of static timing analysis, I recommend going through the second chapter on vlsi-expert.com.\n\nAlthough the topics of computer architecture are not much touched upon during the selection procedure, I recommend going through the lectures of Prof. Onur Motlu (for the sake of motivation) and the book that is followed in those lectures, Introduction to Computing Systems by Yale Patt and Sanjay Patel. Those interested can also go through free courses on computer architecture in Coursera and MITOCW.\n\n4) What are some of the major points you think would be valid to mention in your CV while targeting this profile?\n\nIn my CV, I mentioned my work in KRSSG and a self-project based on digital electronics. During my interview, I was asked to briefly explain the steps I followed in each of them. Hence it is important to mention only those projects in the CV that one clearly understands.\n\n5) According to you, who should ideally apply for this role?\n\nAnyone planning to pursue a career in core electronics can apply.\n\n6) Any specific advice you want to give to the junta sitting for internships this year.\n\nThe CV submission for the internship drive starts a month before the start of the autumn semester, so plan your CV preparation accordingly. During the interview, as I said before, it is essential to keep thinking out loud, i.e., letting the interviewer know your chain of thought. Remember, the interviewer is on your side! They are only trying to help you. Also, get enough rest, and stay hydrated.\n\nAll the best!"
    },
    {
        "job_role": "Core",
        "company_name": "Texas Instruments",
        "info": "Digital Electronic Circuits (4th sem EC course) is the definitive preparatory course one needs for the Digital Design profile — would also recommend Digital Design by M. Morris Mano. The questions were mostly based on logic gates, K-Maps, simple circuits like adders and ALUs. There were some basic questions from Computer Architecture related to cache and pipelining as well.",
        "content": "FORESIGHT(2023): Summer Internship at Texas Instruments| Tarang Sur Chaudhury|\n\n--\n\nListen\n\nBrief Introduction\n\nHello, I am Tarang Sur Chaudhury, a 3rd year Btech student from the Department of Electronics and Electrical Communication Engineering. I received an offer from Texas Instruments for a Digital Design internship last year.\n\nHow did you get into Texas Instruments? What was the selection procedure?\n\nI secured this internship opportunity through the CDC campus internship drive. The selection procedure involves a screening test followed by an interview. The screening test was objective type and tested the applicants broadly on topics corresponding to the roles offered — Analog Design, Digital Design, Signal Processing, and Embedded Systems, along with a mandatory section of Aptitude type questions. One gets shortlisted for the role-specific interviews depending on their performance in the corresponding sections (and aptitude section) only. If someone applies for more than one profile, they would simply have to attempt all the sections that they applied for — and may also get shortlisted for multiple profiles. I had applied for all of them and got shortlisted for both the Digital Design and Signal Processing roles. I was offered the Digital Design internship immediately after the interview, which is why I didn’t get to appear for the Signal Processing interview. However, they might finalise the offers at the end of the day, which can result in multiple offers being made — however you may only choose a single role for your internship.\n\nHow to prepare for them?\n\nThe screening test primarily focuses on judging the strength of your fundamentals. Digital Electronic Circuits (4th sem EC course) is the definitive preparatory course one needs for the Digital Design profile — would also recommend Digital Design by M. Morris Mano. The questions were mostly based on logic gates, K-Maps, simple circuits like adders and ALUs. There were some basic questions from Computer Architecture related to cache and pipelining as well.I was not very good at Signals and Systems (getting shortlisted for the Signal Processing interview was a pleasant surprise), however the questions in the test were mostly based on fundamentals like Fourier analysis of signals and LTI systems.\n\nGuide to refer : CDC Guide for E&ECE Core companies\n\nThe interview experience was quite unique. It went on for 50 minutes, but didn’t really feel that long, and definitely didn’t feel like an “interview” — it was more like a conversation about interesting problems and how to solve them. One key takeaway for me was that the interviewer is completely ok with you having no idea about a particular question — all they want to see is how you respond to being dropped into unknown territory, how you use your existing knowledge to try to decompose this new challenge into smaller problems that you know how to solve. Even if you’re unable to make any sense of it, they provide crucial hints to steer you towards the solution, so do interact with your interviewer and illustrate your whole thought process.\n\nWhat difficulties did you face while preparing for this Company /Profile? How did you overcome this problem?\n\nI am reasonably comfortable with interviews. The screening test was actually the toughest part for me. DEC was a course I thoroughly enjoyed in my 4th semester, so the questions played to my strengths. The problem is that I am bad at test taking itself, I always seem to get my time management wrong, eventually end up rushing at the end and scoring well below what I should have. I was nervous beyond measure while taking this test as well, but somehow managed to hold my nerves and was able to answer most of the questions that I knew. I expect the average JEE-qualified reader to be better than I am at taking MCQ tests, which is why I should offer some advice for the interview, since it might be a first time experience for many.The golden rule is to not let the room plunge into awkward silence. The interviewer asks a question, and you really have no clue about the solution. Standing mute in front of them for five minutes and thinking about it is not really going to help — the interviewer is unsure of whether you’re actually thinking about the problem, whether you’re just too stunned to speak or if you are daydreaming. It is okay to take your time and think, but do let the room know what you are thinking about, what is your exact approach, because the interviewer cannot read your mind. They will eventually drop a hint and guide your analysis, and might even credit your unconventional approach. Communication is key. Again, as I said previously, they don’t expect you to know everything, and they will judge you based on how you handle new challenges.\n\nAccording to you, who should ideally apply for this job?\n\nApplicants need to have a strong fundamental understanding of the domain they are applying for. Understandably, it is much easier for EC/EE people who already have completed relevant courses.\n\nAny specific advice you want to give to the junta sitting for internships this year.\n\nCompared to software, the number of opportunities in core is significantly less. A very lucrative option for many would be to prepare for a software profile during the summer break. However, it should not prevent anyone with a genuine love for their core subjects from applying to Texas Instruments, or even other core profiles. If I am being very honest, it does not even require one to prepare a lot in terms of actual content. All they have to do is back their strengths and be up to date with the relevant coursework.\n\nA very real challenge for some of the candidates would be if they decided to conduct in-person interviews this time around. I think I have already talked a lot about how to deal with an interview, it’s all about having a good mindset when you walk into the room. Don’t worry so much, you got this!\n\nWhat are some of the major points you think would be valid to mention in your CV while targeting this profile?\n\nMention relevant coursework. That’s basically it — they really don’t care about PoRs or projects (I didn’t have any projects or PoRs to mention in my resume anyway — that should tell you how much they matter). Your CGPA might play a role, 8.5+ is always a bonus. You will mostly be judged on your interview performance and test results."
    },
    {
        "job_role": "Core",
        "company_name": "JSW",
        "info": "Solving core Metallurgical engineering and aptitude questions for the Assessment round would be good enough to get through it.",
        "content": "FORESIGHT(2023): Summer Internship at JSW| Lalam Hari Prasad |\n\n--\n\nListen\n\nBrief Introduction:\n\nHello Everyone! I am Lalam Hari Prasad, a fourth-year undergraduate student in the Department of Metallurgical and Materials Engineering. I joined JSW as a Supply Chain & Logistics Intern (BPSL Plant Odisha) in the Summer of 2023 as part of their Summer Internship Program (SIP).\n\nHow did you get into JSW? What was the selection procedure?\n\nThere were three rounds in the selection procedure: an online assessment, a group discussion, and an interview.\n\na. Online Assessment: It consisted of two sections; one section primarily focuses on the psychometric & reasoning skills of the student and has straightforward questions, the only catch being that you get significantly less time. The other section focuses on the Core knowledge of your respective Department, and one can easily crack this section if they have the gist of the core Department Subjects.\n\nb. Group Discussion: This could be the crucial part of the assessment as a group consists of 6 to 8 students. Two topics were put forward by the panel one after the other:\n\n1. Tata Acquisition of Air India\n\n2. The current value of Paint Industries in India\n\nOne must feel free to express their views to the panel within 15 minutes, and the topics majorly revolve around current Industrial news and happenings.\n\nc. Interview: A Handful of students were shortlisted after the first two rounds, and a final call with the Company executive was held, where he majorly asked a few HR Questions, discussion on past projects and internships, CV grilling, and some tricky questions to test the student's alignment toward the core disciplines. This round lasted roughly 20 minutes.\n\nHow to prepare for them?\n\nOne has to be thorough with the concepts of their core discipline. For Metallurgy students, Basic Extractive Metallurgy, Iron and Steelmaking, and the fundamentals of thermodynamics are essential topics.\n\nSolving core Metallurgical engineering and aptitude questions for the Assessment round would be good enough to get through it.\n\nFor the GD round, one must know current Industrial news and a little company background. More than 50% of students get eliminated this round, and one must provide sound reasoning for their views and initiate the discussion.\n\nFor the interview, one should be able to explain everything mentioned in the CV. One should be clear with all aspects of the projects/internships they have done. The students should have a thorough idea of the company beforehand to quickly drive the interview and express their interests to the interviewer.\n\nResources I have followed: Resources for CDC Preparation (you can find the resources for every profile here)\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nBefore the start of CDC, I was a little uncertain about the profile as I have explored both the software and Management profiles and found interest in both. I prepared for both of them and kept SDE as my backup profile.\n\nDuring the CDC phase, I find it a little difficult to practice for both profiles and maintain consistency, so I suggest everyone better stick to one profile if possible, or if you are interested in multiple profiles, prioritize them and keep one as the backup because it's challenging to master multiple profiles within the short time, given you won’t get enough time to practice for each profile.\n\nAccording to you, who should ideally apply for this job?\n\nAlthough JSW is a core company, the work here primarily revolves around many businesses like Sales & Marketing, Operations, CSR, Supply Chain Management, E-Commerce, and many more business verticals.\n\nOne must utilize Core domain knowledge and Problem-Solving skills to solve real-life Industrial Problems, significantly impacting the industrial turnout.\n\nPeople interested in the above-mentioned Techno-Managerial Domains are suitable for applying to this role.\n\nAny specific advice you want to give to the junta sitting for internships this year?\n\nCommonly, the companies visiting this target profile (Core/Management) are very few, and there is massive competition for these companies. Do not feel disheartened if you don't receive a shortlist or cannot make it through all the assessment rounds. There are many off-campus opportunities.\n\nStay in touch with your parents, friends and constantly seek their guidance if you feel like giving up.\n\nRemember, you possess unique skills and qualities that make you a strong candidate. Stay focused on your goals and maintain a positive mindset. It can be beneficial to seek guidance from seniors who have successfully gone through similar experiences. Their insights and advice can provide valuable perspectives and help you navigate the process more effectively. Keep pushing forward, stay determined, and believe in yourself; success is within reach.\n\nI recommend that everyone read the job description before applying or consult seniors who have worked in that particular company to know about the work culture beforehand, as you cannot apply to every company that has visited the campus.\n\nWhat are some of the major points you think would be valid to mention in your CV while targeting this profile?\n\nManagerial Companies usually look for an all-rounder personality who has many skills besides their academics. Some of the points to be mentioned in your CV are:\n\nProjects & Internships: Highlight significant projects you have completed, emphasizing your role and accomplishments.\n\nPublications or term papers: If applicable, include any research papers, articles, or presentations you have authored or delivered.\n\nPositions of Responsibility: Although very few companies look into these (unless you are from any cell or hold Gymkhana managerial post), it reflects your leadership skills, managerial techniques, and more.\n\nRemember to tailor your CV to the specific role you're applying for, highlighting the most relevant experiences and skills that align with the profile's requirements.\n\nHere’s wishing all the very best to the CDC junta this year! Feel free to reach out in case of any queries!"
    },
    {
        "job_role": "Core",
        "company_name": "Nvidia",
        "info": "Start with revising the basics of digital electronics taught in 2nd year.",
        "content": "FORESIGHT(2023): Summer Internship at Nvidia | Srikar Gidugu |\n\n--\n\nListen\n\n1 : Brief Introduction\n\nHello, my name is Srikar Gidugu. I’m from the ECE department. I am from Hyderabad, Telangana.\n\n2 : How did you get into Nvidia? What was the selection procedure?\n\nThe first round was a written test that had 21 questions, and it had to be submitted in an hour. The first 7 questions were on Digital Electronics, focusing mainly on counters and flip-flops. The next 7 questions covered the basics of programming, and the last 7 questions were on aptitude.\n\nThe paper was logical and straightforward. Navigation was allowed in the exam, so you could choose which section to attempt first according to your strengths.\n\nThe second stage was an interview. Mine was the first interview. There were 3 interviewers and all of them were very friendly. It started with a general introduction, and they asked me about the topics I was comfortable with. The first interviewer asked 2 very basic questions on combinational logic and multiplexers. Then they asked me 2 questions about aptitude, one of which I already knew. The last question was a simple programming question for which I had to just give the logic. The whole interview was also filled with general talks about games and graphics. They also asked why I would like to join the company and how it would benefit me. The panel was very friendly and helpful wherever I got stuck.\n\n4 : How to prepare for them?\n\nStart with revising the basics of digital electronics taught in 2nd year. Questions on building gates using multiplexers and the basics of flip flops and counters were asked. Once confident with these, learning Static Time Analysis and the basics of Verilog would be helpful but not necessary. When asked, I clearly said that these were not covered in our course, and I did not have much idea about them; the panel moved to ask questions on the topics I knew and was comfortable with. The questions on programming can be solved from the topics taught in PDS in the first year. I found the lectures of Neso Academy to be helpful for quick revision before the interview and the exam.\n\n5 : What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nI did not face any difficulties during the procedure. I would advise you to stay cool and confident during the exam and not panic. The questions were logical and could be solved if you gave it a good thought. Also, I would suggest you to focus on the basics and be very clear with them before moving on to higher-level topics.\n\n6 : According to you, who should ideally apply for this job?\n\nAnyone who is very much interested in Digital Electronics and would love to know Digital design would enjoy the work. Also, anyone with good aptitude and who isn’t sure about their profile can give it a shot, as it would not take much time to prepare.\n\n7 : Any specific advice you want to give to the junta sitting for internships this year?\n\nUnderstand that CDC can be very chaotic at times, and do not let it affect you. Stay in touch with your friends and take good care of them. Stay confident and hopeful throughout the process.\n\nDuring the interviews, make sure you voice your thoughts, as the interviewer will know the direction in which you are thinking and will help you if you are stuck. The procedure is more important than the final answer; hence, don’t be silent. Let them know your hobbies and interests and how the specific company aligns with them. Keep learning throughout the process.\n\n8 : What are some of the major points you think would be valid to mention in your CV while targeting this profile?\n\nThey did not focus much on my CV until I pointed out a fact that was written in it. I did not have any previous internships or projects. I mentioned a few PORs that I had. You can mention some quick projects to be on the safe side, although it isn’t mandatory. Good interaction and genuine interest in the company were more important than the CV."
    },
    {
        "job_role": "Core",
        "company_name": "Dr. Reddy’s Laboratory",
        "info": "Dr. Reddy’s Laboratories is a leading multinational pharmaceutical corporation with operations in India and overseas.",
        "content": "FORESIGHT(2022): Summer Internship at Dr. Reddy’s Laboratory| Compilation\n\n--\n\nListen\n\nHello! My name is Kumari Bhawna. I am a 3rd-year undergraduate student from the Department of Chemical Engineering, enrolled in its BTech course. I joined DRL as a summer intern this May.\n\nHello, I am Mayuri Sonowal, a final year student in the Department of Chemical Engineering. I did my summer internship at Dr. Reddy’s Laboratories. Dr. Reddy’s Laboratories is a leading multinational pharmaceutical corporation with operations in India and overseas. For the core profile, they mostly hire interns from the mechanical and chemical departments. So, I’ve listed my experiences with the interview and shortlisting processes here.\n\n2. How did you get into Dr. Reddy’s Laboratories? What was the selection procedure?\n\nCompilation:\n\nDr. Reddy offered internships for two profiles –\n\n(i) Core (Technical Training at Manufacturing and R&D sites) — This role was open to students of Chemical and Mechanical Engineering.\n\n(ii) Analytics — This role was open to all departments including the Department of Chemical Engineering.\n\nThe selection procedure of the core profile consists of 4 rounds:\n\n· First and foremost, there is a round of CV shortlisting. You have to submit your CV through the ERP. They did not specify CG criteria, although most people with a CG greater than 7 get shortlisted for the subsequent round.\n\n· Online test (duration — 1hr) — The test mainly had questions based on core Chemical Engineering (easy + average level questions), along with some psychometric and reasoning-based questions, and a few basic questions from chemistry. Almost 41 students qualified for the GD round (core profile).\n\n· Group Discussion round — The GD round was the primary elimination round. It was technical in nature. Every group (7- 8 students) was given a different topic to discuss. The GD problems were mainly based on unit operations (distillation, drying, etc.) and concepts of fluid mechanics. 17 students qualified for the interview round (core profile).\n\n· Interview — It was only one round of interview for approximately 25 minutes. In the interview, I was asked about the projects mentioned in my CV. Also, I was asked situation-based questions on distillation and reactors and I tried to answer them using basic chemical engineering concepts.\n\nIn approximately the last 5 minutes of the interview, I was asked some basic HR questions like ‘Why DRL’, ’my extra academic engagements’, and ‘hobbies’.\n\nFinally, 7 students were selected for the core profile and 2 for the analytics profile.\n\n3. How to prepare for them?\n\nCompilation:\n\nOne has to be thorough with the concepts of their core discipline. For chemical engineering students, fluid mechanics, HT, MT, concepts of humidity and basics of reactors, as well as the fundamentals of thermodynamics are important topics.\n\nFor the test round, I personally felt that solving core chemical engineering questions and aptitude questions will be good enough to get through it.\n\nFor the GD round, knowledge of unit operations and other basic concepts was required. This round is one of the biggest hurdles in the entire selection procedure as more than 50% of students are eliminated at this round. But, thinking about the problem statement in terms of whatever basic concepts you have studied can be really helpful.\n\nFor the interview, one should be able to explain each and everything mentioned in the CV. One should be clear with all aspects of the projects/internships they have done. Aside from that, if you have certain projects, you will always have an edge.\n\n4. What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nCompilation:\n\nStaying positive throughout the process is really necessary and very difficult as well. As the number of companies pursuing core profiles is limited, people who are genuinely interested in the core have fewer opportunities. I tried to be in touch with friends and have some fun time to avoid getting stressed.\n\nHowever, if you’re going for several profiles, then effective time distribution has to be done. I would suggest to prepare an approximate daily routine and follow that. Aside from that, if Dr. Reddy’s or another core organization is your main goal, design your CV in a strategy that represents your passion and become well acquainted with your theories.\n\nSo, if you truly want to create a good impression, attempt to understand all of the chemical or mechanical engineering concepts and construct your resume in such a manner that you’re confident in everything you’ve said.\n\n5. According to you who should ideally apply for this job?\n\nCompilation:\n\nAnyone who is interested in core and wants to understand or evaluate the practical implication of their core domain knowledge or wants to know how the pharma industry works can apply for this profile. Students interested in coding and machine learning can also apply for analytics profiles.\n\nAside from that, I feel that everyone with even a slight amount of curiosity should apply because the experience would be unique and you could get motivated after working there.\n\n6. Any specific advice you want to give the junta, sitting for internships this year.\n\nCompilation:\n\nI have a few pieces of advice for students who will be sitting for the internship this year-\n\nBe patient throughout the internship period. Keep in mind that the CDC is not your only choice. The two-month internship is an opportunity to evaluate yourself, therefore it’s okay if you don’t get an internship within the first three days.\n\nAs DRL comes after day 3, I would strongly suggest, don’t panic seeing other people getting internships on Day 1 and Day 2. Don’t overthink about the results, and give your best shot. Believe in yourself!!\n\n7. What are some of the major points you think would be valid to mention in your CV while targeting this profile? (any specific suggestion you would like to make?)\n\nCompilation:\n\nThe main components are your projects, as well as what you’ve learned and assessed from them. If you have done any internships or projects, you can add them to your CV. It will help in your interviews as you will have something to speak about and it will showcase your knowledge. You can also have a look at your seniors’ CVs, to get an idea of how to present things.\n\nRemember to add any extracurricular activities in which you have participated. Try to demonstrate that you are a versatile applicant who has participated in a variety of activities. As a result, it is critical that you correctly identify all Projects, PORs, and EAAs in which you have participated."
    },
    {
        "job_role": "Core",
        "company_name": "Google Hardware",
        "info": "Selections were mainly based CV. I was mostly asked questions from basic digital electronics FSM(Finite state machine) related question",
        "content": "FORESIGHT(2022): Summer Internship at Google Hardware | Debdatta Hait\n\n--\n\n1\n\nListen\n\nHow did you get into Google (Hardware)? What was the selection procedure?\n\nSelection: Was based on CV. I had a course project on Algo I under PPC sir, an ISRO project of UART implementation on FPGA.Google Hardware Interview Experience : There were two sets of interviews.Round 1: I was mostly asked questions from basic digital electronics FSM(Finite state machine) related questions. I was asked to draw the state transition diagram for a particular question. Then I was asked a question from analog regarding opamp. Then I told them that I mainly prepared for digital, so I would prefer if they asked questions from that. Then they gave me alogical question and asked me to implement it using digital circuits. It was related to binary search. Then they asked a few questions regarding programming and basic flip flops, latches and combinational circuits. Finally, he asked me for 1–2 puzzles, and that’s it. Even if you can’t answer the question perfectly, telling them your approach will help a lot.\n\nRound 2: Round 2 began with a complicated question on static timing analysis where a bigcircuit was given, and I had to explain every stage of how I approached it. They asked a question on K-map minimisation and then computer architecture basics like RAM, ROM,Cache and ISA. Lastly, they asked me a question on recursion(coding in C++). I solved it using both recursion and dynamic programming and they were very happy to see that.\n\nHow to prepare for them?\n\nI aimed for the core- digital profile. So, I started my preparation from the summer after the end of my 4th semester. I went through a few courses on Digital Electronics (Neso Academy lectures), a basic course on ComputerSystem and Architecture(basics from gfg), Static Timing analysis concepts. Knowledge about VHDL/Verilog is also recommended if time permits. I studied them thoroughly. Lastly, I revised my programming, data structure, and algorithms concepts (Since my second profile was software, I was also practicing from Interviewbit, which helped me a lot). I also briefly wentthrough puzzle questions from the interview bit and gfg.\n\nAny specific advice you want to give to the junta sitting for internships this year.\n\nI got COVID positive at the end of April and basically began my preparations from May mid. I started with the NESO playlist of digital first and practiced questions which I gathered from past papers and seniors. I contacted Nagesh Patle, Rudrajyoti Roy and Hima Swetha, who also interned in core profiles. I asked them many questions to clear my concepts. Keeping in touchwith seniors was a huge plus point as they guided me with their interview experience and field expertise. When the interview time was approaching, I also prepared the basics of computer architecture. I learnt VHDL as it was required in my ISRO project which helped me in the interview too. Due to the increased stress in CDC, you must take care of yourself. Do some exercise, get proper sleep and keep in touch with your friends. You have to give lots of tests,face rejections too, still keep on fighting. You need to keep calm, trust yourself, and utilize the summer break efficiently to bag an excellent core offer. That’s it from my side. Thank you! You are free to contact me on my\n\nmy emailhaitdebdatta@gmail.com.\n\nAll the best. Machake!!"
    },
    {
        "job_role": "Core",
        "company_name": "Texas Instruments",
        "info": "These roles are generally open for people of circuit branches already familiar with pre-requisite knowledge of each of these profiles",
        "content": "FORESIGHT(2022): Summer Internship at Texas Instruments| Anish Mondal\n\n--\n\n2\n\nListen\n\nHello, I am Anish Mondal (18EC35033), a 5th-year dual degree student from the Department of Electronics and Electrical Communication Engineering. I received an offer from Texas Instruments in the Signal Processing Profile during my 4th year.\n\nHow did you get into Texas Instruments? What was the selection procedure?\n\nI bagged the internship via the Career Development Centre (CDC) campus internship drive. The selection procedure for the internship includes an objective type screening test based on the different broad topics (Analog, Digital, Signal Processing, and Programming), based on the results of which we get interviews for different profiles. There is also a puzzle section for the objective exam, which is compulsory. One can apply for more than one profile and thus may receive multiple interviews for different profiles. In the end, you must choose one particular profile for your internship.\n\nHow to prepare for them?\n\nAs far as preparation is concerned, most of the things asked in interviews are taken from the ECE courses, which must be revised before the internship drive starts. Some topics are generally not covered in lectures, like static and hold time and cache access time and hit ratio, which should be studied for the digital profile. A summary of all the necessary topics for each of the companies is given in the link below, which was compiled by Gautam Jha, a senior of mine.\n\nCDC Guide for E&ECE Core companies\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nI was doing an internship, the summer before my CDC internship drive, and hence I had lesser time to revise the subjects than some of my classmates. So, in this case, I had to dedicate some time in the week (during my internship) to revise my course subjects.\n\nAccording to you, who should ideally apply for this job?\n\nThese roles are generally open for people of circuit branches already familiar with pre-requisite knowledge of each of these profiles.\n\nAny specific advice you want to give to the junta sitting for internships this year?\n\nI wanted to let the students who want to go for core ECE/EE internships know that there are a lot of openings in this sector, and they should not be worried about securing an internship. Suppose they are unable to secure internships at Google Hardware on Day 1 or Nvidia and Texas Instruments on Day 2 (the first week of results). In that case, they should not be disheartened as many companies come for campusing in the latter days of the internship drive, like Qualcomm, Micron, Intel, Samsung, and many others who also look for people having similar profiles.\n\nWhat are some of the major points you think would be valid to mention in your CV while targeting this profile?(any specific suggestions you would like to make?)\n\nYou could mention the courses you have taken relevant to your profile. As far as mentioning projects and PORs, they are of little importance if they do not apply to your profile. Irrespective of what points you write in the CV, the interviewer will test you on the basic concepts of the subject."
    },
    {
        "job_role": "Core",
        "company_name": "Bajaj Auto",
        "info": "Anyone from core mechanical/electrical engineering should apply at Bajaj Auto and if you think you are good with the fundamentals of your branch",
        "content": "FORESIGHT(2022): Summer Internship at Bajaj Auto| Sadha Shivam\n\n--\n\nListen\n\nBrief Introduction:\n\nHello! I am Sadha Sivam M, a 3rd-year undergraduate student from the Department of Mechanical Engineering at IIT Kharagpur. I am from Madurai, Tamilnadu. I am currently doing my summer internship at Bajaj Auto. Looking forward to sharing my experience!\n\nHow did you get into Bajaj Auto? What was the selection procedure?\n\nI applied to Bajaj Auto through the CDC Internship portal.\n\nThe selection process:\n\nThe selection process involves 2 rounds of tests and 2 rounds of interviews.\n\nHow to prepare for them?\n\nRound 1 — Aptitude and Technical Assessment:\n\nThis test comprises 2 sections — Aptitude (Analytical Reasoning, Quantitative, English) and Technical.\n\nThe Aptitude section was quite simple, practicing regular aptitude questions from various sites online will be more than sufficient to score well in this section. The technical section, as anyone would expect, was the complicated one. The questions were asked from IC Engines, materials, failure theories, thermodynamic cycles, fluid mechanics, etc. Revising class notes of all the core courses and practicing GATE questions would be helpful to answer this section.\n\nIf you are shortlisted in the technical assessment you will receive a link for a Psychometric assessment which is the second round of the tests. It doesn’t require any special preparation. It is enough to be consistent with your answers throughout the questionnaire.\n\nRound 2 — Interview(Technical and HR):\n\nThe first round was the technical interview. After finishing my introduction I was asked to pick my favorite project from my resume and explain it. The interviewers interrupted and asked questions during my explanation. They also asked a few conceptual questions based on the other projects on my resume. The interview lasted for around 20 minutes and I was shortlisted for the HR round.\n\nIn the HR round, the interviewer asked a few general questions and it was more about whether I was interested to work in the company. I would like to give only a couple of advices for the HR round — Express your interest to work in the company and at the end when the interviewer asks if you have any questions to ask, do ask a question or two about the company or any job-related queries.\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nAs I wasn’t a Dual Degree student, I faced difficulties while preparing for the technical assessment. A few topics like IC engines, failure theories, etc, are taught only in the 3rd year, hence it was quite challenging for me to prepare these topics for the test. I took the help of various GATE preparation resources to get an understanding of these topics which helped me during the test.\n\nAccording to you, who should ideally apply for this job?\n\nAnyone who is into core mechanical/electrical engineering should apply for an internship at Bajaj Auto. If you think you are good with the fundamentals of your branch and enjoy working in the core field you should go for it. It is an advantage if you have projects/interns in the core field.\n\nWhat are some of the major points you think would be valid to mention in your CV while targeting this profile?\n\nMentioning projects related to core, research interns in the core field, any other intern(at a startup), or research society involvements(TeamKart, AGV, etc.) in the CV could help you immensely during the interview. Having any of these in your resume will help you to steer the interview to the areas in which you are comfortable.\n\nAny specific advice you want to give to the junta sitting for internships this year.\n\nThe overall CDC internship process is unpredictable, it can become extremely cumbersome and hectic. From my personal experience, if you are someone who wants to pursue core, patience is something you will require the most. You will see your non-core friends getting shortlisted and receiving offers everyday and even, some of your friends in core who have a little experience might get a good offer from a non-core company, these little things could make you anxious and might dent your confidence, but it is very important for you to back your decision and stay true to your intent. At any point in time don’t get into the fear that you aren’t good enough, just be confident and keep going! All the Best!"
    },
    {
        "job_role": "Core",
        "company_name": "Nvidia",
        "info": "People who love designing these complex devices that run HD video games, high computation etc.should definitely give it a shot",
        "content": "FORESIGHT(2022): Summer Internship at Nvidia | Anubhav Prasad\n\n--\n\nListen\n\nBrief Introduction\n\nHello, my name is Anubhav Prasad. I’m from the ECE department. I’m also a member of KRSSG’s electronics and embedded team. I’m from Hajipur, Bihar.\n\nHow did you get into NVIDIA ? What was the selection procedure?\n\nThere are two steps in total, one is an exam and the 2nd is the interview round.\n\nApprox 19 questions were asked in total and the time given was 1 hour. Questions spanned the concepts of digital electronics, PDS (1st year) and probabilities. The difficulty of the paper was moderate. I got some previous year's questions from the JKR funda Facebook page and to my surprise, some questions were exactly the same with different data.\n\nFor the interview Nvidia came on day 2. Mine Was the 1st interview. There were two interviewers, one was a kgpian (don’t remember his batch). So it started with the introduction part and then some random talks related to video games and GPUs. After that the 2nd guy started asking me questions like what is your interest, why you want to join Nvidia, do you want to go for higher studies, etc. It went for roughly 5 minutes and then the 1st interviewer (kgpian) started asking me technical questions. It started with some coding-based questions (basics of sorting) and then followed by a test question which I solved wrong (calculation mistake). So then I did that in front of him and also told him the method. He then asked me questions related to flip flops, multiplexers, etc. After that, he asked me whether I have knowledge of computer architecture and verilog or not. Since it wasn’t covered in my course, I told them I do know basic stuff but not properly. He then asked me whether I know memory hierarchy and pipelining hazards or not. I told them whatever I knew in short. After that the 2nd interviewer gave me a puzzle. I already knew the answer to that so I told them step by step and well that was my final question, after that we talked about some random stuff for 2–3 mins and the interview was over.\n\nHow to prepare for them?\n\nFor preparations there, the very 1st step should be digital electronics. One should be very clear with the concepts of digital electronics, (all small modules like adder, multiplexer, flip-flops, etc). Then try implementing flip-flops with 2-to-1, or 4-to-1 multiplexers. Once you’re confident with this stuff, then learn verilog and try implementing all the learned modules in verilog and try writing testbenches in it. It will give you an idea about how IC’s are designed. Circuit solving methods like KCL, KVL should be clear. Go through the response of the RLC circuits (important for other companies as well). Revise the concepts of PDS (taught in 1st year) that’s enough but additionally if interested you may go through STL, as a year before my CDC a question was asked on vectors.\n\nOnce the above mentioned concepts are clear enough you can go through computer architecture. Memory hierarchy, Pipelining and its hazards are the most important concepts. Some VLSI concepts are also very important like static timing analysis (setup and hold time). Below are the links for computer architecture and VLSI stuff.\n\nhttps://www.youtube.com/watch?v=E0c7M_eEmLE&list=PL9un8tgZngo9-Y5dmi8Fh4dJEMixX6mz7&ab_channel=ComputerArchitectureandOrganization\n\nhttp://www.vlsi-expert.com/p/static-timing-analysis.html\n\nAlthough they won’t ask questions from these concepts if you’re a 2nd-year student. If you don’t know then tell them that these courses aren’t covered yet. Then they will ask you questions from the basis only.\n\nFor puzzles, just go through the 1st chapter of heard on the street book. That’s more than enough\n\nhttps://drive.google.com/file/d/1SAizAj7x8jbfOgjCvQjYqEpUnVp6Xh6o/view?usp=sharing\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem\n\nI don’t face any difficulties as such while preparing. I was pretty sure that I don’t want to sit for SDE or other roles. I just wanted to sit for core profile (digital only). Staying in contact with friends helps a lot as one starts to panic as the CDC is approaching. I would advise you to keep faith in you and be confident. Have proper food, sleep, do regular workouts to be physically and mentally fit and just focus on learning rather than running for different profiles.\n\nAccording to you, who should ideally apply for this job?\n\nIf you are interested in knowing the process of what goes into designing these complex devices capable of running high quality video games, high computation, etc then you should definitely give it a shot. Digital design is a vast and interesting field. If you are still in a dilemma in selecting a profile, I would suggest that try this as well. It won’t take much time to cover the concepts. The new curriculum already covered the digital electronics stuff so it won’t take much time to prepare for it.\n\nAny specific advice you want to give to the junta sitting for internships this year.\n\nBe clear with whatever you write in your CV. Don’t just fake stuff. If you are not confident with anything that you have written then it’s better not to write it.\n\nKeep interacting with interviewers during the interview. Don’t just be quiet, keep talking to them, tell them your approach. It will boost your confidence. They also give hints if you are stuck somewhere, and also it makes a good impression if you keep interacting. Don’t worry if you are not confident in speaking English, proceed with Hindi. They don’t judge the language at all.\n\nBe in touch with family and friends, it helps a lot. Be happy and keep learning.\n\nWhat are some of the major points you think would be valid to mention in your CV while targeting this profile?(any specific suggestions you would like to make?)\n\nWell they don’t focus much on CV, throughout my interview they didn’t ask anything from my CV. They just saw it once and asked about my field of interest. So it’s better to focus on making the fundamentals clear rather than running to make a good CV.\n\nFor CV try to include a hardware project if possible, although not that important but still good to be on the safe side. I would suggest going through the course “NAND2TETRIS” part 1 on Coursera. It’s a project-oriented course and much fun to learn. Additionally, there are websites like fpga4student.com, etc. You may have a look at it if you have time but only after having the fundamentals strong.\n\nFinally all the best for the upcoming CDC. Happy learning. Be safe and healthy.\n\nIn case you need any help then feel free to text me.\n\nEmail: anubhav84prasad@gmail.com\n\nWhatsApp number: 7076168555\n\nLinkedIn: www.linkedin.com/in/anubhav84prasad"
    },
    {
        "job_role": "Core",
        "company_name": "Bajaj Auto| Suryadeep Mandal",
        "info": "People interested in core electrical engineering and automotive systems should apply for this job",
        "content": "FORESIGHT(2022): Summer Internship at Bajaj Auto| Suryadeep Mandal\n\n--\n\nListen\n\nBrief Introduction\n\nHi, I am Suryadeep Mandal. I am a fourth-year undergraduate student in the Department of Electrical Engineering. I am currently an intern at Bajaj Auto in its R&D EEE Department. My project here is on the accurate calculation of power losses in a motor controller for varying drive cycles.\n\nHow did you get into Bajaj Auto? What was the selection procedure?\n\nThere was an initial MCQ test based on which shortlisting was done for the interview. The test consisted of English, General Aptitude, and Technical questions. For Electrical Engineering, technical questions were mostly from Power Electronics and Electrical Machines and were either theory-based or involved one or two small calculations. A few questions were also from Basic Electronics.\n\nAfter shortlisting, there were two rounds of interviews –\n\nTechnical Round — General questions were asked from Basic Electronics and Electrical Machines. I had written in my CV that in a project I had designed a few circuits for the safety of automotive systems, so they told me to show them those circuits and asked me a few specific questions based on those (Relay Drivers, PWM, etc.)\n\nHR Round — After the technical interview, I received a call for the HR round within thirty minutes. HR first asked me to go through my CV and justify why I was suited for the internship role. Then, he asked a few questions like why I was not going for any other automotive company, what my future plans were, etc.\n\nAfter the HR round, I received a call from the CDC Representative about my selection by Bajaj Auto within an hour.\n\nHow to prepare for them?\n\nFor four-year students, revising the coursework on Electrical Machines would help. It would be great if you can utilise the rest of the summer vacation from now on and learn about Power Electronics. For five-year students, revising Electrical Machines and Power Electronics would be very helpful. A project will certainly provide you with an edge over others in the interviews. For those of you who do not know, Prof. Dipankar Debnath has some projects in these fields and is very approachable, so you can try to get a project under him.\n\nInstrumentation guys do not have either Electrical Machines or Power Electronics in their coursework, so you have to work a bit harder during the summers studying both these subjects if you want to crack the test. Do not be worried though, questions are fairly easy so you need not go into much depth.\n\nFor the technical interview, be thorough with your CV and be sure that you understand each and every term that you have mentioned in it as they might also ask questions from some unrelated projects just to check your confidence and depth of knowledge (happened to a friend and co-intern of mine).\n\nFor the HR interview, you may watch some interview videos on YouTube, or read HR interview questions on Google. It does not need much extra preparation though. In the end, just be yourself!\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nI had to study Power Electronics on my own, while also parallelly studying Digital and Analog electronics for other core profiles. I had a little less time as I was involved in a competition for most of my summers. I used GATE books to study the basics of Power Electronics, as well as revise Electrical Machines.\n\nA few more difficulties I faced -\n\nDuring the test, there was a time crunch, and there were almost seventy-five questions to be solved within an hour. There was also negative marking so I had to be cautious while answering the questions.\n\nDuring the HR interview, I faced some network fluctuations but the interviewer was very supportive and ultimately my HR interview was conducted over a phone call.\n\nAccording to you, who should ideally apply for this job?\n\nIf you are interested in core electrical engineering and automotive systems, you should apply for this internship. There are projects given to interns here in Electrical and Mechanical R&D, Manufacturing, Materials, and Engineering Operations (involves robotic automation, embedded systems, AI, etc.) for those of you interested in the core.\n\nAny specific advice you want to give to the junta sitting for internships this year.\n\nWhat are some of the major points you think would be valid to mention in your CV while targeting this profile? (any specific suggestions you would like to make?)\n\nAs mentioned earlier, if you have done any project in core EE or ME, it will be a great value addition to your CV. You can also mention any self-projects that you might have undertaken in the summer."
    },
    {
        "job_role": "Core",
        "company_name": "Bajaj Auto |Swarnim Raj",
        "info": "People who are into Electrical core profile and Electrical systems designing are well suited for the internship in Bajaj Auto",
        "content": "FORESIGHT(2021): Summer Internship at Bajaj Auto |Swarnim Raj\n\n--\n\nListen\n\nBrief Introduction :\n\nHi, my name is Swarnim Raj. I am a fourth-year undergraduate student of the department of Electrical Engineering enrolled in its Instrumentation Engineering course. I have done my summer internship in 2021 at Bajaj Auto in its R&D EE department.\n\nSelection Procedure\n\nThe selection procedure consisted of an MCQ test with questions divided into 4 sections: Aptitude, Quant, Vocabulary & Technical. The test was followed by a shortlisting based on the test and your CV.\n\nFinally, there were 2 technical interview rounds and 1 HR round.\n\nHow to prepare for them?\n\nRevision of your coursework, majorly Machines & Power Electronics, is sufficient to prepare for the test and the first technical round. The second technical round needs you to be thorough with your CV and your projects. You should know each aspect of your project even if some other teammate is working on it. The HR round, as mentioned earlier, does not require more than a few google searches to get familiar with the common HR questions and to know a bit about the company.\n\nYour Project Details\n\nSince I am interning with the Research & Development team, my work was very much on the electrical aspects of the vehicle itself. My work was on an ISG — Integrated Starter Generator (interested people can search it on the net). I would suffice it to say that the work was exciting and you could see the direct application of your work on the vehicle. The result was majorly on Simulink, so previous knowledge of the same was beneficial in my case.\n\nHow was your experience working from home? What difficulties did you face?\n\nI indeed wanted to get a bit of corporate experience, which I could not, but the mentor ensured that I had enough work all the time. If the internship had been on site, I would indeed have gotten the chance to implement my design on a prototype but the online nature of the internship limited me to just computer simulations which was a bummer. It would surely have been more enriching if I had interacted with the officials there and with the other interns.\n\nWhat effect could Covid have in the upcoming internship process?\n\nBajaj Auto did call a few interns on-site based on their project requirement so there is a high possibility of having the upcoming internships offline. But the CDC process is still online. There would surely be people resorting to malpractices in the test. In some questions, you might not be able to convey your ideas as effectively as you would have been face-to-face, so you should indeed work upon your communication skills. Other than that, try to be off social media for a few days to avoid distractions and unnecessary demotivation.\n\nAccording to you, who should ideally apply for this intern?\n\nPeople who are heavily inclined towards the Electrical core profile and Electrical systems design are well suited for the internship in Bajaj Auto. You are not expected to know everything at the beginning of your training but should have a will to learn quickly and apply it to the problem at hand.\n\nAnd what advice would you give them?\n\nTry to deliver a bit more than asked for and also try to take the initiative on your internship.\n\nAnd in general for everybody -\n\nTry to be thorough with your CV\n\nStick to the profile you want to pursue ahead in your career. Don’t go for a profile just because its internship is easy to bag.\n\nCDC is not the end. There are loads of opportunities in each profile so do not hesitate to apply for off-campus foreign research internships.\n\nLast but not the least, try to stay in touch with a senior who has done his/her internship at a place you want to.\n\nBest of Luck,\n\nSwarnim Raj\n\nPS: Do not hesitate to contact me in case of any doubts"
    },
    {
        "job_role": "Core",
        "company_name": "Piramal Pharma",
        "info": "Any potential Chemical Engineering student with a genuine interest in either core ChE or Supply Chain profiles should give their best try",
        "content": "FORESIGHT(2021): Summer Internship at Piramal Pharma | Aravind Barla\n\n--\n\nListen\n\nBrief Introduction\n\nMy name is Aravind Barla, a final year Chemical Engineering undergrad. I’m pursuing a Chemical Engineering core internship in Piramal Pharma Solutions. I watch films and solve equations.\n\nSelection procedure\n\nPiramal selection procedure takes place in 4 steps. I’ll give each filtration stage’s number corresponding to my scenario, but those might not repeat this year.\n\nThis entire process (all the above four steps) took place in the 2nd week of the internship.\n\nHow to prepare for them?\n\nYour Project Details\n\nGenerally, many companies make you sign a non-disclosure agreement, so we shouldn’t give details technically. But to put it short for insight, I was given all the data of an existing boiler and asked to increase its efficiency and optimize all bottleneck costs. Most of the weeks went with the Chemical Engineering-based knowledge of Heat Transfer; however, a bit of Capital Budgeting concepts and documentation was required towards the end of the project.\n\nNOTE: There were 11 interns from 4 IITs, and all of us were allotted different Piramal sites, and the projects assigned were also completely different from each other. Many of them have got Supply Chain and Logistics profile projects too.\n\nHow was your experience working from home? What difficulties did you face?\n\nIt went pretty impressive because they allotted the project considering its WFH feasibility. Also, the internship isn’t only about the project; every week, we had 1–2 sessions from Global leaders of Piramal on various topics such as Design Thinking, Quality culture, Formulations, etc. We miss going on-site and working with hands-on core projects, but they designed the program to compensate for the lack of on-site presence. Also, on a particular need basis, some of us are permitted to go on-site for a week. So, at least after habituation with 2 Online semesters, there weren’t difficulties; attending meetings and utilizing platforms for sharing data felt seamless.\n\nWhat effect could Covid have in the upcoming internship process?\n\nI don’t think there would be an effect on conducting the internship season, as it went organized during my time even with COVID. However, when it comes to the stakes of each individual, then, unfortunately, there are a lot of problems ranging from internet issues to inadequate mental health balance. But it has been more than a year since the pandemic, and everyone is striving against their critical points. So, I wish the pre-final years would also be in a position to pass the upcoming phase. Reach out to your friends in need.\n\nAccording to you, who should ideally apply for this internship?\n\nAny potential Chemical Engineering student with a genuine interest in either core ChE or Supply Chain profiles should give their best try.\n\nAnd what advice will you give to them?\n\nSharpen your presentation skills, be concise about what you explain, and make the interviewer understand each point you’re speaking. Spend time on the topics/courses/internships/projects/competitions you have more grasp on and smartly skip the topics of ambiguity during the interview. Start making it a discussion right after your introduction, take cues from the interviewer, give pauses, and be pleasant. Balance being intuitive yet professional. Also, Piramal usually maintained a consistent style in the pattern of interview questions across the IITs, so if you have friends in other IITs to get information from, then contact them before your interview day.\n\nIt’s going to be fun, and it’s going to be alright, Peace!\n\nNot many can keep their sane state of mind during the internship drive, and if you could master that one bit by making rational decisions whenever needed, you’ll be already halfway through it. All the best!\n\nGoogle drive link to his Image — https://drive.google.com/file/d/1wTm1PxYpGrn6RLRb_JABMcBLgtSd2t98/view?usp=sharing&fbclid=IwAR2sdGIwa6hYWxxepT20sZ_oW-JoRxEP6C-UHCxRXlu24r4rRbzX333gWSM"
    },
    {
        "job_role": "Core",
        "company_name": "Micron Technology",
        "info": "Micron is a semiconductor company. Those who are into core elctronics and want a career in the same should apply at Micron.",
        "content": "IITFORESIGHT(2021): Summer Internship at Micron Technology | Rohit\n\n--\n\nListen\n\nBrief Introduction\n\nHi, I am Rohit. I am a final year UG student of the Department of Electrical Engineering enrolled in its B.Tech course. I have completed my summer internship as a Design Verification Intern at Micron Technology.\n\nSelection procedure\n\nFirst, we had a CV shortlisting round, then there was around 1 hour of written test MCQ-type questions on Aptitude, Analog, Digital, and Verilog. They gave a dedicated time slot to each part. The test was of moderate level and most of the problems were easy. They selected 18 guys for the interview.\n\nThere was only a technical round, no HR round. I had my interview for around 40–45 minutes. After A few minutes, he asked me a few questions from my CV and asked me to explain a few points I mentioned in my CV. Later he started asking technical questions. Technical questions were from Analog and Digital, most of the questions were easy, from basic kmap minimization, CMOS inverters, Transistor level circuits, logic gates, diodes circuits, BJTs, and all. I believe he was trying to test my basics of Analog and Digital. Finally, they selected 3 of us for the internship.\n\nHow to prepare for them?\n\nI would rate both the test and interview as moderate level. One should be strong with the basics of Analog and Digital. Analog and Digital both are depth courses for us so try to perform well in these and go through whatever your professor teaches you. For Analog one can go through Behzad Razavi’s ( book + video lectures).\n\nFor digital since it was in 5th sem for us I have gone through Digital Electronics Circuits on NPTEL by Prof. Goutam Saha and Neso Academy’s Digital Electronics videos over youtube. Book I will suggest Morris Mano for practice. Most of the core tests are MCQ type so one can also solve GATE questions for practice.\n\nThe cutoff for core profiles is around 8–8.5. So to qualify for their written exam, one must satisfy CG cutoff. A CGPA of 8+ is good enough. Most of the core companies look for people with a good understanding of concepts, I repeat have a good understanding of concepts and practice problems as much as you can.\n\nYour Project Details\n\nThere was a 3 week training period entirely based on core subjects. We went through the whole DRAM circuits understanding the working principle and design, getting familiar with Cadence Virtuoso, Verilog, Finesim, and other basic materials required to start the project.\n\nThe training period was really good. We were exposed to a lot of things within a short period of time. My profile was Design Verification so we have to automate the verification flows of our design. I have to develop python scripts to check for finesim waveforms for various test modes. I know it may not sound core-oriented but along with python scripts I have to do a visual check of waveforms and compare the results with the script I wrote.\n\nMy main purpose was to automate the waveform measurements using python scripts. Since it was just an 8-week internship they gave us a few test modes so that I can get familiar with working on test modes. Normally full-time employees work more on core related things.\n\nHow was your experience working from home? What difficulties did you face?\n\nIt was an 8-week long internship starting from 10th May to 5th July. My experience working from home was good but we all know working remotely can’t match with on-site work. But my mentor, manager, and colleagues all were very friendly, helpful, and supportive.\n\nThey made my internship much better than I expected. Although there are some pros and cons of working from home. Talking about pros, you can adjust your working hours and lifestyle easily, better productivity, and be safer at home in these tough times. While we miss going to the office, making new friends, talking to employees informally, You don’t get to know your team very closely. I feel the on-site experience is a whole different experience but the internship was conducted so nicely remotely as well.\n\nWhat effect could Covid have in the upcoming internship process?\n\nCovid was there last year as well. We had our whole internship process online and I guess things will get better this time than last year in terms of conducting the internship process online. The major problem covid is creating is connectivity, so stay connected with your friends and seniors, don’t lose hope, things will go right.\n\nAccording to you, who should ideally apply for this internship?\n\nMicron is a semiconductor company. Those who are interested in core electronics and want to pursue a career in the same should apply at Micron.\n\nWhat advice will you give to them?\n\nThere are relatively fewer opportunities to get an internship in the core because of the large strength of EC+EE and less number of core companies coming for internships. Don’t restrict yourself to a single profile, at least try to give tests for each profile. Don’t completely rely on core, also have some backup for software profiles too. In software, knowledge of Data Structures and Algorithms would be enough.\n\nI would recommend following the JKR funda page as he provides most of the core related materials and fundae. Also, be in touch with the seniors, we are more than happy to help you. Lastly, I would say don’t worry much about internships, placements. There are a lot of opportunities ahead. Even if you don’t get internships through CDC you can always apply off-campus. Appear for GATE exam, apply in PSUs, etc.\n\nAll the best."
    },
    {
        "job_role": "Core",
        "company_name": "Qualcomm",
        "info": "People genuinely into Hardware and finding core subjects interesting can apply at Qualcomm.",
        "content": "K FORESIGHT(2021): Summer Internship at Qualcomm | Ankur Mishra\n\n--\n\nListen\n\nBrief Introduction\n\nHello, everyone. I am Ankur Mishra, a Final Year Undergraduate student from the Department of Electronics and Electrical Communication Engineering, enrolled in its B. Tech program. I have completed my internship at Qualcomm in Summer 2021 as a Hardware Engineering Intern. I was selected through their on-campus recruitment drive.\n\nSelection procedure\n\nThe selection procedure for Qualcomm in Hardware Engineering profile consists of a written test followed by a Technical Interview and an HR interview. It is pretty much the same for all other core companies. The written test (MCQ) was conducted on the HirePro platform (Audio and Video proctored).\n\nFor the Hardware Engineering profile of Qualcomm, the most important topic is digital electronics (combinational and sequential circuits, CMOS logic).\n\nMost of the questions are from digital electronics and a few advanced topics like static timing analysis and fundamental computer architecture concepts like pipelining, caches, etc.\n\nThere are also some basic coding questions based on the Programming and Data Structures course taught in the first year.\n\nThere is also an aptitude section. The questions are generally not difficult for Qualcomm but require some practice.\n\nThe technical interview was of about 30 minutes. At first, various things were written in my CV like what you did in the Electrical vehicle Group, what is UART, SPI protocol (I had written them in my CV), what is css, etc.\n\nFrom there on, we moved to the digital electronics part. I was asked to draw some counters; Can flip-flop be used as Not gate? Etc. I had written in my CV that I know basic Verilog, so he asked me to write a code for D flip-flop, which is easy.\n\nThen a fundamental programming question was asked to swap numbers stored in two variables without using a third variable. I was also asked to draw a circuit from given timing diagram. Between these some riddles were also asked like river crossing problems etc.\n\nI was asked basic conceptual and analytical questions on various combinational and sequential circuits. They also take a lot of follow-up questions based on a question and try to test your understanding.\n\nAlso, they keep helping you to reach the answer. I felt it’s okay if we can’t answer all the problems but try to solve all the riddles and most of the digital electronics problems for the selection. The HR interview was only for 5 minutes and was just a formality. The interviewer only asked me about relocation constraints and asked me about which specific team I would like to join, of which I had no idea, so I said any team would be fine.\n\nHow to prepare for them?\n\nPreparing for the core profile is more manageable because most things are either taught or taught in the coursework itself. Analog Electronics required for analog profile is covered in the second year itself, but Digital Electronics is not. So, for Digital Profile, we are primarily on our own. For Basics of Digital Electronics, this course on Nptel by one of our professors is quite good: https://nptel.ac.in/courses/108/105/108105132/.\n\nThe playlist by Neso academy on Digital Electronics is also good. I would suggest completing both of them for basics.\n\nTo learn about Static Timing Analysis this website, I found helpful:\n\nhttp://www.vlsi-expert.com/2011/03/static-timing-analysis-sta-basic-timing.html?m=1\n\nThis Playlist is I found helpful if you want to start with Computer Architecture:\n\nhttps://youtube.com/playlist?list=PLxCzCOWd7aiHMonh3G6QNKq53C6oNXGrX\n\nVerilog can refer to various websites and take up a self-project to code some circuits. Also, Courses are available on Coursera, which can teach VHDL and Verilog.\n\nYour Project Details\n\nI interned with the Design Verification team of one of the subsystems of Qualcomm chips. I had two different assignments during the internship; one was to automate the Memory pin connectivity verification flows, and the other was to develop a memory retention state logger. So, for some critical pins of the Memory, we followed a hard-coded approach for the connectivity verification, and various issues were coming in that approach.\n\nSo, my task was to automate this flow and develop a script that takes data from the memory team and generates system Verilog files which can be directly tested in Formal and simulation flow. For the second task, I had to develop a logger which tells us about the retention state o memory in real-time flow. I completed my project within ten weeks, and I also submitted a paper to Qualcomm internal conference. The project was entirely done using System Verilog and Python. I knew Verilog, but I was not familiar with OOP and UVM concepts, so I learned these on the go. I was also unfamiliar with Python scripting and file handling packages and spent almost 1–2 weeks developing the concepts.\n\nHow was your experience working from home? What difficulties did you face?\n\nWork from home is never a choice as compared to onsite working. Due to WFH, we couldn’t meet members of other teams and get to know what other groups are doing. We were mostly limited to our work. Also, it was difficult to bond with my other team members as we were allotted Virtual Desks on which video call was not an option, so I never got to see any of my teammates. Nevertheless, HR tried to keep us engaged with several fun events and sessions. Various Goodies were also provided before Joining. Work culture is good at Qualcomm. Everybody is beneficial, and you can approach anyone irrespective of his position and clear\n\nyour doubts. We are also facing a shortage of chips worldwide these days, so many projects are going on parallel, and everybody is extremely busy. However, my manager and mentor, and other teammates were still available for call whenever I needed.\n\nWhat effect could Covid have in the upcoming internship process?\n\nSimilar to last year, this year also we will have an online selection process due to covid. It becomes a problem for some students who don’t have proper resources like good internet connectivity. But we can hope that the Internship will be onsite. Also, seniors are not there to personally guide them, and they also cannot interact physically with their batchmates and know how they are preparing.\n\nWho should ideally apply for this intern?\n\nPeople who are genuinely found themselves interested in Hardware should apply for this role. Those who didn’t get a chance of getting exposed to Hardware through various Research groups in KGP and found core subjects interesting can also apply. The problem is you may not be interning with the team you wanted because they allot randomly, but you will learn a lot by interning at Qualcomm.\n\nWhat advice will you give to them?\n\nThere are very few companies that come for core profiles compared to software ones, and it causes self-doubts like whether we are doing the right thing by preparing for the core. But if we prepare well, we can easily get selected because competition is also lesser.\n\nAlways find a senior who has already interned in these companies because a mentor is significant during this process as it sometimes becomes depressing. Hence having someone to talk to and get the proper guidance regarding preparation material and strategies is substantial. It is always good to find your interests as early as possible, but even if you don’t, don’t get pressured by it.\n\nIf you find yourself interested in the core, start preparing by taking up the recommended materials, prepare a good CV, and get it reviewed. Before the written test, you should go through the previous year’s question papers for that company.\n\nFew things to keep in mind regarding interviews:\n\n1) the Interviewer also tests the approach and your thought process apart from your final answer. So, keep talking to him about what you think can be the way up to the solution.\n\n2) Prepare your CV well and don’t write anything you are unsure about.\n\n3) You can always ask for hints whenever you are stuck. He is always there for help but to a limited extent.\n\n4) Be ready for the interviews even when the shortlist is not out because there is not much time between Shortlist and Interviews. To conclude, I would say don’t take unnecessary pressure and keep calm and patient during the process. Always remember there will be many opportunities, and don’t lose hope if you face rejections.\n\nAll the best,\n\nAnkur Mishra!"
    },
    {
        "job_role": "Core",
        "company_name": "Nvidia",
        "info": "Students wanting a career in core electronics and about work of big designs can apply at Nvidia",
        "content": "FORESIGHT(2021): Summer Internship at Nvidia | Ayan Chakraborty\n\n--\n\nListen\n\nBrief Introduction:\n\nHello, my name is Ayan Chakraborty. I am a final year BTech Student from the Department of Electronics and Electrical Communications Engineering, IIT Kharagpur. I am doing my internship at Nvidia this summer 2021. I got the internship offer from Nvidia through the on-campus CDC Internship drive.\n\nSelection Procedure:\n\nThe selection procedure for Nvidia consisted of two stages — online test followed by interviews. Nvidia had a CG Criteria of 9 for sitting in the tests (which was later reduced to 8.5, I think).\n\nThe online shortlisting test was divided into 3 sections. The 1st section had MCQ questions related to Digital Electronics (Combinatorial and Sequential circuits), CMOS and design and timing analysis of FSMs. The 2nd section was logical reasoning. The 3rd section had lots of Fill in the Blanks related to Computer Architecture and 1 easy coding question.\n\nAfter shortlisting, there was a single round of interview, in which I was asked about my projects I had mentioned in my CV. After that, I was asked technical questions related to Interrupts, Digital Design, Pipelining and Data Hazards. I was also asked an aptitude question. It is important to be clear on fundamentals.\n\nHow to prepare for them?\n\nKnowledge on Digital Electronics and Computer Architecture is important. There are many resources available on Youtube. I recommend the lecture series on Prof. Onur Mutlu’s Youtube channel. You don’t need to understand all of them, but at least you should be familiar with topics upto (and including) Pipelining, Caches and Memory hierarchy. MIT OCW is another good resource for these topics. You can also refer to NPTEL Lectures. For aptitude questions, you can practice from the Heard on the Street book. You should also know the basics of CP and how to use STL data structures for the coding question. You should also check out the JKR funda page on FB for many additional resources.\n\nYour project details:\n\nMy work involved the use of Formal Verification to verify digital designs. Verification is the process of verifying that a design works as expected under all conditions. There are many different forms of verification, formal verification is one of them. It is not a prerequisite to know about verification, you will learn about it after you join.\n\nHow was your experience working from home?\n\nIt was a very good experience working from home. I did not face any technical difficulties. I had regular meetings with my manager, mentor and fellow team members, and I was helped by them a lot. There are no fixed working hours, and it was up to me when I wanted to work, as long as I completed my tasks. There were many interactive sessions organized as well. I was also sent some goodies :)\n\nEffect of Covid on upcoming internship process?\n\nSince this year also, the process is happening online, you may feel alone sitting for so many tests and interviews. Try to form a small group of friends with whom you can discuss. Also since it is online, you may have trouble expressing your thoughts to the interviewer, so make sure to keep thinking out loud during the process. Keep a working webcam and stable net connection.\n\nWho should apply for this internship?\n\nStudents looking to build a career in core electronics and interested in learning more about how big designs work should definitely apply. There is a lot of scope to learn a lot of new skills. You could also get software related projects after joining depending on your CV and interests.\n\nWhat advice will you give them?\n\nAs I mentioned earlier, it is important to let the interviewer know what you are thinking. The number of companies coming for core internships is comparatively limited compared to non-core companies, so don’t get demotivated if some of your friends get internships before you. Keep a calm mind during tests and be clear on the fundamentals. Keep in touch with placecomms during the day of interviews and communicate your priority order to them. You should also read up a bit on the latest news and products of the company you are interviewing for."
    },
    {
        "job_role": "Core",
        "company_name": "Dr Reddy’s laboratories",
        "info": "Anyone who is intersted in core and has followed ChE curriculum of 2nd and 3rd year can apply here",
        "content": "FORESIGHT(2020): Summer Internship Dr Reddy’s laboratories| Anmol Joshi\n\n--\n\nListen\n\nBrief Introduction:\n\nI am Anmol Joshi, a final year student of Chemical Engineering department and a boarder of MS Hall. I interned at Dr. Reddy’s laboratories at the end of my third year and got a pre-placement offer.\n\nSelection Procedure:\n\nThe selection process of Dr. Reddy’s consists of 4 rounds. First off, there is a CV shortlisting, which is followed by a test. Almost all the students go-ahead for the GD round next, and finally, an interview consisting of a mix of technical and HR questions takes place.\n\nHow to prepare for them:\n\nIn general, almost everyone applying for the internship is shortlisted for the GD round irrespective of CV and how well they fared in the test.\n\nThe test consists of questions from chemistry and core chemical engineering questions (for CH students), along with sections of psychometric and reasoning based questions.\n\nThe third round, which is the GD round, is where the major elimination begins and that is where your core chemical engineering knowledge comes into play. It is important to have your basic concepts involving heat, mass and momentum transfer sound, along with the ability to explain where a particular concept fits right.\n\nThe final interview is where you are mostly grilled on your CV, so it is important to be prepared on whatever you include in it.\n\nYour Project Details:\n\nProjects at Dr. Reddy’s can be allotted in R&D, manufacturing or any other department based on the company’s requirements. I was allotted a project on the analysis of scale-up for the production of a pharmaceutical drug intermediate.\n\nHow was your experience working from home? What difficulties did you face?\n\nA remote internship does have its own shortcomings, in terms of the fact that you feel isolated at times and might not be able to touch base with your project mentor for as long as a week. It is therefore imperative upon you to connect with your mentor and let him be known of the developments at regular intervals. My project seemed a bit boring at times as I could not get the direct exposure of what goes on at the manufacturing facility during drug production at a large scale.\n\nWhat effect could Covid have in the upcoming internship process?\n\nAn online GD is certainly not the best option for shortlisting students for the final interview process, so it is possible that a company like Dr. Reddy’s might just put out a case for the applicants involving a technical issue that the company faces or one that could help increase the efficiency of a processor device. However, tests and interviews could just remain as they are.\n\nAccording to you, who should ideally apply for this internship?\n\nAnyone who is interested in core, and has followed whatever has been taught in the second and third year as a part of the chemical engineering curriculum.\n\nAnd what advice will you give to them?\n\nFirst of all, be absolutely sure that you have a genuine interest in core, irrespective of your CGPA. If you get your concepts clear and more importantly be able to explain them, securing a core chemical engineering internship should be a cakewalk. Also, be thorough on whatever you have mentioned on your CV, because a lot of companies ask you to go through it."
    }
]