[
    {
        "job_role": "Data",
        "company_name": "EXL Services",
        "info": "The only thing that matters is the Project/ Previous Internship in this field. It doesn’t mean one shouldn’t have any other sections in their CV but the CV should contain a minimum of 2 projects/interns",
        "content": "FORESIGHT(2024) | Internship at EXL Services | Pravalika Das\n\n--\n\nListen\n\n1) Brief introduction and description of the offered role.\n\nHi. My name is Pravalika Das. I am a fourth-year undergraduate student of the Department of Chemical Engineering enrolled in its B.Tech course. I was offered a Summer Internship at EXL Services in the last year’s on-campus internship season.\n\nMy main role is that of a Data Analyst and to assist in any project as per the requirements.\n\n2) How did you get into EXL? What was the selection procedure?\n\nIt was an interesting experience. I was shortlisted for the interview rounds while I was in my Inter-IIT last year. Fortunately, everything went well and I received a call from the Placecoms that I had received the offer.\n\nThe selection procedure consisted of a Resume shortlisting round followed by 2 Personal Interviews. Both the interviewers asked stuff related to my projects, Probability and Statistics, Aptitude(Logic) questions as well as Guesstimates.\n\nI remember my Guesstimate question from the second interviewer to be:\n\nWhat percent of KGP Junta indulge in Coffee?\n\n3) How to prepare for them?\n\nThe list of the shortlisted candidates was released a day before the interview round. In such a short period, it becomes difficult to actually “prepare”, rather it would be advisable to revise the resume that has been submitted and the topics that have been mentioned in the CV.\n\nIt would be good if the shortlisted candidate knew the basics of Guesstimates(the different approaches and the preliminary questions that need to be asked). The interviewer mainly looks at our thought process in this. Knowing a bit about the company also helps! I remember talking to my interviewers about the company in the end and the insights they provided to the questions I asked were great. It is good to show that you have an interest in the company and are curious about it. Going through HR questions like “Why Data Analyst role?, Why EXL?” is also important.\n\n4) When did you start preparing for this role and according to you what is the ideal time for aspirants to begin their preparation?\n\nData was my backup option in case I did not get an Intern in my preferred domain. I had done projects in Data Science till the summer of last year, so I included the ones I was sure I could answer all the questions fearlessly. I had explored this field back in the summers of 1st year and I brushed up my concepts in the last year’s summer vacations.\n\nThe ideal time to start the preparation would definitely be the summer vacation if someone hasn’t started yet. EXL comes around the end of September/beginning of October, so a person has sufficient time to skill themselves up.\n\n5) What difficulties did you face while preparing for this Company/Profile? How did you overcome them?\n\nI was not good at coding during the last summers. I had done some CP stuff in the summers but had stopped midway when I was too demotivated. The biggest hindrance to this role was the coding rounds that had to be passed.\n\nLuckily, EXL had no such coding rounds so I was shortlisted based on my knowledge of Data ;)\n\nBut yes, if one is going for this role, knowing DSA is pivotal! It’s great if a person doesn’t stop coding if they are not getting the desired results at once.\n\n6) Are there any specific requirements such as department, CGPA, or other criteria for this position? Additionally, do certain PORs or EAAs enhance one’s chances of securing this internship?\n\nNo. EXL did not have any such criteria that only the Circuital Department students would be allowed to submit their resumes etc. There weren’t any CGPA criteria as well. People having less than 7.5 CG were also shortlisted as far as I can remember.\n\nPoRs and EAAs are good to have in your resume but they do not make quite an impact in the selection procedure.\n\n7) According to you, who should ideally apply for this job?\n\nAnyone who has a fascination with Data Science/Analysis should apply for this role or those who have kept Data as their backup option. It is good to have at least 2–3 projects if one has decided to apply for this role.\n\n8) Kindly attach your CV/Resume. What are some of the major points you think would be valid to mention in your CV while targeting this profile?\n\nProjects! Projects! Projects!\n\nThe only thing that matters is the Project/ Previous Internship in this field. It doesn’t mean one shouldn’t have any other sections in their CV but the CV should contain a minimum of 2 projects/interns that the person can defend in the interview if shortlisted. Adding NLP projects would be beneficial since the role explicitly mentioned that we needed to do some NLP stuff.\n\n9) Lastly, what advice would you like to give to the students aiming to grab CDC internships this year?\n\nI got shortlisted by 4 companies in Day 1 and 3 but couldn’t convert them because of my nerves in the interviews, whereas in EXL, even though I was in IIT Gandhinagar and had to run after the inauguration ceremony to my hostel to start the interview, I was quite calm(maybe due to the joyous mood of everyone near me). I did not stress at all and answered all the questions that were asked. So, the best lesson I learned was to maintain your calm :) and would advise the same to the CDC junta. Consider the interviewer to be a common person asking you questions in the area of your expertise and go for it!! Best of Luck CDC Junta."
    },
    {
        "job_role": "Data",
        "company_name": "JM Financial Ltd.",
        "info": "Do some projects related to Machine Learning and Deep Learning. Know why you are using some specific algorithms in your projects. Keep your basics strong in Probability, Statistics, Machine Learning and Deep Learning.",
        "content": "FORESIGHT(2024) : Internship at JM Financial Ltd. | Malla Dhanraj\n\n--\n\nListen\n\nHello, I am Malla Dhanraj, a 4 th year undergraduate from the Department of Industrial and Systems Engineering enrolled in its Dual degree course. I am from Visakhapatnam, Andhra Pradesh.I received Data Science internship offer from JM Financial Ltd. for the summer of 2024. I am currently interning at their office in Marol, Mumbai.\n\n2. How did you get into JM Financial Ltd. ? What was the selection procedure?\n\nI got the offer from JM Financial Ltd. through CDC IIT Kharagpur. The Selection Process consisted of the following steps:\n\n3. How to prepare for them?\n\nDo some projects related to Machine Learning and Deep Learning. Know why you are using some specific algorithms in your projects. Keep your basics strong in Probability, Statistics, Machine Learning and Deep Learning. Keeping your basics strong helps in clearing almost all the rounds. Also learn Data structures and Algorithms this helps a lot in clearing the coding round and practice coding in python (along with any other language you prefer), as python is one of the programming language which is used widely for the data science stuff. For the HR round have a look at the company’s website and try to know about the company as much as you can.\n\n4. When did you start preparing for this role, and what is the ideal time for aspirants to begin their preparation?\n\nI have decided to aim for the data science roles from the start of my 3 rd year. But I think with something around six months in hand one can have decent knowledge in Data Science field. It is never too late, start as early as possible even if your internship season is nearer don’t be panic, just believe in yourself and continue your process of learning, eventually you will get some internship.\n\n5. What difficulties did you face while preparing for this Company/Profile? How did you overcome them?\n\nThe difficulties I faced while preparing for the Data Science profile is mostly related to mathematical side of Machine Learning algorithms and learning DSA (Data Structures and Algorithms) is the other difficulty which I had faced. I overcame the difficulty in understanding mathematical side of Machine Learning by learning the concepts of Linear Algebra, Probability and Statistics. To overcome difficulties in DSA, I practiced more problems with different patterns.\n\n6. Are there any specific requirements such as department, CGPA, or other criteria for this position? Additionally, do certain PORs or EAAs enhance one’s chances of securing this internship?\n\nAs far as I remember there are no specific requirements for Data Science Internship at JM Financial Ltd. Having PORs or EAAs are not that required for Data Science role, but some work experience related to the Data Science field will help in enhancing one’s chances of securing this internship.\n\n7. According to you, who should ideally apply for this job?\n\nAnyone who is really fond of Linear Algebra, Probability and Statistics. Also, someone who is interested in analysing and interpreting the data.\n\n8. Kindly attach your CV/Resume. What are some of the major points you think would be valid to mention in CV while targeting this profile?\n\nFor Data Science profile having good projects in CV is a big plus. Some of the major points to mention in CV while targeting this profile are adding all the machine learning/deep learning algorithms used, highlighting the results obtained, highlighting any kind of numbers present in one’s projects/competitions.\n\n9. Lastly, what advice would you like to give to the students aiming to grab CDC internships this year?\n\nI recommend everyone to have a clear understanding of their preferred role in mind and also ensure to have a backup profile. As the internship process is somewhat hectic, try to have a positive mindset throughout the process, don’t stop preparing for your preferred role by looking at few results of internship which did not go in your favour. There will be opportunities in some other companies, just keep on preparing for your dream role you will eventually grab an internship. Wishing you all the best for your internship drive, I hope you receive your dream opportunity !!!"
    },
    {
        "job_role": "Data",
        "company_name": "AWL Inc.",
        "info": "Brush up on common interview questions and practice your responses. Be prepared to discuss your experiences, projects, and technical knowledge.",
        "content": "FORESIGHT(2023): Summer Internship at AWL Inc. | Manav Nitin Kapadnis |\n\n--\n\nListen\n\n1) Brief Introduction\n\nGreetings, my name is Manav Nitin Kapadnis. I am a fourth-year Dual Degree undergraduate student studying Electrical Engineering at the Indian Institute of Technology Kharagpur. This summer, I will be interning at AWL Inc. as an AI Engineer. I have gained valuable experience through previous internships with renowned institutions like University College London, University of Alberta, Rutgers University, and Massachusetts Institute of Technology. My research interests focus on the practical applications of Machine Learning and Natural Language Processing, particularly in the areas of Natural Language Processing, Graph Machine Learning, Representation Learning, and Multi-Modal Learning.\n\n2) How did you get into AWL? What was the selection procedure?\n\nI joined AWL Inc., a Japanese Deeptech startup specializing in Computer Vision and Deep Learning-based video analytics solutions, as an AI Engineer Intern. The selection process involved the following steps:\n\nResume Selection Round:\n\nTo progress to the next stage, it was crucial to have a strong background in Deep Learning and Machine Learning, supported by a few notable projects. While there was no specific CGPA cutoff, having a CGPA above 8 and an impressive resume significantly increased the chances of moving forward. Alternatively, even with an average CV, a CGPA above 9 provided a favorable opportunity.\n\nCoding, Aptitude, and Data Science MCQ Round:\n\nThis round lasted approximately 1.5 hours and included a mix of two coding questions, around 10–15 multiple-choice questions related to Data Science, focusing on probability, statistics, computer vision, and deep learning. Additionally, there were MCQs assessing knowledge of Data Structures and Algorithms. Qualifying this round was essential to proceed to the final interview round.\n\nFinal Interview Round:\n\nThe interview round primarily revolved around discussing the projects and internships mentioned in the resume. The interviewers delved into the details of representative internships or projects, seeking explanations about the motivation behind them, encountered challenges, and how they were overcome. Furthermore, a case-study test was conducted, where I was asked to provide solutions to a problem the company was facing with their current product. This round typically lasted around 30 minutes, emphasizing the need to present one’s best project for discussion, as it played a significant role in shaping the final decision.\n\n3) How to prepare for them?\n\nI had mainly prepared for Data Roles in CDC. To prepare for the selection process, I followed a structured approach focusing on specific areas:\n\nData Structures and Algorithms (DSA):\n\nI solved a variety of coding problems from InterviewBit, ensuring I covered the majority of the practice questions. In the weeks leading up to the selection process, I revised the challenging questions to reinforce my understanding. Although DSA wasn’t my primary focus, I made sure to cover the essential concepts necessary for success.\n\nMachine Learning (ML):\n\nI found Krish Naik’s YouTube playlist on Complete Machine Learning to be an excellent resource for gaining in-depth knowledge of various ML algorithms. This playlist also provided coding examples to understand and implement the algorithms from scratch. Additionally, I discovered the StatQuest YouTube channel, which offers easy-to-follow explanations of fundamental concepts. This channel also has a playlist specifically covering Probability, which was helpful for strengthening my understanding. For practice questions, I utilized Analytics Vidya’s top N questions for ML and Data Science interviews.\n\nProbability and Statistics (Prob Stats):\n\nI had previously taken a course on Probability and Statistics (MA20104), which provided a theoretical foundation. Alternatively, I recommend the Stat 110 course offered by Harvard University, which is available for free on Edx or YouTube. For practice, I used assignments from Stat 110 and questions from the book “Fifty Challenging Problems in Probability.” If additional practice was needed, I referred to InterviewBit’s DS and ML practice questions.\n\nCV Preparation:\n\nFor each section of my CV (projects, internships, positions of responsibility), I created a comprehensive list of potential interview questions and prepared answers in advance. I found it helpful to make concise notes for each heading, which I could quickly review the day before the interview.\n\nPlease refer to the following link for a Google Doc containing a collection of resources I used for preparation: [Resource Doc Link:\n\nhttps://docs.google.com/document/d/1YqjIMPHBfa_ioSsoaKN9R79xsUKQD3aIlIGo5SUGX_0/e dit]\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nDifficulties faced and tips to overcome them:\n\n- Comprehensive Data Topics: Data encompasses a wide range of topics, making it challenging to brush up and revise everything just a day before the interview. To overcome this difficulty, I maintained a Notion board or a similar tool to track the topics I had covered and those that still needed review. This helped me stay organized and focused during my preparation, ensuring I covered all essential areas over time.\n\n- Balancing CDC Preparation and Internship Work: I faced the difficulty of managing my CDC preparation alongside the responsibilities of my internship, particularly when I was visiting Canada. To address this challenge, I recommend starting the preparation process from mid-May if you are interning during the summer before CDC. Alternatively, if you have one month before the CDC process begins (typically in July), it is still feasible to prepare effectively, provided you have already been practicing Competitive Programming (CP) during the previous semester. Efficient time management and prioritization are key to maintaining a balance between internship work and CDC preparation.\n\n- Finding Practice Questions for ML Case Studies: I encountered difficulty in finding sufficient practice questions specifically focused on ML case studies. To overcome this challenge, I relied on reputable platforms such as Analytics Vidya, Interviewbit, and MLExpert. These platforms offer a wide range of questions that help build a strong conceptual and practical understanding of the concepts required for data roles. Exploring their resources and regularly practicing with their case study problems can enhance your preparation for ML-related interviews.\n\nBy implementing these tips, you can navigate the difficulties faced during the preparation process and optimize your chances of success in the selection process.\n\n5) According to you, who should ideally apply for this job?\n\nIdeally, individuals who have a genuine interest in the field of Machine Learning and Data Science should apply for this job. If you have a passion for Data Science and are seeking an opportunity to work in a fast-paced international startup environment, AWL Inc. would be the ideal place for you.\n\n6) Any specific advice you want to give to the junta sitting for internships this year?\n\n- Research Companies: Take the time to research and understand the companies you are interested in. Explore their products, services, and values to ensure they align with your career goals and interests.\n\n- Build a Strong Resume: Tailor your resume to highlight relevant skills, experiences, and projects. Focus on showcasing your achievements and the impact you made in previous roles or academic projects.\n\n- Practice Interview Skills: Brush up on common interview questions and practice your responses. Be prepared to discuss your experiences, projects, and technical knowledge. Mock interviews or interview preparation workshops can be helpful.\n\n- Stay Positive and Persistent: The internship application process can be competitive, and rejections are common. Stay positive, learn from each experience, and keep trying. Persistence is key to finding the right opportunity\n\n- Seek Guidance: Reach out to mentors, professors, or career counsellors for guidance and support throughout the application process. They can provide valuable insights and advice to help you succeed."
    },
    {
        "job_role": "Data",
        "company_name": "Qualcomm",
        "info": "Prob-stats usually help in any Data oriented profile and it is a must if you’re targeting it. Solve standard puzzles and probability questions from books like 50 Challenging Problems and Heard on the Street etc.",
        "content": "FORESIGHT(2023): Summer Internship at Qualcomm | Shrey Thakkar |\n\n--\n\nListen\n\n1) Brief Introduction\n\nMy name is Shrey Thakkar and I’m a 4th year dual degree student in the department of Electronics and Electrical Communication.\n\n2) How did you get into Qualcomm? What was the selection procedure?\n\nQualcomm came on day-3 of CDC internship drive. The selection procedure was very straightforward. A test followed by a couple of interview rounds. The test contained 2 sections, aptitude and profile-specific. I applied for the Machine Learning profile. Aptitude section was not very difficult. In the Machine Learning section, there were some C/C++ questions and ML-DL algorithm based questions. There were two interview rounds: Technical and HR. Technical round was mostly CV based. There were some basic DSA questions and puzzles too.\n\n3) How to prepare for them?\n\nTo prepare for this profile in Qualcomm, one must be thorough with the basics: Data Structures and Algorithms and Machine Learning algorithms. Prob-stats usually help in any Data oriented profile and it is a must if you’re targeting it. Solve standard puzzles and probability questions from books like 50 Challenging Problems and Heard on the Street etc. For ML-DL, Andrew NG courses are mostly sufficient. It’s important to have a few good projects in ML as most of the questions in your interview are from your CV.\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nI had some difficulties in my technical interview. The interviewer started asking me some difficult CP level questions which I was not very comfortable with. I gently told him that my knowledge in DSA was limited and my core interest was in deep learning. So he started grilling me on ML/DL and python coding. I was able to answer most of the questions there. It’s a good practice to be honest with the interviewer rather than wasting his time.\n\n5) According to you, who should ideally apply for this job?\n\nThough this role says Machine Learning intern, the work is mostly on the inference and development side. It’s an ideal role for someone with interest in different ML frameworks like PyTorch, Tensorflow etc.\n\n6) Any specific advice you want to give to the junta sitting for internships this year.\n\nOne of the most important advice for people sitting in CDC: Be honest with your interviewer, try to interact. If you have doubts or confusions, ask. You’re not expected to have all the knowledge. You should show your ability to learn anything very quickly."
    },
    {
        "job_role": "Data",
        "company_name": "American Express",
        "info": "Good knowledge of conditional probability, distributions, and expectations was required for ML interviews and tests. The Brainsteller website offers a curated collection of questions and puzzles",
        "content": "FORESIGHT(2023): Summer Internship at American Express | Omkar Modi |\n\n--\n\nListen\n\nBrief Introduction\n\nHello everyone, embarking on my journey towards securing an internship at Amex (American Express) was a defining moment in my career. In this blog post, I will share my experience, detailing the selection procedure, preparation strategies, and overcoming challenges. Additionally, I will provide valuable advice for aspiring interns and highlight key points to consider while targeting this prestigious company.\n\nI am Omkar Modi, a 4th-year dual degree student from the Department of Electrical Engineering at IIT Kharagpur, with a current CGPA of 9.19 at the end of my 8th semester. I have delved into the fascinating world of machine learning and data science, exploring many opportunities. From engaging in research projects and implementing ML and Statistical models during corporate internships to participating in Data Science hackathons, I have been fortunate to gain invaluable experiences that have significantly enhanced my skills. Throughout this journey, I have come to understand the vital importance of balancing both knowledge and experience, recognizing that they are inseparable components for success, especially in the realm of Machine Learning enthusiasts like myself.\n\nHow did you get into Amex? What was the selection procedure?\n\nThe journey of securing an internship at Amex was both challenging and rewarding. The selection procedure comprised a test round followed by an interview round, which allowed me to showcase my skills and qualifications. Let’s delve into the details of the selection procedure that led to my successful internship at Amex.\n\nThe application process began with a test round consisting of three sections: Quant, Machine Learning, and Business Case Study. The Quant section was compulsory, and I had the option to choose between the Machine Learning and Business Case Study questions. The Quant section, with its 20 aptitude questions, presented challenges involving puzzles and data inference based on pie charts and other plots. It required me to think critically and apply my quantitative skills effectively. Despite the difficulty, I managed to complete all the questions within the given time frame of 30 minutes. The Machine Learning and Case Study sections, on the other hand, were relatively easier. The Business Case Study was particularly intriguing, with a pool of about 130 unlockable questions covering various aspects of business such as marketing and financing. Selecting the right set of questions to answer a specific business question required a thorough understanding of the subject matter.\n\nUpon successfully clearing the test round, I advanced to the interview round. The first round of the interview involved a discussion with a senior manager from the marketing team, boasting 7–8 years of experience. During this round, the interviewer extensively examined my CV and asked questions based on its content. The questions assessed my knowledge, skills, and compatibility with Amex’s values and objectives. I was also asked to articulate my motivation for wanting to join Amex. The interviewer’s friendly demeanor created a comfortable environment for the conversation. It’s worth mentioning that some of my friends who went through the interview process were presented with puzzles to solve during this round.\n\nFortunately, after successfully navigating the selection process, I received the news that I had secured the internship at Amex. Looking back, I attribute my success to being confident and well-prepared during the interview rounds. Attending the Amex presentation helped me gain a deeper understanding of the company, enabling me to answer questions more effectively.\n\nFor anyone aspiring to join Amex, my advice is to approach the interview rounds with confidence and be well-prepared. Take advantage of attending pre placement Amex presentations or gather information about the company beforehand. Understanding Amex’s business model and demonstrating a genuine motivation to contribute to the company’s success can significantly enhance your chances of securing an internship.\n\nHow to prepare for them?\n\nPreparing for an internship at Amex requires a focused and comprehensive approach. To excel in the selection process and increase your chances of securing the internship, consider the following strategies:\n\n1. Showcase Projects and Internships:\n\nProjects and internships play a significant role in the CV shortlisting process and form the basis for interview questions. Make sure to highlight relevant projects and internships on your CV, emphasizing the skills and experiences gained from them. Be prepared to discuss the results, challenges faced, and lessons learned during these endeavors. By showcasing your practical experiences, you demonstrate your ability to apply theoretical knowledge to real-world scenarios.\n\n2. Quantitative Aptitude and Probability Practice:\n\nTo excel in the quantitative aptitude section of the test round, regular practice is essential. Dedicate time to develop a strong understanding of probability and statistics, as these concepts are often tested. I gathered notes from my probability and statistics class and also concise notes from Stats110. Good knowledge of conditional probability, distributions, and expectations was required for ML interviews and tests. The Brainsteller website offers a curated collection of questions and puzzles in probability and related fields. Regularly practice solving problems from this platform to sharpen your quantitative aptitude, improve problem-solving skills, and deepen your understanding of probability concepts. Additionally, consider resources such as “50 Challenging Problems in Probability” by Frederick Mosteller for more challenging problem-solving practice.\n\n3. Master Machine Learning Concepts:\n\nProficiency in machine learning is highly valuable in today’s data-driven world. Take the initiative to deepen your understanding of machine learning concepts, as it may be relevant to the internship position at Amex. Completing Andrew Ng’s Machine Learning course is an excellent starting point for gaining foundational knowledge in the field. For studying statistical concepts I took help from the ML playlist by Krish Naik. Additionally, read blogs and articles on machine learning topics from reputable platforms such as Analytics Vidhya, Medium, and Towards Data Science. These resources provide insights, real-world applications, and the intuition behind ML algorithms, further enhancing your expertise.\n\n4. Strengthen Quantitative and Reasoning Abilities:\n\nDeveloping strong quantitative and reasoning abilities is crucial for success in finance-related roles. To enhance these skills, consider studying chapters 1 and 4 of “Heard on the Street” by Timothy Falcon Crack. These chapters cover probability and statistics topics and provide valuable practice questions and explanations. By working through these materials, you can improve your quantitative aptitude, reasoning abilities, and problem-solving techniques.\n\n5. Practice Data Interpretation and Inference:\n\nIn addition to probability, the ability to interpret data and make informed inferences is vital. Practice analyzing and drawing conclusions from charts, graphs, and other forms of data representation. This skill will come in handy during the test round and interview rounds, where you may encounter data-related questions. Strengthening your data interpretation skills will allow you to showcase your analytical abilities and make evidence-based decisions.\n\n6. Stay Updated and Engaged:\n\nKeep yourself informed about the latest industry trends, especially in the finance and technology sectors. Stay updated on advancements in data analytics, financial modeling, and relevant technologies. Engage in online forums, attend webinars, and participate in relevant communities to stay connected with professionals and gain insights into the industry. By staying actively engaged, you demonstrate your enthusiasm for the field and your commitment to ongoing learning and growth.\n\nRemember, preparation is key to success. Prioritize showcasing your projects and internships, practicing quantitative aptitude and probability, mastering machine learning concepts, and strengthening your quantitative and reasoning abilities. With a focused and comprehensive preparation strategy, you can position yourself as a strong candidate and increase your chances of securing an internship at Amex. Good luck!\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nWhile preparing for the Amex internship, I encountered a few challenges along the way. However, with perseverance and the right strategies, I was able to overcome these difficulties. Here are some of the challenges I faced and the steps I took to overcome them:\n\n1. Rigorous Selection Process:\n\nThe selection process at Amex is known for its rigor, which initially felt overwhelming. The competitive nature of the test round and the intense interviews posed a significant challenge. To overcome this, I focused on building a strong foundation of knowledge and skills in the relevant areas. I dedicated ample time to studying quantitative aptitude, probability, and machine learning concepts. Regular practice and solving a variety of problems helped me gain confidence and improved my problem-solving abilities.\n\n2. Managing Resources and Avoiding Confusion:\n\nI know by now you would have received a wealth of fundae from seniors and batchmates, causing confusion about what to prioritize. To overcome this, I strategically evaluated my strengths, researched the requirements of the Amex selection process, and created a personalized plan. I balanced coding skills, probabilities, and data analysis, integrating multiple resources. Regular self-assessment and adjustments ensured efficient use of time and increased confidence for the Amex challenges.\n\nThe interview rounds, particularly the intense CV grilling and the technical data problem statement, brought forth a new level of pressure. I felt the need to perform exceptionally well and effectively communicate my skills and experiences. To overcome this, I engaged in mock interviews with peers and sought feedback on my performance. I also conducted thorough research on Amex’s business model, products, and services to confidently answer questions about the company. Practicing positive visualization, helped me remain calm and composed during the actual interviews.\n\n4. Staying Motivated:\n\nThe preparation process for such a highly sought-after internship can be demanding and prolonged, which can sometimes lead to a dip in motivation. To overcome this challenge, I set clear goals and reminded myself of the long-term benefits and the valuable learning opportunities the internship at Amex would provide. Seeking support from family, friends, and mentors also played a crucial role in keeping me motivated and focused on my preparations.\n\nAccording to you, who should ideally apply for this job?\n\nIn my opinion, individuals with a strong foundation in quantitative aptitude, data analysis, and problem-solving skills are ideally suited for the Amex internship. Candidates who have a passion for finance, technology, and data-driven decision-making will find the internship particularly rewarding. The ability to effectively communicate complex ideas, work well in teams, and demonstrate a drive for continuous learning and growth are also valued qualities at Amex.\n\nWhat are some of the major points you think would be valid to mention in your CV while targeting this profile?\n\nAs someone who has gone through the CDC process and experienced the pressure and uncertainty, I would like to offer some specific advice to candidates sitting for internships this year:\n\n1. Stay Calm and Confident: The CDC process can be overwhelming, and it’s natural to feel anxious before interviews. However, it’s crucial to remain calm and have confidence in your abilities. Keeping a calm mindset allows the interview process to flow smoothly, and self-confidence gives you the strength to perform at your best. Remember to trust in your preparation and believe in yourself.\n\n2. Don’t Doubt Your Capabilities: If you don’t get selected for a Day 1 or Week 1 internship, it does not define your skills or capabilities. The CDC process involves an element of luck, and there are numerous opportunities beyond the initial rounds. Keep in mind that every opportunity is a chance to showcase your potential, so give your best shot each time. Your dedication and effort matter more than the timing of the internship.\n\n3. Embrace the Learning Experience: Approach the internship search as an opportunity to learn and grow. Every interview, even if it doesn’t result in an offer, provides valuable experience and feedback. Take note of areas for improvement and continue to develop your skills. The process itself is a valuable learning journey that can shape your future career path.\n\n4. Network and Seek Guidance: Engage with your seniors, mentors, and professionals in the industry. Seek advice, guidance, and insights from those who have been through similar experiences. Networking can provide valuable information about companies, interview strategies, and the industry as a whole. Don’t hesitate to reach out to individuals who can offer support and share their knowledge.\n\n5. Persistence and Resilience: The internship search can be challenging, and setbacks may occur. However, it’s important to remain persistent and resilient. Stay motivated and keep pushing forward, even in the face of rejections or delays. Your determination and ability to bounce back from setbacks will demonstrate your strength of character and resilience.\n\nRemember, the CDC process is just one part of your journey. It does not define your worth or potential. Focus on continuous improvement, maintain a positive mindset, and seize each opportunity with enthusiasm. Your hard work and dedication will ultimately lead you to the right internship opportunity and contribute to your personal and professional growth."
    },
    {
        "job_role": "Data",
        "company_name": "JP Morgan Chase & Co.",
        "info": "For aptitude and quant section,brush up on Probability and Statistics courses, CAT questions, JEE level math. Basically, solving fast and accurately in a time-constraint is required.",
        "content": "FORESIGHT(2023): Summer Internship at JP Morgan Chase & Co. | Akansha Agarwal |\n\n--\n\n2\n\nListen\n\n1) Brief Introduction\n\nMy name is Akansha Agarwal. I am a final year undergraduate student enrolled in the B.Tech course of Manufacturing Science and Engineering. I will be interning with JP Morgan Chase & Co. — CIB Research and Analytics.\n\n2) How did you get into JP Morgan Chase Co.? What was the selection procedure?\n\nI applied for this role through ERP,IIT Kharagpur during the CDC Internship drive.The role was open for all the departments. The selection procedure was as follows:\n\nScreening Test\n\nThe online test consisted of 3 different sections — one of aptitude test,quant questions & probability statistics, the other had questions related to finance(factual and theoretical) and the last one was a coding section (2–3 coding questions of medium level). Interview:\n\nThe interview had several technical rounds and one HR round. I was asked a few puzzles and a few theoretical and numericals on probability statistics. They asked concepts of DSA ,OOPS (mostly implementation on python). This role required some understanding of finance as well and I was questioned on fundamentals of economics and finance. Moreover,I was also grilled on ML concepts and data science projects on my CV. The HR questions were pretty standard.\n\n3) How to prepare for them?\n\nFor aptitude and quant section,brush up on Probability and Statistics courses, CAT questions, JEE level math. Basically, solving fast and accurately in a time-constraint is required.I would suggest going through puzzles and guesstimates(I did some on interviewbit and brainstellar), get some basic knowledge on the domain of finance (online resources), practice DSA and be thorough with ML algorithms & concepts. If you have mentioned any projects or internships on your CV, have a good understanding of them.\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem\n\nI would like to discuss the problems that I faced in general during the CDC Internship. Firstly, finding the right profile and right resources posed difficulties. Moreover, I started preparing quite late and was not able to complete DSA which requires a lot of practice. One thing which I realized at the time I was looking for an\n\ninternship was, that even if you are preparing for non-SDE roles still you should have some grip over DSA and other CSE topics. And lastly, CDC is a truly strenuous process.\n\nTo overcome the problems I faced, I would suggest exploring different profiles and collecting different materials early(profile wise resources are available) .\n\n5) According to you, who should ideally apply for this job?\n\nAnyone interested in machine learning, mathematics, data analytics and have some interest in finance should apply for this job.\n\n6) Any specific advice you want to give to the junta sitting for internships this year.\n\nI would advise everyone to not get frustrated and keep trying. It will be helpful if you have few friends to discuss during preparation. Take good advantage of the summer break to prepare yourself better. Get your CV verified (preferably from seniors and batchmates). Also,one thing that helped me the most in the interview was talking to a senior who had interned previously in the same profile and understanding the job description a bit. This gave me an idea of the kind and level of questions asked for this profile.\n\n7) What are some of the major points you think would be valid to mention in your CV while targeting this profile?(any specific suggestions you would like to make?\n\nI am not quite sure of the exact shortlisting criteria. However, including ML projects will be relevant. If you have done any courses on finance that would be an added advantage as well."
    },
    {
        "job_role": "Data",
        "company_name": "Adobe",
        "info": "It will be preferred to have at least one good project/internship on your CV for a better understanding of the domain and also it’ll help as a starter for discussion during the interview. If you have time I’ll suggest looking into NLP or Computer Vision domain.",
        "content": "FORESIGHT(2023): Summer Internship at Adobe| Shaurabh Tiwari|\n\n--\n\nListen\n\nIntroduction:\n\nHello everyone, I am Shaurabh Tiwari. I am a fourth-year student, pursuing a Dual Degree course in the Department of Mechanical Engineering with specialization in Manufacturing Science and Engineering. In the 2022 CDC Internship Drive, I got a Research Internship offer from Adobe Research for a duration of 12 weeks.\n\nHow did you get into Adobe? What was the selection procedure?\n\nThe selection procedure started with a written test followed by the Interview. The written test consisted of questions from Probability and Statistics, Basic OOPs, DBMS, some general Aptitude questions, and two Medium Level programming questions (Difficulty Level: 1300 to 1700) related to Data Structures and Algorithms.\n\nThere was one Interview round for the students who cleared the written round. In my case, the Interview started with the CV Discussion, In which I explained the projects mentioned in the CV. While discussing the projects the interviewer did ask some questions related to basic ML, DL, and basic mathematics behind them. After that, we had a 15-minute discussion on a research paper, which I had read in the past. The interview ended with some basic HR questions to test your teamwork skills.\n\nHow to prepare for them?\n\nYou need to have a good grasp of Machine Learning and Deep Learning, and for that, Coursera ML and DL specializations can be a good starter, also blogs at Towards Data Science will be good for those who prefer reading over watching videos. It will be preferred to have at least one good project/internship on your CV for a better understanding of the domain and also it’ll help as a starter for discussion during the interview. If you have time I’ll suggest looking into NLP or Computer Vision domain.\n\nFor the written round a good grasp of competitive programming will be required for that try solving problems on any competitive programming platform like Leetcode, Codeforces, Codechef, etc. Also, good knowledge of Probability and Statistics will be required, for this solving Heard on the Street or 50 Challenging Problems will be more than enough. Try to have some basic knowledge of OOPs.\n\nWhat difficulties did you face while preparing for this Profile? How did you overcome this problem?\n\nThe major issue here is you need to have knowledge of many different domains. To clear the written round a good knowledge of Data Structures Algorithms will be needed along with Probability and Statistics. For interviews, knowledge of Machine Learning and Deep Learning Algorithms will be required. Also, you need to have some good projects in this domain for your CV to stand out among the other candidates. Keeping a hand on all these things at once is very tough but not impossible. The strategy which worked for me is to divide the duration for each task and prepare for one task at a time while keeping a fixed revision schedule for the things which I’ve already learned. In this way, things will not feel like a burden. Try to participate regularly in competitive programming contests on any platform.\n\nAccording to you, who should ideally apply for this job?\n\nFor anyone who likes brainstorming to find new and unresearched problems in the world and wants to explore the difference between academic and industrial research fields, this is an ideal opportunity for him. Also If you like working with the newest technologies and have a hunger for exploring the latest inventions and technology advancements, then you should apply for this.\n\nAny specific advice you want to give to the junta sitting for internships this year?\n\nPreparing for internships can be a stressful and competitive process, but it’s important to keep a few things in mind. Firstly, remember that an internship is just a small part of your long and promising career ahead. Even if you don’t secure your desired position, it doesn’t define your capabilities or future success. Secondly, surround yourself with a supportive friend circle who can help you practice and conduct mock interviews. Their feedback and encouragement can be invaluable during this time. Additionally, luck can play a role in the selection process, so don’t be disheartened if things don’t go your way initially. Remember, there’s no single right path to success, and each person’s journey is unique. Be resilient, stay focused, and prioritize your happiness. Don’t let the preparedness or success of others affect your self-confidence. Trust in your abilities, give your best, and success will come your way.\n\nWhat are some of the major points you think would be valid to mention in your CV while targeting this profile? (any specific suggestions you would like to make?)\n\nCV is an essential document that highlights your skills, experiences, and accomplishments. Here are some points which I think will help your cv to stand out:"
    },
    {
        "job_role": "Data",
        "company_name": "Adobe",
        "info": "I would suggest to start practising DSA questions as early as possible, for practise you can use LeetCode or GeeeksforGeeks, and you should try to participate in contests regularly and upsolve, as this would really help you to solve questions in a timed environment, in the last one month to get the idea about interview questions you can practise questions on InterviewBit.",
        "content": "FORESIGHT(2023): Summer Internship at Adobe| Divyansh Raghuwanshi|\n\n--\n\nListen\n\nIntroduction:\n\nI am Divyansh Raghuwanshi, a 3rd-year undergraduate student from the Department of Electronics and Electrical Communication Engineering at IIT Kharagpur. In the 2022 CDC Internship Drive I received a Research Internship offer from Adobe Research.\n\nHow did you get into Adobe? What was the selection procedure?\n\nThe selection process for Adobe Research consisted of one online test and one round of interview:\n\nOnline Test:\n\nThe online test was held on HackerRank and was around one and a half hours long. It was divided into five sections: the first four were MCQ-based and contained a total of 16 MCQs, including four each from Linear Algebra, Probability and Statistics, Computer Science Fundamentals, and Puzzles, the final section contained two coding questions (which were of an easy to medium difficulty). You needed to solve both coding questions correctly and perform well in MCQs in order to get through.\n\nInterview Round:\n\nThere was only one round of interview, which was around 45 minutes long. I was given a puzzle to solve at the beginning, followed by a probability question, and lastly one DSA question related to Multi-Source BFS was asked. You can expect questions from Data Structures and Algorithms, Linear Algebra, Probability and Statistics. Later on, the interview mainly revolved around my resume, there was a discussion about the projects mentioned in the resume, after this the interview concluded.\n\nHow to prepare for them?\n\nFor Coding Test Round:\n\nI would suggest to start practising DSA questions as early as possible, for practise you can use LeetCode or GeeeksforGeeks, and you should try to participate in contests regularly and upsolve, as this would really help you to solve questions in a timed environment, in the last one month to get the idea about interview questions you can practise questions on InterviewBit.\n\nPuzzles and probability problems were not very difficult, these can be prepared from GeeksforGeeks. Fifty Challenging Problems in Probability is another resource you can use to get a better understanding of the majority of probability problems. I didn’t prepared much for CS fundamentals like OOPS, OS, DBMS, I just went through some of the blogs for these topics, though I would suggest you to prepare well for OOPS as it is being asked in many companies online test round and interviews as well.\n\nFor Interview Round:\n\nDuring the interview, try to be calm and composed and answer the questions honestly and confidently. Also, prepare a nice introduction beforehand to start well. You should try to find the most frequently asked interview questions before sitting for any company’s interview, this will give you a decent idea of the questions you will be asked and will allow you to prepare for them appropriately. You should be very well prepared about all the points, especially the projects you put in your resume. It’s better to avoid putting the things you are less confident about, as there may be cross-questions about anything they find interesting.\n\nHaving good technical projects is always desirable, as it boosts your chances. A good project related to NLP or Computer Vision would enhance your resume considerably for this profile, as most of the projects in Adobe Research are related to these fields. Most of the times, at the end of the interview, the interviewer might ask if you have any questions for him/her. So I would suggest to prepare some questions for the interviewer based on the company, as it would show your interest towards the company and that particular profile.\n\nWhat difficulties did you face while preparing for this Profile? How did you overcome this problem?\n\nAs I was preparing for both Software and Data profile, so there were too many things to prepare. To overcome this, I asked for advice from some of my friends and seniors which really helped me strategically plan my preparation, and working on it consistently throughout the summers helped me prepare well for the Internship process. I would advise, whenever you are having some difficulty regarding the preparation try to talk to your seniors or your batchmates who are also aiming for the same profile this will really help you overcome that problem.\n\nAccording to you, who should ideally apply for this job?\n\nAnyone who has a keen interest in the field of NLP or Computer Vision, and wants to innovate something in this field should apply for this internship.\n\nAny specific advice you want to give to the junta sitting for internships this year?\n\nIf you are preparing for Data profile don’t neglect DSA part, as even for Data profile most companies ask a good level of DSA questions in both online test round and interviews. For the interviews it is very important that while thinking about the problem’s solution you think out loud, try to have a good discussion with the interviewer as it would help you to think in the correct direction.\n\nAll the best, Everyone!\n\nWhat are some of the major points you think would be valid to mention in your CV while targeting this profile? (any specific suggestions you would like to make?)\n\nFor this profile the most important part of the CV is the Projects and Internships section. Try to present your projects very well, as having a 1–2 nice projects related to the profile will definitely increase your chances of selection.\n\nAs you would be asked many questions related to your projects, prepare well for whatever you write in your CV."
    },
    {
        "job_role": "Data",
        "company_name": "Amex",
        "info": "To prepare for Probability and Statistics, “50 Challenging Problems in Probability” and “Heard on the Street” are great books. You can practice for the aptitude section from Brainstellar.",
        "content": "FORESIGHT(2023): Summer Internship at Amex| Sagar Kumar Karn|\n\n--\n\nListen\n\n1) Brief Introduction\n\nI’m Sagar Kumar Karn, a final-year undergraduate student of Economics at IIT Kharagpur. I am currently working at American Express as an Analyst Intern. I am a boarder of Patel Hall of Residence.\n\n2) How did you get into Amex? What was the selection procedure?\n\nI started exploring Data Science in my second year and became quite interested in this field. I pursued two research internships in this domain in my third year. One of them was at the Insitute of Technology and Business, Czech Republic, and another at the Centre for Analytical Finance. These internships helped me to gain a further understanding of this field.\n\nNow coming to the selection procedure, the test comprised of three sections namely Aptitude, Machine Learning, and Case Study. The first section had 20 MCQ questions on aptitude and basic Prob stats and had to be solved in 40 minutes. The questions were of CAT level and included puzzles, probability and statistics, etc.\n\nThe second section had 10 questions on ML and had to be done in 20 minutes. To get through this section you need to have a clear understanding of various ML algorithms and models. The questions were centered around Decision Trees, XGBoost, black box models, k nearest neighbors, etc.\n\nThe third section is a case study section where you are given a case and you are required to give an answer to a question. To arrive at the answer you have 50 questions at your disposal and you can unlock at max 25 of them. The fewer questions you unlock to get to the correct answer, the better your score is. You can attempt either or both of the second and third sections. The best of the two is taken into account. The first section is compulsory.\n\nNow coming to the interview, there were two interview rounds. The first round was mostly based on my knowledge of machine learning and deep learning. One of the questions in the first round was on how I was asked about how XGBoost works and what is boosting. The second round basically revolved around my resume and my previous internships and projects. The interviewer asked me to explain one of my projects and then after I was done, asked various cross questions on the same. It is therefore important to be thorough with the internships and projects that you mention in your resume because they can easily see through if have just written it but you don’t have a basic understanding of the project.\n\n3) How to prepare for them?\n\nTo prepare for Probability and Statistics, “50 Challenging Problems in Probability” and “Heard on the Street” are great books. You can practice for the aptitude section from Brainstellar.\n\nFor machine learning and deep learning, it is important to have a basic understanding of different algorithms and models. One of the best resources to start off with Machine Learning is the course by Andrew NG for machine learning. For deep learning, Deep Learning Specialization on Coursera is a good resource. Other than that Stanford University courses such as CS230(Deep Learning), CS231n(Computer Vision), CS224n(Natural Language Processing), etc are also great courses to follow.\n\nOnce you are done with the theory do some self-projects to test your understanding and practical implementation of what you have learned.\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nOne of the basic difficulties I faced was that I did not take enough time to revise all the stuff before the interviews. I was preparing for both SDE roles and Analytics roles and had devoted more time to DSA, so had quite less time to revise Data Science topics. My advice to people prepping for both profiles is to keep enough time for the revision of these topics.\n\n5) According to you, who should ideally apply for this job?\n\nIf you have an interest in Data Science and want to work on real-life problems involving data science in the credit card industry then this is one of the best places to work. Work that you do here would actually add value to the company. The work here is more on the implementation and analytical side so folks who are really interested in the implementation of ML algorithms should definitely go for it.\n\n6) Any specific advice you want to give to the junta sitting for internships this year?\n\nMy advice to my juniors would be to decide the roles that they prepare for according to their interests. Instead of following the rat race develop your skill set in the particular field you actually like and want to work on. Don’t just get into coding if you don’t actually like coding. Explore various fields and decide according.\n\nAnother piece of advice I want to give is to remain positive and confident throughout the process. It is a cruel process, a bit dependent of luck and a lot of other factors that you cannot control. But always remember CDC internship is just a way for you to get an internship. It is certainly not the end of the world. There are ample opportunities out there. If you are not getting an internship through CDC then you shouldn’t feel disheartened. Keep working hard and expanding your skill set. Keep looking out for off-campus internships and competitions.\n\nLastly, I would reiterate that you should decide whether you “want to get an intern” or you “want to get an intern in a field that you are interested in”. Depending on what is your answer prepare accordingly. If you want to prepare for more than one profile then prioritize accordingly and manage time effectively. Also, be confident during the interviews, and if you don’t know the answer to any question just politely say that you don’t know instead of meandering here and there and wasting time. Be honest in the interview and don’t mention something in your CV that you haven’t actually done.\n\n7) What are some of the major points you think would be valid to mention in your CV while targeting this profile? (any specific suggestions you would like to make?)\n\nWhen preparing for interviews in Data Analytics, do include one or two projects in this domain. In interviews for Data profiles, your CV plays quite an important role. Having projects in ML or DL would surely be a plus point on your CV and you would be able to drive your interview around the projects you have done. Also when mentioning an intern or a self project in your CV, the impact created (if any) and the improvement from a previous approach(if any) should be written."
    },
    {
        "job_role": "Data",
        "company_name": "Amex",
        "info": "For ML part after learning the concepts you can go through various online resources like InterviewBit to practice ML questions.",
        "content": "FORESIGHT(2023): Summer Internship at Amex| Sneha Kharya|\n\n--\n\nListen\n\n1) Brief Introduction\n\nHello, My name is Sneha Kharya. I am a fourth year undergraduate student from the Department of Humanities and Social Sciences enrolled in its integrated Masters of Science course of Economics. I am from Jabalpur, Madhya Pradesh. I got selected in American Express through the CDC internship drive. Previously, I had worked as an Analytics Intern at Godrej Capital Limited Mumbai, and as Research Intern at the University of Newcastle. Apart from academics, I have held the POR of Head of Finance at Quant Club, IIT Kharagpur and General Secretary Sports at Sister Nivedita Hall of Residence.\n\n2) How did you get into Amex? What was the selection procedure?\n\nThe selection procedure consists of three steps: an online test, a technical interview, and another interview with both technical and HR questions.\n\n3) How to prepare for them?\n\nIt is essential that you are thorough with Prob Stats and have a habit of solving puzzles. I had solved Heard on the Street and 50 challenging problems on Probability to prepare for the puzzles and had gone through the Prob Stats course that I had as my depth in second year.\n\nFor ML part after learning the concepts you can go through various online resources like InterviewBit to practice ML questions.\n\nApart from that you should be thorough with your CV and know every project in detail. For the HR interview, do go through the culture of AMEX and the different credit card offerings they provide.\n\n4) According to you, who should ideally apply for this job?\n\nAnyone with interest in analytics can apply. Interest in finance is a plus.\n\n5) Any specific advice you want to give to the junta sitting for internships this year.\n\nBe consistent with your prep and plan your day beforehand. If you are preparing for multiple profiles and are confused between a few profiles try to find the profile you are better and focus more on that. It always helps if you are preparing with your friends as it keeps you motivated and you can help each other in case of doubts. Do take fundae from seniors who have prepared for similar profiles. Maintain a healthy routine, spend some time for recreation and do keep check on your friends as well. The CDC process can be challenging and demotivating, but ensure that you prepare diligently and give it your all. Even if you don’t succeed in the CDC, there are numerous off-campus opportunities that may be even more promising. Machake Junta!\n\n6) What are some of the major points you think would be valid to mention in your CV while targeting this profile?(any specific suggestions you would like to make?)\n\nMajor points to mention in your CV:"
    },
    {
        "job_role": "Data",
        "company_name": "Piramal",
        "info": "For the Logical Reasoning & Quantitative Aptitude part, I suggest solving CAT questions and using the website Brainstellar for puzzles(Easy & Moderate puzzles, Strategy & Probability puzzles).",
        "content": "FORESIGHT(2023): Summer Internship at Piramal| Sai Kalyan Meghavath|\n\n--\n\nListen\n\n1) Brief Introduction\n\nHello Everyone, I’m Sai Kalyan Meghavath, a 3rd-year undergraduate student of the Department of Electronics and Electrical Communications Engineering enrolled in its Bachelor of Technology Course. My core interests lie in Business Strategy, Data Analytics, Venture Capital, and Product Management, and I have gained experience in these fields through various internships. Previously, I have held the PORs of the Web & Design Head at the Business Club and the Outreach Head at Developers’ Society.\n\n2) How did you get into Piramal? What was the selection procedure?\n\nI have secured an internship in the Business Intelligence unit of Piramal Capital Housing & Finance(also known as Piramal Finance, is a wholly owned subsidiary of Piramal Enterprises Limited) through the On-Campus internship drive organized by the Career Development Centre(CDC), IIT Kharagpur.\n\nThis role is suitable for those interested in the Data profile and looking for a corporate experience that encompasses the applications of Data Science in financial services businesses. This role is open to all departments, with a few exceptions of the degree duration (4Yr/5Yr) in specific courses.\n\nThe selection procedure is as follows:-\n\n3) How to prepare for them?\n\nThis answer would solely apply to this company, as Piramal had different selection criteria than other Data Companies in CDC.\n\nTo quote my case, I had a Foreign Training Internship in Time Series & Machine learning domain, which I had secured through IR Cell. I had three more self-projects(Fake News Classifier, Stock Price Prediction, and Portfolio Optimization).\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem\n\nThese were the problems I faced mainly.\n\n5) According to you, who should ideally apply for this job?\n\n6) Any specific advice you want to give to the junta sitting for internships this year?\n\n7) What are some of the major points you think would be valid to mention in your CV while targeting this profile?(any specific suggestions you would like to make?)\n\nIf you would like to talk to me more about this, feel free to reach out to me on my social handles\n\nLinkedIn:- https://www.linkedin.com/in/sai-kalyan-meghavath-7a26551ba/\n\nFacebook:- https://www.facebook.com/NastyMaverick\n\nBest of Luck :)!"
    },
    {
        "job_role": "Data",
        "company_name": "AWL",
        "info": "You should have a few internships or projects or competitions on your CV showcasing that you have some previous experience in ML.",
        "content": "FORESIGHT(2023): Summer Internship at AWL | Shubham Kulkarni |\n\n--\n\nListen\n\n1 : Brief Introduction\n\nHello everyone, My name is Shubham Kulkarni and I am a third year undergraduate student in the department of Electronics and Electrical Communication Engineering enrolled in its BTech course.\n\nI am interning as an AI engineer at AWL, Inc. this summer of 2023, which I received via CDC internships 2022–23.\n\n2 : How did you get into AWL ? What was the selection procedure?\n\nAWL visited our campus on day 3 and there were a total of 2 rounds.\n\nThe test was two hours long and had quite a few sections covering questions across various domains such as probability and statistics, aptitude and machine learning. Along with these there were 4 programming questions of intermediate level based mostly on topics like graphs and dynamic programming.\n\n2. Interview Round -\n\n3 : How to prepare for them?\n\nFrom my experience, your CV is rather important for this profile. You should have a few internships or projects or competitions on your CV showcasing that you have some previous experience in ML. If you don’t have any internships or projects, you can opt for some good self-projects or some competitions such as on kaggle or other platforms. Competitions such as General Championship, OpenIIT or some other inter-college competition will also work.\n\nYou also need to do DSA and practice competitive programming as almost all of the companies for data/ML profile ask coding questions in their test rounds. A lot of students opt for the Algozenith course which is pretty good. But I personally did it by watching different YouTube videos and reading articles such as on GFG. For practicing your coding skills Inteviewbit is a good platform.\n\nFor the ML concepts, if you are just starting with ML you can do a few good courses on Coursera and Udemy. Some recommendations will be the Andrew NG ML and DL courses on coursera and ML A-Z course on Udemy. However, it will be much more effective if you do some projects using different ML algorithms. This will give you a better understanding of the algorithms and preprocessing methods (and another point for your CV). You should be aware of the mathematics behind the most common ML algorithms, as a company will be more interested in your understanding rather than your ability to copy paste a code. A YouTube channel named Statquest will be quite helpful for this. You should also have a good grasp of linear algebra for everything to make sense.\n\nProbability and Statistics and puzzles is another important part of the process. For Probability and Statistics, one can refer to the lectures of the MA20205 course provided by the Mathematics department (Khare sir specifically) or the Stats110 playlist. For practice one can refer to the books ’50 challenging problems in probability’ and ‘Heard on the street’. You can practice puzzles on GFG puzzles or brainstellar.\n\nApart from all of these technical skills you should have good communication skills and confidence for your interview rounds.\n\n4 : What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem\n\nDuring my CDC preparation I wanted to get an intern in a Data/ML role and didn’t bother much about SDE. As a result, I didn’t focus much on competitive programming and studied mostly ML, DL and mathematics. This foolishness cost me as I couldn’t clear test rounds for some of the good data companies on day 1 and 2. To overcome this I simply practiced more and more CP even after the CDC process had started. So definitely learn from my mistake and do not ignore CP for this profile. The coding questions asked in the tests might not be as difficult as for a software company but you should have a good grasp on complete DSA.\n\n5 : According to you, who should ideally apply for this job?\n\nAnyone who is interested in Machine Learning, Deep Learning, Computer Vision or software and wants to work under a friendly environment should definitely apply here. Other than that, anyone who wants a chance to work in Japan should apply :)\n\n6 : Any specific advice you want to give to the junta sitting for internships this year\n\n7 : What are some of the major points you think would be valid to mention in your CV while targeting this profile? (any specific suggestions you would like to make?)\n\nHave multiple internships, projects, or competitions you have done in this field mentioned in your CV. These projects will help you steer the interview to your advantage. The interviewers also look at your technical skills so be sure to mention them. e.g., pytorch, keras, tensorflow, sklearn, etc.\n\nAll the best everyone. Machake!!"
    },
    {
        "job_role": "Data",
        "company_name": "American Express",
        "info": "As the name 'Amex Strategy' suggests, they offer strategy consultant role, which involves working with a great team of analysts and managers",
        "content": "FORESIGHT(2021): Summer Internship at American Express | Rishi Jain\n\n--\n\nListen\n\nBrief Introduction\n\nHello to everyone reading this. I am Rishi Jain, a final year undergrad from the Industrial Engineering dept, pursuing its B.tech course. I did my summer internship at American Express as an analyst in the SPG, which basically is an in-house strategy consulting team, part of the global AmEx strategy team.\n\nSelection Procedure\n\nAmEx generally comes on day1 for its intern as well as placement selections.\n\nFor the intern selection procedure, there happens to be an online test, followed by 2 rounds of interviews after shortlisting based on the test scores and CV screening.\n\nOnline Test\n\nThe test comprises 3 sections\n\nThe aptitude ques are of medium difficulty, but given a short time, it’s a challenging exercise to solve even 15+ ques if you are not in practice.\n\nThen comes the ML section — 10 basic questions in 10–15 mins; I will just keep it short, stating them as “fairly simple”\n\nThe last section happens to be a business problem. Here, they had a unique way of representing the case, let’s say, by giving you 50 chits of info and allowing you to open up only 40 of them, with each chit labeled what kind of information it contains. So you need to understand what information you need to arrive at a decision for the given case (MCQ-based).\n\nOverall, the level of difficulty lies between medium to hard.\n\nInterviews\n\nFirst-round (CV grilling + knowledge check) — Every interview starts with an introduction, which should be precise and crisp from our end. I was grilled about my CV and ML/DL knowledge in the first interview. It went pretty well as I was able to defend all elements of CV except some questions around DL and python. One piece of advice for fellow peeps — It’s okay if you don’t know the answer to a question asked; you must not waste any time or be silent during the interview. Politely inform the interviewer that you are not aware of the topic currently and move on.\n\nThe second round (Case + HR) of the interview was basically a case round followed by a general discussion and cultural-fit conversation. I was asked a case on optimization as I had a couple of projects around it. In my case specifically, I had to formulate the problem into an optimization framework, define the required data points, constraints and finally cover some possible outcomes. They just give you any business problem/scenario, and you are supposed to drive the conversation, ask questions and arrive at a conclusion. I was fortunate that I got asked a case only around my field of expertise.\n\nThere is no defined way to learn data science or whatever you might call this field; one should try to explore according to interests without skipping any basics. I am mentioning very few topics to learn in the vast AI frame, with one particular resource of my choice.\n\nAnalytics can go hand-in-hand while studying ML, and one might switch towards core analytics or proceed towards deep learning.\n\nOne should explore the following topics to make their analytics muscle strong (Practice-based stuff) -\n\nProject Details\n\nWell, the project I did is subject to implementation and potential impact on decisions after further work, so I can’t really disclose my full project details.\n\nBeing a part of the strategy consulting team, I was lucky to have an exciting project around how marketplaces (say Amazon) impacts financial institutions (basically AmEx), with an attempt to identify mitigation strategies for the associated risk.\n\nIt was a fantastic open-ended project with a large scope, but one must know that there is a limitation of data when it comes to any competitive industry.\n\nWFH experience (I would say communication is the key for a fruitful WFH exp)\n\nIn my opinion, growth is capped working from home when compared to working in any corporate office/environment.\n\nBut obviously, everything has its pros/cons, here is what I felt -\n\nCons\n\nPros\n\nImpact of Covid on internship selections (Situation is identical for each one of us, so don’t let any circumstance impact your chances/performance at the end)\n\nThere ain’t going to be as such an impact, the companies are considerably ready and stable for the situation, and with students able to save a lot of time, they can also go for the enormous world of off-campus opportunities and diverse domains.\n\nI don’t see any difficulties coming up to grab an opportunity (on or off campus). There is definitely a hustle, but that helps us remain competitive and learn new skills, pushing every day.\n\nIdeal student match for Amex strategy role\n\nAs the team name suggests (Amex strategy), they offer a strategy consultant kind of role, which involves working with a world-class team of analysts and managers responsible for making strategies, directly impacting where the corporation will stand incoming 3–5 years. This opportunity really polishes your pitches, communication, the way you present your work, and refine the way you think about strategies.\n\nOne could get extreme exposure to analytics and insights, helping them shape their ideation and implementation.\n\nAdvice for students sitting this year\n\n(CDC intern won’t define your career)\n\nI want every student to know that bagging a CDC internship (at any day) is good, but it doesn’t matter if you don’t get it through CDC. There is a large sea of opportunities waiting to be exploited off-campus, where you might learn, even more, working under your suitable role. Campus selections don’t offer that much diversity of profiles (for internships only), which one could explore off-campus.\n\nAnd one internship can be a plus point for you, but it can’t define your career.\n\n(Skill development is the key — whatever your goal might be)\n\nApart from this, I would recommend every fellow kgpian to keep working hard on their skills, not only coding/CP or CDC prep stuff (you must do that), but simultaneously explore new domains, fields you like, or anything that creates a spark of interest amongst you.\n\nAll The Best !"
    },
    {
        "job_role": "Data",
        "company_name": "Microsoft",
        "info": "Anyone with interest in Data Science and having considerable knowledge in the field of ML/DL with a decent level of coding skills can apply.",
        "content": "FORESIGHT(2021): Summer Internship at Microsoft | Pratyush Saha\n\n--\n\nListen\n\nBrief Introduction\n\nI am Pratyush Saha, a final year undergraduate student from Electrical Engineering. I started exploring the field of machine learning and deeplearning in the month of March 2020 during the quarantineperiod and was very intrigued by it. I got the data science intern opportunity at Microsoft through the on campus CDC drive last year.\n\nSelection procedure\n\nThere was a screening test of 1 hour duration containing 50 MCQs from topics like Machine Learning concepts and algorithms, deeplearning and statistics. The interview round consisted of two technical rounds and the last technical round itself consisted of a few HR questions towards the end. Questions related to DSA, ML and probability were asked in the technical rounds.\n\nHow to prepare for them?\n\nReading blogs from sites such as “towardsdatascience”, “analyticsvidya” , and watching videos from various sources like “StatQuest”, “NPTEL”, “Stanford Distance Learning”, really helps in having your concepts cleared with proper understanding of algorithms and the clear visualisation of their working.\n\nApart from that, practicing on problem statements from kaggle gives you confidence. More focus should be put on data preprocessing and feature engineering as in real life and also during the internship period you’ll have to deal with raw data. Therefore data preprocessing and feature engineering becomes as important as model designing and training.\n\nIn the internship period you would be dealing with very huge data and most of the things would be performed on cloud. Thus having an idea of cloud services like AWS and Azure is really helpful.\n\nYour Project Details\n\nMy project was on “Multivariate Time Series Anomaly Detection”.\n\nHow was your experience working from home? What difficulties did you face?\n\nIt wasn’t that much of a problem for me as the team members were continuously connected through MS teams and my mentor was very approachable and helpful throughout the internship period.\n\nHowever it would have been much more fun and it would have been easier to connect and interact had it been an offline internship.\n\nWhat effect could COVID have in the upcoming internship process?\n\nFor Microsoft, I believe there’s no particular effect of Covid. The University Recruitment team is very helpful and the internship process would be very smooth right from the onboarding.\n\nWho should ideally apply for this internship?\n\nAnyone with interest in Data Science and having considerable knowledge in the field of ML/DL with a decent level of coding skills can apply.\n\nWhat advice will you give to them?\n\nJust have your concepts clear, focus more on learning and increasing your knowledge base in the first two years of college rather than running behind projects/internships just for the sake of mentioning them in your Resume. Target reasonable projects and internships which provide you a good opportunity to learn."
    },
    {
        "job_role": "Data",
        "company_name": "American Express| Saloni Meshram",
        "info": "Students from all departments are eligible to apply. There was no CGPA cutoff.",
        "content": "FORESIGHT(2019): Summer Internship American Express| Saloni Meshram\n\n--\n\nListen\n\nBrief Introduction:\n\nBeing a student of Metallurgical and Materials Engineering Department, I had a very few options in core. This was known to me almost since my first year, thus I decided to go for non-core from the beginning. I would suggest each one of you know about the scope and opportunities in your department before deciding which profile to choose. During one of my internships, I was able toexplore the field Data Analytics and from there I decided to continue in the same.\n\nSelection Procedure:\n\nStudents from all the departments are eligible to apply. There was no CGPA cutoff.\n\nOnline Test: An online test with 20 MCQ questions is conducted once you apply. The test was quite easy. It consisted of questions on basic probability, mathematical aptitude, verbal and non-verbal reasoning and data interpretation. Make sure that you don’t commit silly mistakes. Around 10 people were shortlisted for the next round.Technical Round: It started with a generic question, “Tell me about yourself”. The discussion started with my previous internship at HDFC Bank, Mumbai. Then, the discussion revolved around the Boosting Algorithms. Among other people who were shortlisted, some were given questions related to guesstimates andprobability to solve along with some puzzles.Technical Round + HR:This round again began with my introduction and a brief explanation about my previous projects. Since AmEx and HDFC Bank deal in credit card, a major part of this round involved discussing my work at HDFC Bank. I was asked about some suggestion/new ideas as to how the data AmEx currently has can be used. Then, we moved towards my work at EY. Here, I had directly used thefuzzy-wuzzy library. So, I was asked to give the logic for building it from scratch. Then came the question, “Why should we hire you?” and “Why Amex?”. Be prepared for these questions.\n\nHow to prepare for them:\n\nBe thorough with your CV. Don’t write a description about your internships that you can’t explain. 2. Be prepared for questions like strengths, weakness, why should we hire you? etc. Think about these questions properly and tell them about actually why they should take you and what sets you apart. The interviewer has been in tons of interviews and will easily catch the generic answers.3. Keep practising aptitude questions and puzzles online on websites like IndiaBix. Also, brush up your concepts related to Probability. 4. Be comfortable with at least one programming language preferably Python.5. Know about the company before walking into the interview.\n\nYour Project Details:\n\nEvery intern was allowed a different project to work on. Each one of us had a mentor to guide us as the project proceeded. I was part of the International Line Modelling team. My team worked on delivering the models that would help the company decide which customer should be allotted what credit limit on the credit card. My project was an exploratory one wherein we were developing a dynamic model that would take personalized parameters and weights for each customer. I had to build this model for the US market. Thus, the person to whom my manager reported was in New York and we would discuss the progress of my project usually through Skype. I was solely working on this project under guidance from my mentor. I had written all the codes in Python which were completely automatic. But, most of my co-interns worked on SAS.\n\nCompany Culture:\n\nMost of the interns, including me, were in allocated the Gurgaon office while a few got the Bangalore one. The Gurgaon office seats over 6000 employees distributed across the 3 major divisions — Enterprise and Digital Analytics (EDA), Credit and Fraud Risk (CFR) and Technology. I was a part of the International Line Modelling Team from CFR with my job title as Credit and Risk Decision Science Intern. My office was in One Horizon Center building. The workspace is amazing and has been laid out quite creatively. All the interns were taken out for the fun event at Canvas Laugh Club so that we get to know each other. The company provides you with accommodation for 1 week and bears your travel expenses at the beginning and end of the internship. Also, the company provides transportation everyday anywhere in Delhi NCR region. The number of working days was 5 with timings being specific for a particular team. Team specific fun events and offsite trips to nearby locations happen once a year.\n\nThe best thing about AmEx has to be the people there. On the first day itself, we got to interact with the senior leaders of the company, who were really welcoming. The Director and the VP of my team got really involved in the work I was doing and we used to have regular brain-storming sessions. Also,the team members really looked out for each other and were quite helpful. I had a great time discussing everything and anything over lunch with my team. The HR people also made some efforts to arrange sessions with top executives from India and the US offices.\n\nWhat I liked the most about my internship:\n\nMy manager/mentor leveraged the comfort that I had with Python or else it would have taken me some time to get comfortable with SAS. My inputs were always considered even though due the time crunch everything could not be implemented. My teammates would always be ready to give me fundas be it related to my project, career or any other thing. My mentor would always motivate me and guide me as to how to look towards the problem statement with a more analytical view. I have learnt innumerable things throughout this internship and listing all of them in one blog is just not possible.In the end, I am glad that I was able to contribute to the project. The most important thing that I have learnt is that whatever you do, give it your best shot. Try to pitch in new ideas/methods for your project and interact with the people as much as possible. They are obviously more experienced and it’ll definitely develop your social skills. Look at this internship as a golden opportunity and make the most of it in every way possible"
    }
]