[
    {
        "job_role": "Finance",
        "company_name": "BlackRock",
        "info": "Holding a CFA or FRM certification can be advantageous. Additionally, candidates should have a strong foundation in basic bond valuations, macroeconomics, and an understanding of derivatives.",
        "content": "--\n\nListen\n\n1) Brief introduction and description of offered role\n\nHello everyone, I’m Lakshya Jindal Gupta, a fourth-year economics student. I recently accepted a position in BlackRock’s Core Analytics Solution group, previously known as the Portfolio Analytics group. This group is divided into two teams: Single Securities and Portfolio Risk. The Single Securities team focuses on analytics at the security level, generating key metrics that the Portfolio Risk team uses to estimate risk and perform analytics at the portfolio level. I am part of the Portfolio Risk team, and my project involves backtesting the Enhanced Historical VaR (Value at Risk). My role is to assess the validity of the HVAR model currently used by the firm through various statistical techniques and assist in the firm-wide transition from one infrastructure to another.\n\n2)How did you get into BlackRock? What was the selection procedure?\n\nBlackRock’s selection process for this role involved an initial CV shortlisting, specifically targeting dual-degree students. Holding a CFA or FRM certification was a significant advantage in securing a shortlist spot. The interview process consisted of three rounds: two technical and one HR round. In the technical rounds, I was primarily asked questions related to economics and finance, reflecting my academic background and the CFA on my CV. Other candidates also faced questions on puzzles, mathematics, and machine learning. The final round focused on HR questions, with a strong emphasis on understanding the candidate’s motivations for wanting to join BlackRock (this is a question almost every candidate should expect) and discussing personal weaknesses.\n\n3) How to prepare for them?\n\nHolding a CFA or FRM certification can be advantageous. Additionally, candidates should have a strong foundation in basic bond valuations, macroeconomics, and an understanding of derivatives. Familiarity with recent macroeconomic events or actively managing your own investment portfolio can also be beneficial. These topics not only serve as excellent discussion points during the interview but can also help steer the conversation towards areas where you are most comfortable and knowledgeable.\n\n4) When did you start preparing for this role and according to you what is the ideal time for aspirants to begin their preparation?\n\nFor this role, I didn’t prepare anything specific outside of my usual studies. Instead, I focused on revising the core topics covered in the CFA curriculum. I recommend that candidates stay updated with the latest finance-related news. Additionally, having experience from a finance-related internship can provide a significant advantage in the selection process.\n\n6) Are there any specific requirements such as department, CGPA, or other criteria for this position? Additionally, do certain PORs or EAAs enhance one’s chances of securing this internship?\n\nBlackRock was open to candidates from all departments, provided they were enrolled in dual degree programs. While there was no strict CGPA requirement, maintaining a score above 8\n\nwas considered a plus. Positions of Responsibility (PORs) or Extracurricular Activity Achievements (EAA) were not mandatory, but having these can be beneficial. They not only help in driving the direction of the interviews but also enhance a candidate’s chances of selection.\n\n7) According to you, who should ideally apply for this job?\n\nEveryone is encouraged to apply for roles at BlackRock. The company offers a variety of tech-specific projects, so even if you don’t have a background in finance but possess strong coding skills, you are definitely a viable candidate for these positions.\n\n8) What are some of the major points you think would be valid to mention in CV while targeting this profile?\n\nSecuring a position at BlackRock can be significantly enhanced by having finance-related internships or certifications such as CFA or FRM. Additionally, notable achievements such as winning competitions can serve as important highlights on your resume. If you have undertaken machine learning courses or completed relevant internships, mentioning these is crucial as they can greatly increase your chances of being shortlisted.\n\n9)Lastly, what advice would you like to give to the students aiming to grab CDC internships this year?\n\nStay calm and talk with seniors if you face any issues. Keep yourself updated and regularly check all the notifications released on the notice board. I have seen many of my peers miss deadlines to apply for companies where they had a good chance of getting a shortlist, so please try to avoid that. Getting stressed during this phase is very normal, keep in regular touch with your parents and loved ones."
    },
    {
        "job_role": "Finance",
        "company_name": "Nomura",
        "info": "You should know the contents of your CV inside out. Imagine being woken up at 4 a.m. and having to defend a particular internship or project on your CV without hesitation. Be ready to answer 5–6 follow-up questions about each",
        "content": "--\n\nListen\n\n1) Brief introduction and description of the offered role\n\nA) Hello! My name is Tejas Saxena, and I am a fourth-year undergraduate student in the Department of Chemical Engineering, specializing in Financial Engineering. I hail from Mumbai, Maharashtra. My primary focus is in the field of Finance, and I have earned notable certifications, including Chartered Financial Analyst (Level 1) and Financial Risk Manager.\n\nI recently received an internship offer from Nomura, where I am working in their International Wealth Management (IWM) division. I am currently working as a Global Markets Analyst at their Powai office in Mumbai.\n\n2) How did you get into Nomura? What was the selection procedure?\n\nA) Nomura is one of the largest investment banks in Asia and the leading Investment Bank in Japan has an impressive global footprint. At Kgp, Nomura typically recruits for three roles: Global Markets (GM) Analyst, GM Algo Quant, and Wholesale Strategy (WS). Although I was shortlisted for both WS and GM Analyst positions, I ultimately received an offer for the GM Analyst role, which I will elaborate on here.\n\nNomura’s selection process begins with the release of the shortlist, which happens about two days before Day 1. On Day 0, shortlisted candidates participate in Group Discussions (GDs) for the available roles. Those who advance past the GD stage proceed to Day 1, which involves around 3–4 personal interviews (PIs). Successfully navigating these stages culminates in an internship offer. Now, let’s delve into each part of this process.\n\nGroup Discussion: The GD typically revolves around a current macroeconomic issue prevalent in the Global Financial Markets. For my session, the topic was, “What are your thoughts on inflation? Will this inflation in 2023 be sticky or not?” The discussion lasted approximately 12 minutes, excluding the 3-minute preparation time, during which recruiters meticulously noted our points. After the discussion, they cross-examined us on our statements to verify our understanding and ensure we weren’t merely reciting information without theoretical or empirical backing. For instance, I mentioned Fitch downgrading the US credit rating, highlighting potential shifts from equity to bond markets as seen in 2012. The interviewer asked me to explain what Fitch is and the significance of credit ratings. The session concluded with a puzzle on contiguous sequences, which we had to solve in 5 minutes.\n\nPersonal Interviews: Most of the questions directed at me during the interviews were centered around my CV. I had prior internships in Corporate Strategy, Equity Research, and Data Analysis, along with several finance-related projects. The interviewers focused particularly on my Equity Research internship and finance projects. Each interview lasted around 40 minutes. Given that I had cleared CFA Level 1 and FRM Part 1, the interviewers extensively grilled me on finance-related concepts. Although I struggled with some probability, statistics, and puzzle-based questions, my strong foundation in finance compensated for these areas. I underwent two interviews for the GM Analyst role and one for the WS role, followed by a 15-minute HR interview. Subsequently, I received the internship offer.\n\n3) How to prepare for them?\n\nA) I cannot stress enough the importance of thorough CV preparation. You should know the contents of your CV inside out. Imagine being woken up at 4 a.m. and having to defend a particular internship or project on your CV without hesitation. Be ready to answer 5–6 follow-up questions about each item. If your project or internship aligns with the interviewer’s expertise, they might delve into a 20-minute discussion on that very topic.\n\nHaving a solid grasp of finance is a significant advantage. If you have completed internships or projects in finance or have cleared exams like CFA or FRM, you can use this to steer the interview. Questions like “What are your two favorite financial securities?” or “Which market would you recommend to an investor?” are opportunities to guide the conversation toward your strengths. For instance, you could mention Equities or Fixed Income and discuss valuation methods, or talk about Options and Derivatives, elaborating on strategies like Straddle, Strangle, or Butterfly Spread. But most importantly, if you do not know something, then don’t try to talk your way out of it by giving a random answer. Your interviewer would most likely be in a director-level position in the organization, so you won’t be able to fool your way out of the interview!\n\nGeneral awareness of the financial world is also crucial. Be prepared for questions about historical events or recent developments in finance. For example, some of my peers were asked about the SVB and Credit Suisse collapse and its implications, while others faced questions about the 2008 Financial Crisis. These topics can also come up in group discussions. Therefore, stay informed by reading newspapers like the Mint, Bloomberg, or WSJ. I read the Financial Times and The Economist for global affairs, and The Ken for Indian and South Asian news daily.\n\nAs the interview nears its conclusion, interviewers typically ask if you have any questions for them. Always have insightful questions prepared. I recommend reading the company’s Annual Report, particularly the CEO’s letter to shareholders, to understand the company’s plans. This allows you to ask informed questions and even offer suggestions based on your understanding. Additionally, know the key personnel in the company and read about previous interns’ experiences. Attend the company’s presentation carefully and consult seniors who have interned in the role, as you might be asked about the specifics of the role. Lastly, soft skills are vital. Ensure you speak confidently, conduct yourself professionally, and present yourself well.\n\n4) When did you start preparing for this role and according to you what is the ideal time for aspirants to begin their preparation?\n\nA) I began preparing for this role passively at the beginning of my third year in August 2022, and more actively in January 2023 when I decided to pursue the CFA and FRM certifications.\n\nThe ideal time to start preparation varies for each individual. However, if you have no prior experience in finance or related domains such as quantitative analysis, consulting, strategy, product management, or data analysis, I recommend allocating at least a year to build a strong foundation from scratch. This timeline allows you to gain the necessary knowledge and skills gradually, ensuring a thorough understanding and solid preparation. If you are someone who’s already been preparing for Finance for a while, I would suggest not deviating for the sake of doing “extras” because your batchmates are doing it. Focus on what you have been doing, and try to achieve mastery at it.\n\n5) What difficulties did you face while preparing for this Company/Profile? How did you overcome them?\n\nA) At the start of my third year, my CV was practically devoid of any finance-related experiences, aside from my Financial Engineering specialization. Additionally, my CGPA wasn’t stellar, and I lacked positions of responsibility (PORs). Building a finance-oriented CV seemed like an ordeal!\n\nTo address these challenges, I first focused on improving my CGPA, raising it from 8.42 to 8.73. I then pursued courses and projects in finance, completed an equity research internship during the winter break, and secured a research internship at the Haas School of Business, UC Berkeley. The aim was to populate my CV with as many finance-related experiences as possible to increase my chances of getting shortlisted.\n\nFurthermore, I took the CFA Level 1 and FRM Part 1 exams in May 2023 and by God’s Grace, successfully cleared both, which significantly strengthened my CV. I also sought advice from seniors to streamline my preparation and benefit from their experiences.\n\n6) Are there any specific requirements such as department, CGPA, or other criteria for this position? Additionally, do certain PORs or EAAs enhance one’s chances of securing this internship?\n\nA) While there isn’t any specific deal breaker on paper, being in Financial Engineering or Economics can be advantageous. Having a CGPA above 8.5 is beneficial, although a CGPA above 8 can suffice. Nomura is unlikely to reject you if your financial knowledge is exceptional, even if your CGPA is around 8.01.\n\nPORs used to be highly crucial, but my experience suggests that they are not indispensable. PORs can help if they provide relevant discussion points during the interview, but their absence can be compensated by finance-related internships, projects, or certifications.\n\n7) According to you, who should ideally apply for this job?\n\nA) Ultimately, if I may, it all comes down to professing your love for the realm of finance. Those who should ideally apply for this job are individuals who have a genuine passion for finance. Don’t treat it as a second, or a backup option. Understand the core concepts deeply — not just to clear interviews, but to satisfy your intellectual curiosity. Stay updated with the latest market trends and economic developments, engage in thoughtful discussions, and reflect on how finance shapes the world around us. When you truly love what you do, your enthusiasm and knowledge will naturally shine through in the interviews. This authentic connection with the field sets you apart, and interviewers will notice it.\n\nI have seen people with impressive credentials — CFA or FRM certifications, numerous projects on complex finance topics, and internships at prestigious investment banks — fail to secure offers because they lacked a genuine love for finance. If you believe you have a true passion for finance and aspire to work in a firm where fundamental conceptual clarity is valued over professional accolades, then you should apply for this job.\n\n8) Kindly attach your CV/Resume. What are some of the major points you think would be valid to mention in your CV while targeting this profile?\n\nA) As previously mentioned, aim to populate your CV with as many finance-related experiences as possible. These experiences don’t necessarily have to be strictly finance-related; they can encompass a range of fields such as quant projects, data science, or corporate strategy internships. Participating in competitions — whether in trading, equity research, quant hackathons, or M&A-related events — can also be valuable additions to your CV and serve as excellent discussion points during interviews.\n\n9) Lastly, what advice would you like to give to the students aiming to grab CDC internships this year?\n\nA) If all of this seems daunting, I want to reassure you that many tend to over-hype finance interviews. It’s not as intimidating as it may appear. I’ve heard exaggerated tales of interviews lasting for hours, with candidates being scrutinized to the smallest detail on their CVs. However, my experience was quite the opposite. I found my interviews enjoyable and enlightening. I learned a lot from my interviewers, and the process felt more like a constructive conversation than an interrogation.\n\nI understand the stress you’re feeling. We’ve all been there. I went into the process with doubts, but once I got through the initial rounds, my confidence soared, and I found myself enjoying the interviews. One of my interviewers, who is now my boss at Nomura, imparted valuable knowledge and made the experience incredibly rewarding. And remember, this advice applies broadly to other profiles as well.\n\nIn conclusion, don’t let the CDC process consume you. It’s an important phase in your college life, but it doesn’t define your worth. Keep perspective and don’t put your life on hold for it. With that said, I wish you the best of luck, may you excel in your endeavors, and may God bless you!"
    },
    {
        "job_role": "Finance",
        "company_name": "Nomura| Anshul Jadhav",
        "info": "Try getting research projects in this domain at VGSOM, ISB, IIMs, or other foreign universities. Internships in this domain will give you an edge in the CV screening round and a good amount of details to discuss during the interview.",
        "content": "FORESIGHT(2023): Summer Internship at Nomura| Anshul Jadhav|\n\n--\n\nListen\n\n1) Brief Introduction\n\nMy name is Anshul Jadhav. I’m a pre-final year undergraduate student enrolled in the dual degree course of the Department of Metallurgy and material science with a specialization in the Financial Programme. I got an Internship at Nomura in the Global Markets division and will join them around May this year.\n\n2) How did you get into Nomura? What was the selection procedure?\n\nSo I was shortlisted for 2 Nomura analyst profiles(Global Markets and Wholesale Banking). Nomura Global markets had a CV screening round, after which we were directly called for Group Discussion. Both profiles had two interview rounds followed by an HR round. Across the two rounds, you meet with people with varied seniority ranging from 5 years to 15 years of experience. Usually, 1 or 2 of them are KGP alums. Each round was a mix of both domains and HR(convincing them why that particular profile mainly). Each round lasted from 30–40 mins. Then, the standard HR round at last after you clear previous rounds.\n\nBoth interviews had questions from my internship experience, probability, puzzles, basic finance, derivatives, bonds, pricing models, etc. The discussion can be finance-centric if you have relevant experience; otherwise, they check your problem-solving skills and how quickly you can learn and apply them. There were some questions from Python. Other rounds had questions from economics, various portfolio optimization techniques, investment strategies, and financial statements. A common question in all the rounds for both profiles was: Why do you want to go into finance? Why Global Markets? These were some of the most important questions in all the rounds, and hence you need to convince the interviewer absolutely, why you are the best fit for the role!\n\n3) How to prepare for them?\n\nOne should start company-specific preparation at least 4 to 5 days before day 1. For Nomura, I got the information about the shortlists two days before the interview for both profiles. I focussed specifically on my CV. I interned at a financial services company(Motilal Oswal Financial Services). So I kept in mind to go through all the concepts on my CV related to that. Revising economics and basic finance concepts, I couldn’t do a lot because of time constraints. My specific focus was on getting the basics revised.\n\nI prepared for the HR round well on the last day as they played an essential role in non-tech or management trainee roles. You should know about the company’s business to a good extent, what they do and how they make money. These questions are usually asked for such roles. Your interest and efforts in joining them are one of the most important aspects they evaluate apart from domain knowledge.\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem\n\nFor pre-final year students, deciding on the profile you want to pursue is the first thing you should focus on. Talking specifically about Analytics, product, consulting, or finance, you have your specific preparation for each of them. I had decided in my 2nd year onwards that I would only try for a finance role as that is what I was interested in. There are some generic preparation materials for quant, like the 50 challenging problems in probability, Heard on the Street, and Brainstellar puzzles are a gem of resources. It would be best if you prepared them well. Most of the questions will be asked from them, specifically for quantitative, finance & analytics roles.\n\nFor finance, if you have done any certification or competition (CFA, FRM, etc.), those things are usually discussed in all rounds. Specific resources would involve CFA level 1 or the finance-related courses offered by VGSOM, IIT KHARAGPUR. Try getting research projects in this domain at VGSOM, ISB, IIMs, or other foreign universities. Internships in this domain will give you an edge in the CV screening round and a good amount of details to discuss during the interview. I can say for Nomura with certainty that having a finance background helps in CV screening rounds, but after that everyone(Finance and Non-finance background) stands an equal chance of getting through depending on how you take the interview ahead and convincing them why you should be there. You should try to capitalize on your strength that is relevant to the domain. There was a situation during one of the rounds where I mentioned I am pretty well-versed in current affairs related to macroeconomics, following which they asked me 5–6 rapid 3–4 digits multiplication questions, and they expected a quick correct response. Thus I would say being true to your preparation is very important.\n\n5) According to you, who should ideally apply for this job?\n\nThe role is one of the few roles which is focused majorly on finance, especially for the companies which come on day 1 of the CDC internship. So anyone firm about their decision to enter into a finance role should apply for this job.\n\n6) Any specific advice you want to give to the junta sitting for internships this year?\n\nThese 4 things should be in your mind:\n\n1)Always ask the interviewer for a hint if you are stuck. Solving a problem entirely new for you with hints can have a more significant impact than answering something you know directly without hints.\n\n2)Prepare for HR rounds properly if you are targeting Non-Tech roles, mainly defending why you decided to go for that role. Attend the PPTs for Non-Tech roles if you are targeting them and read their job descriptions thoroughly, it brings clarity to your answers.\n\n3)The Internship process is very random. People may get into roles they don’t want or are not being paid according to their expectations. I have seen it with my seniors as well as my batchmates. You can apply for off-campus opportunities if you don’t get into one of the roles of your preference. You have six or seven months before you join your company; there’s sufficient time. Try to maintain your calm and schedule. It can be frustrating at times but trust your preparation. Believe in yourself and everything eventually, will go in the right direction\n\n4)Saying NO is always a better option than answering absolutely wrong answers, and it will not hurt your overall evaluation believe me. This is what I have experienced.\n\n7) Kindly attach your resume. What are some of the major points that would be valid to mention in your CV while targeting this profile? (any specific suggestions you would like to make?)\n\nMajor Points\n\n1) Corporate internship in a well-known Financial Services Company\n\n2) Research internship in one of the Top 10 Management schools in India\n\n3) Being a student with a specialization in Financial Program\n\n4) Participation in finance related Competitions"
    },
    {
        "job_role": "Finance",
        "company_name": "DB",
        "info": "DB looks for just a slight inclination towards finance. Basic knowledge of financial matters, even if it’s not deep, is all they need. They’re not expecting much out of the college students, they expect them to learn first.",
        "content": "FORESIGHT(2023): Summer Internship at DB| Rhea Vigil Alapatt|\n\n--\n\nListen\n\n1) Brief Introduction\n\nHi everyone, I am Rhea Vigil Alapatt, a third-year undergraduate student from the Department of Metallurgical and Materials Engineering enrolled in its B.Tech course. I am a boarder of Sarojini Naidu Indira Gandhi Hall of Residence. I am currently interning at Deutsche Bank.\n\n2) How did you get into DB? What was the selection procedure?\n\nFirst of all, there’s the preliminary round which is situation based. In this round, various realistic scenarios of working at an office are introduced, and a choice has to be made between many options available to you. After clearing this, there is an interview round that differs from person to person.\n\n3) How to prepare for them?\n\nThere is no compulsion for finance but it acts as a brownie point. Understanding Financial Markets is a Coursera course that can help you learn more about finance. You’d be able to check out the CFA documentation as well. In your interview, you should be informed of current macroeconomic conditions in India, the United States as well as some additional countries.\n\n4) What difficulties did you face while preparing for this Company/Profile ? How did you overcome this problem?\n\nThe profile alone does not have a large number of employment opportunities, so this is the main challenge. Apart from that, financing is a very broad subject so it’s pretty hard to understand what kind of skill you want in the first place and also defend yourself with your knowledge.\n\n5) According to you, who should ideally apply for this job?\n\nDB looks for just a slight inclination towards finance. Basic knowledge of financial matters, even if it’s not deep, is all they need. They’re not expecting much out of the college students, they expect them to learn first.\n\n6) Any specific advice you want to give to the junta sitting for internships this year?\n\nIt’s a fairly randomly drawn process to get an internship. You shouldn’t give up hope, and you should try to do your best.\n\n7) What are some of the major points you think would be valid to mention in your CV while targeting this profile?\n\nDB takes a holistic approach while recruiting.\n\nSo if you’ve done anything other than the curriculum, this would be an added advantage."
    },
    {
        "job_role": "Finance",
        "company_name": "Morgan Stanley",
        "info": "The test duration was around two and a half hours. The sections were Mental Ability, Mathematics or Probability and Statistics, English, Finance, Speaking, Listening and Coding.",
        "content": "FORESIGHT(2023): Summer Internship at Morgan Stanley| Priyansha Gupta |\n\n--\n\nListen\n\nMy name is Priyansha Gupta. I am a pre-final undergraduate student of the Department of Humanities and Social Sciences enrolled in its 5-year Integrated M.Sc. Economics program. I am also pursuing a minor in Mathematics and Computing. I am a boarder of Mother Teresa Hall of Residence. I am from Jabalpur, Madhya Pradesh. Talking about my previous experience, I have previously interned at Godrej Capital on a research project in the Unsecured Business Loans division. I also did an internship at ISB at the Centre of Analytical Finance. I held the position of UG Department Representative for the session 2022-23.\n\n2. How did you get into Morgan Stanley? What was the selection procedure?\n\nI was interested in going into my core. So, the best option for me was Investment Banking or finance, as we call it in KGP. But broadly, I applied for Consult, Finance and Analytics.\n\nTalking about the selection procedure, there was a test. The test had 7 sections, as I remember. The test duration was around two and a half hours. The sections were Mental Ability, Mathematics or Probability and Statistics, English, Finance, Speaking, Listening and Coding. Mental Ability and Maths questions were of easy level. English could be a little difficult as they asked for Synonyms, Antonyms and those kinds of things, but the paragraph-based questions can be solved easily. In finance, there were 15 questions in 15 minutes, so it was more about speed. Speaking test is like we must read some sentences in a given time with proper pronunciation, and in 1 question, I had to talk about a given topic for 45 seconds. They gave me 10 seconds to think about it, so it was just about quick thinking and speaking properly. In the Listening test, there will be an audio clip and then questions based on them, so we must listen properly and remember because the audio cannot be played again. Coding questions were implementation based and of easy level; if we practice DSA properly, they can be solved. Coding questions might help increase the overall score but are not counted in Sales in Trading profile as such. For shortlisting, they consider the test score, CG and CV as well. They shortlisted people with CG above 9 and who had some background in finance (related interns or projects). The interview consisted of 3 rounds. The first 2 were technical; they asked a lot of questions related to interns and projects and specific finance questions related to them. They asked some general finance questions as well. Be updated on the latest finance and business news around the world. You should also be thorough with any finance concept included in your CV related to any intern or project. The HR round is also quite crucial, in my opinion. Quick thinking is required if any situation-based question is asked, and instead of one-way answering, interacting with the HR helps.\n\n3. How to prepare for them?\n\nFor Mathematics/Probability and Statistics, practice from 50 Challenging problems in Probability, heard on the Street and Brainstellar might also help. For finance, they asked questions about many concepts, so brushing up on basic concepts by reading from Investopedia, Zerodha and CFA materials will help. Obviously, all of the finance cannot be covered, so at least remembering the basics and the basic formulas will help. As far as I remember, most of the questions were about financial ratios. For the speaking and listening test, no preparation is required as such, but watching some English movies without subtitles could be a good practice, XD. Doing basic to intermediate-level DSA problems from GFG or Leetcode should be enough for Coding questions. CP per se is not required. Guesstimates were not asked in my interview, but they could be asked, so it would be better to practice a few of them. For the interview rounds, thorough knowledge of everything in the CV is necessary. The interviewers were very friendly, so if you get stuck somewhere, you can discuss it with them. The interview goes very smoothly if we keep talking to the interviewer instead of doing it as a Q&A. Being updated with the business and financial news is required, so reading financial news one month beforehand will help.\n\n4. What difficulties did you face while preparing for this company/profile? How did you overcome this problem?\n\nOne of the biggest difficulties for me was that I did not have any PORs required for both finance and consulting. Morgan Stanley came for intern for the first time this year to campus. It never came before, so there was no company-specific preparation. I could not just go and get a POR in 3 months while preparing for CDC, so I kept some backup options like Analytics or ML and prepared for them also. Also, maintaining a high CG helps. And I had a relevant finance background through interns and projects, so that helped too.\n\n5. According to you, who should ideally apply for this internship?\n\nThe Sales and Trading role is purely based on fixed-income financial instruments, so people interested in hard-core finance and investment banking should apply.\n\n6. Any specific advice you want to give to the junta sitting for placements this year?\n\nI want to advise my juniors that it is better not to make CDC intern too big of a deal. I admit that is very important, but you will not get anything out of it if you are not actually learning anything or building a skill set. If you keep learning and exploring things, you will end up in a good place. It is just a very good opportunity given to us. But it is not the end of the world too. Your learnings and skill set are the only things that will help you in the long run. Good preparation will help you in bagging an intern. But even apart from CDC, there are tons of opportunities out there. You just have to keep exploring to find the role which excites you. Also, it is better to apply for roles you are actually interested in, instead of just running to get an internship anywhere.\n\nPrepare well for your internship. Be confident in yourself; having the appropriate know-how helps in building up confidence. Do smart-work instead of hard work; goal-oriented preparation always helps as long as you are learning and enjoying the process. Like I said before, keeping a high CG will always help in any profile you sit for. Finance companies take people from all departments, so the department is not a barrier. Having some relevant PORs might also help, but running for PORs just for the sake of getting an internship will only be a waste of time. Just keep an open mind and prepare well. I wish you all the very best for your upcoming internship season. You can reach out for any more queries. I would be more than happy to help."
    },
    {
        "job_role": "Finance",
        "company_name": "Suisse",
        "info": "The role here is suited for person interested in Finance and Statistics.",
        "content": "FORESIGHT(2021): Summer Internship at Credit Suisse | Anshul Tembhare\n\n--\n\nListen\n\nBRIEF INTRODUCTION :\n\nMy name is Anshul Tembhare and I am a pre-final year student from the department of Electrical Engineering, enrolled in the course of Instrumentation Engineering. During the CDC Internship drive in 2020–2021, I had secured an Internship at Credit Suisse in a Quantitative Analyst role.\n\nSELECTION PROCEDURE :\n\nThe selection procedure for Credit Suisse at CDC majorly involved of 3 rounds:\n\nHOW TO PREPARE:\n\nPreparation for a quant role majorly includes strong fundamentals in probability & statistics, problem solving skills and basics of coding. Thus, the major resources that are available for this preparation for CDC include:\n\nPROJECT DETAILS :\n\nThe internship involved working on a real life project surrounded around building a Quantitative prediction model using a framework called Copulas. The model was built using python and then tested for various different forms of time series dataset.\n\nHow was your experience working from Home & difficulties?\n\nWork from Home during an Internship was an average experience. The reason to say that is because there are a lot of experiences and learning/ networking opportunities that are missed working online. Though there were steps taken by the company to overcome such problems faced by interns, it would always have been better to work on-site.\n\nAt a WFH internship, Skype calls become a common thing and helping out/ getting help from senior people becomes a challenging task. Thus, during this period, staying connected with your manager and being trustworthy/ accountable is one of the most important traits.\n\nEFFECT OF COVID ON UPCOMING INTERNSHIPS:\n\nSince the online internship drive is already conducted by CDC once, you can expect this year to be a bit less hectic and smooth compared to last one. But the basic facts remain the same:\n\n2.More Malpractices during online tests\n\n3.Everyone should keep their Internet connection and Laptops/Desktops updated\n\nOn a better side, due to online semesters and classes, the academic load is expected to be less compared to non-covid years.\n\nWHO SHOULD IDEALLY APPLY FOR THIS INTERNSHIP ?\n\nAny person who is interested in Finance and Statistics can apply for this role. The role is mostly focused on analytical thinking and it’s application to develop financial models. It also looks for a person with good Soft-Skills and working with a team is a basic trait.\n\nADVICE"
    },
    {
        "job_role": "Finance",
        "company_name": "Deutsche Bank",
        "info": "Anyone interested in Data Science and having considerable knowledge in field of ML/DL with optimum coding skills can apply here",
        "content": "FORESIGHT(2021): Summer Internship at Deutsche Bank | Karmanya G B\n\n--\n\nListen\n\nBrief Introduction :\n\nI am Karmanya G B, a final year undergraduate student from the Department of Mechanical Engineering. I am from Radhakrishnan Hall of Residence. I joined Deutsche Bank as a Summer Analyst through CDC.\n\nSelection procedure :\n\nDeutsche Bank’s selection process has 2 steps:\n\n1.CV shortlisting: DB (Deutsche Bank) shortlists 15–20 students based on their CVs. They look for a well-rounded CV and any prior knowledge/experience in finance is a brownie point. Although they do not mention an explicit CG criterion, they generally look for CG > 8. At this point, DB also asks for a cover letter in which they want to know why the candidate wants to join DB and conducts a test that consists solely of various scenarios one might face in the office (HR questions)\n\n2.Interviews: DB usually conducts 3 rounds of interviews (this may vary depending on their needs). The rounds will include HR questions, Puzzles, CV-based questions, and test your general understanding of finance and your inclination towards the field.\n\nHow to prepare for them?\n\nI would divide the preparation into 3 parts.\n\nPuzzles/Probability: Heard on the Street would be your go-to book for this, as most of the puzzles that DB asks for will be from there. You can also go through other books like Xinfeng Zhou and 50 Challenging Problems in probability.\n\nFinance Knowledge: Ensure that you are very good with macroeconomic concepts; there are crash courses available on YouTube that cover all the essential topics. Try and brush up on the recent trends in business and financial markets. MOOCs or CFA material will help you learn the basic concepts and financial tools.\n\nCV prep: Ensure that you can defend everything in your CV.\n\nYour Project Details\n\nAlthough I cannot disclose the details of my project due to compliance rules, I can tell you that the internship will be highly beneficial as the first week will be a Bootcamp on financial instruments and derivatives. Throughout the internship, there will be interaction with various business heads and smaller training sessions available to you. All of the assigned projects were directly used by the desk, and I was also given the opportunity to work on active client requests.\n\nCompany Culture\n\nDeutsche Bank actively encourages people from different teams to talk to one another and share knowledge. Even as an intern, I could easily set up meetings with any business head and pick their brains with all queries I had. Interns are taken very seriously in the company and even as an intern my opinions were always heard and taken into consideration.\n\nWhat effect could COVID have in the upcoming internship process?\n\nDuring my CDC, I believe that DB selected fewer interns than before. However, I would not imagine they would select fewer than 4 interns in the upcoming internship process.\n\nWho should ideally apply for this internship?\n\nAnybody that has an aptitude for finance and is interested in exploring a possible career in the field.\n\nWhat advice will you give to them?\n\nMake the interviews as interactive as possible. The fact that you have gotten shortlisted means that they already believe you have the skills they are looking for. They just want to know how you think, throughout the internship There allowed and if you are someone, they would like to work with at the interview level."
    },
    {
        "job_role": "Finance",
        "company_name": "JP Morgan Chase",
        "info": "Those who are into Fintech and financial markets and interest in OOP and DSA can apply at JPMC(Markets)",
        "content": "FORESIGHT(2021): Summer Internship at JP Morgan Chase|Pratyasha\n\n--\n\nListen\n\nBrief Introduction:\n\nHello, I am Pratyasha, a 4th-year undergraduate student of the Department of Mechanical Engineering (B.Tech). I received an offer from JP Morgan Chase(CIB Research & Analytics, Markets). Here, I have noted down my experience of going through the shortlisting and interview rounds.\n\nShortlisting rounds:\n\nFor shortlisting, there were 2 tests. The first test had Mathematics puzzles(basic), questions on English, and Reasoning. The second test had problems with Probability and Statistics. All the questions of the 2 tests were objective.\n\nInterview rounds:\n\nThere were two rounds of interview for JPMC -\n\n1. The Technical Round — In this round, we were asked to brief our projects and internships mentioned in our CV, followed by were given problems on Probability and basic Mathematics puzzles. They also tested our knowledge of Data Structures and Algorithms. There were 9 problems in total. It was not mandatory to have prior knowledge of Finance. The interview went on for about 35 min. The main focus of the discussion was the problems. Not much was asked from the CV.\n\n2. The HR Round — This round was more like an informal conversation, where the interviewer asked about my family background, why I want to intern at JPMC etc. This round hardly lasted for 15 min. The interviewer also briefed me about the working environment at JPMC and the procedure I had to follow if I received the offer.\n\nPreparation:\n\nWe need to practice problems on Probability and Statistics. Some resources are: Heard on the Street\n\n50 challenging problems in Probability\n\nAlso, it is advisable to practice quant problems and revise the basic concepts of DSA.\n\nA brief overview of my project:\n\nDepending on the team we are a part of and our field of interest, we are allotted different projects. For me, it was mostly automating some tasks(as my interests were\n\ninclined towards that). Since a lot of the information (clients/products) related to our projects are confidential, here is a brief overview of 2 projects I worked on at JPMC: 1. Creation of some automating tools for facilitating the Sales Team in carrying out their tasks more efficiently.\n\n2. Automating the generation of financial reports to be sent to clients: JPMC has its investible indices, the performance of these indices, and some other details that need to be sent in specific formats to the respective clients to automate one such report.\n\nExperience from work from home:\n\nWorking from home has both pros and cons.\n\nAs for pros, we can work through our doubts any time, even beyond office hours, although we are asked not to overwork. Also, a lot of our time for traveling and other formalities gets saved in online mode.\n\nFor cons, it gets relatively challenging to clarify doubts as there is nothing more efficient than in-person interaction. Also, networking with other team members is not as efficient in online mode.\n\nWhat effect could Covid have in the upcoming internship process?\n\nIn the online process, we may face technical issues during interviews/tests. On the bright side, online interviews can be less grilling than offline ones.\n\nAccording to you, who should ideally apply for this intern?\n\nThis is a Fintech profile, so anyone who inclines financial markets, and interest in OOP and DSA, can apply for JPMC (Markets) profile. Even those who have no prior knowledge of Finance can apply for JPMC.\n\nAnd what advice will you give to them?\n\nTo the internship aspirants, the CDC Internship season can be pretty stressful. Remember, CDC is not the only option you have. Try to remain strong during the process, and you’ll ace it. All the best!"
    },
    {
        "job_role": "Finance",
        "company_name": "Axis Bank",
        "info": "For the people who are interested in the business side of the bank and data analysis.",
        "content": "FORESIGHT(2018): Summer Internship Axis Bank| Sharad Kumar Saini\n\n--\n\nListen\n\nBrief Introduction:\n\nMy internship was under the BIU(Business Intelligence Unit) department at Axis Bank, Worli. The BIU department was mostly oriented towards the understanding of business and extracting useful insights using data analysis for business. Internship duration was from mid-May to mid-July.\n\nSelection Procedure:\n\nThere was a 5-hour small hackathon on Hackerrank. The problem statement was to perform sentiment analysis on youtube video comments text data and recommending them. Later, there was an interview with shortlisted candidates. The interview was mostly related to machine learning algorithms and about the previous internship project discussion. At last, they asked one puzzle and one guesstimate.\n\nHow to prepare for them:\n\nDo some data analysis courses in the CS department and some statistics courses. Go through basic data analysis books(like ISLR). Prepare for puzzles from GeeksForGeeks, InterviewBit and Heard on the street book. Take part in some online data analysis competition. Do some data analysis related projects.\n\nYour Project Details:\n\nMy project was building a recommendation engine for their products and services. The objective was to recommend the next best product suitable for the customer from the customer’s perspective.\n\nCompany Culture:\n\nCompany culture is very good. Our team was very supportive and helped in the difficulties related to projects and other procedures. KGP seniors were very supportive.\n\nAccording to you who should ideally apply for the intern:\n\nPeople who are interested in the business side of the bank and also want to do data analysis.\n\nAnd what advice will you give to them:\n\nTry your best. If not this, then some better opportunities are waiting for you. All the best."
    },
    {
        "job_role": "Finance",
        "company_name": "Credit Suisse",
        "info": "If you're into how a private and investment bank works and how they use technologies for security, then it's the apt place.",
        "content": "FORESIGHT(2018): Summer Internship Credit Suisse | Rajdeep Biswas\n\n--\n\nListen\n\nBrief Introduction:\n\nI am Rajdeep Biswas, Final Year Undergraduate student of the Department of Electronics and Electrical Communication Engineering. I did my Summer Internship at Credit Suisse as a Financial Technology Analyst.\n\nCredit Suisse Group AG is a Swiss multinational investment bank and financial services company founded and based in Switzerland. Headquartered in Zürich, it maintains offices in all major financial centres around the world. As the second-largest bank in Switzerland, it is considered a “Bulge Bracket” bank providing services in investment banking, private banking, asset management, and shared services. Credit Suisse is known for its strict bank-client and banking secrecy practices.\n\nSelection Procedure:\n\nThere was an online written test followed by a 3 round interview.\n\nThe online written test had 40 Questions for 60 minutes. The questions were from basic Mathematics, English, Quant, and Programming.\n\nThe basic Mathematics were from ratio proportions, average, fractions, etc.\n\nThe English were some fill in the blanks, paragraph questions, etc.\n\nThe Programming was detecting errors from some lines of code, predicting the output etc.\n\nCalculators weren’t allowed for the test. So this test was a game of speed.\n\nAfter clearing the online written test, there were three rounds of interview.The first round was a Technical round where they asked questions about my CV like projects, scholarships, and skills. Also some fundamental questions from PDS like arrays, linked list are also asked.\n\nThe second round was Managerial round which was similar to the technical round, but they ask about some situations/life events of mine which was difficult to handle for me, but I was able to handle it successfully.\n\nThe final round was HR round where they ask about my interest, strengths, weakness, life goals, plans for further studies and why I want to join Credit Suisse as I am from a circuit branch with a good CGPA (9.0+) and Credit Suisse is a bank? Also, he asked me what I know about Credit Suisse?\n\nAfter giving satisfactory answers to HR, I was selected for IT profile in Credit Suisse.\n\nHow to prepare for them:\n\nBrush up 6th to 10th-grade Mathematics will be useful. Some knowledge of Algorithms and PDS will be excellent. Other sources like puzzles from Geeksforgeeks, 50 Challenging Problems in Probability will be helpful.\n\nYour Project Details:\n\nI worked on a web application that takes some input from the user then send it to the backend JAVA server that will fetch the data from the database server and then display the data to the user on the browser.\n\nThe technologies I have used were HTML, Angular 2, Typescript, Angular Material, Java 1.8, JAVA Rest Web service, JAVA Spring Framework, SQL.\n\nCompany Culture:\n\nCredit Suisse’s culture is just excellent. The first main and different thing was we were instructed not to use Sir/Madam. Yes, you read it right, no Sir/Madam. You have to call everyone in the office by their first name regardless of how much senior they are to you, but you should also have politeness in your speech and actions.\n\nThe TA seniors (Those who joined as an employee less than two years) are great, and they gave the most funda for the office and its culture.\n\nThe office timings are flexible, no in or out time monitored, however on an average you need to work around 8 hours per day.\n\nAll the managers and TA seniors are approachable for any problem. All of them encourages new ideas and questions.\n\nYou will get free office cab services from your home address to the office, but your home should be in the same city.\n\nThere were endless treats from seniors, managers, and colleagues during the internship.\n\nSecurity for employees is excellent, especially for women. There are many types of securities present here. One example is there will always be a security guard in the office cab beside the driver if there is any female employee in the cab during the evening and late-night hours.\n\nAccording to you who should ideally apply for the intern:\n\nFor employees, there is an exclusive system. The employees can change their team after each year. So if you are not so sure about your career in finance, you can join Credit Suisse in IT/Analyst and later change to Finance team.\n\nAlso if you want to learn how a private and investment bank works and how they use technologies to maintain its security, then it will be an excellent place for you.\n\nAnd finally, if you want to know your possibility or prerequisites needed for a career in Finance then go ahead.\n\nAnd what advice will you give to them:\n\nDo read about the company before going to interview. If possible, please look about 2008’s great depression and where was Credit Suisse’s position at that time. Keep calm and stay focused. Great Luck."
    },
    {
        "job_role": "Finance",
        "company_name": "Goldman Sachs",
        "info": "People who like math, quant and have an interest in financial services sector should definitely apply for this internship.",
        "content": "FORESIGHT(2019): Summer Internship Goldman Sachs | G.Vishal\n\n--\n\nListen\n\nBrief Introduction:\n\nMy name is G.Vishal. I am a 4th-year student of the Department of Computer Science and Engineering. I interned at Goldman Sachs in the Risk division this summer.\n\nSelection Procedure:\n\nFirst, there was a written test consisting of some basic programming questions and some objective type questions on Prob. Stats. and basic CS. It was followed by 4 rounds of interviews, which was based on Probability and Stats. and some puzzles. I didn’t have any programming interviews as such.\n\nHow to prepare for them:\n\nI think one can do well in the interview with some revision of the basics of Probability Statistics and having some practice on the same topic.Doing some Coding practice would also help a lot, in general. Geeks for Geeks is a good resource for both in my opinion.\n\nYour Project Details:\n\nMy project consisted of creating a new benchmarking model for the existing CVA(credit valuation) calculation system using Neural Networks. It consisted of a lot of math and also needed programming skills. I liked my project because, instead of working on some dummy project, I got to work on a project which I personally felt had a lot of scope for impact.\n\nCompany Culture:\n\nThe most amazing thing about the company is its culture. The people are really amazing, they are very approachable and friendly as well. I always felt very comfortable with them.GS has a very flat culture, which I felt was really impressive.\n\nAccording to you who should ideally apply for the intern:\n\nPeople who like math, quant and want to have an idea of the financial services sector should definitely apply for this internship, as it was surely a very good learning experience for me.\n\nAnd what advice will you give to them:\n\nI don’t think I am qualified enough to dole out advice in general :), but one thing I would like to say is that believing in oneself really helps a lot."
    },
    {
        "job_role": "Finance",
        "company_name": "Deutsche Bank",
        "info": "Everyone and anyone can appky for this company if they have a well-drafted CV.",
        "content": "FORESIGHT(2019): Summer Internship Deutsche Bank | Indresh\n\n--\n\nListen\n\nBrief Introduction:\n\nMy name is Indresh, a Fifth Year from the Department of Biotechnology and I just completed an internship at Deutsche Bank arranged by the CDC Internship Placement Drive.\n\nSelection Procedure:\n\nThe DB selection procedure is fairly straightforward. It consists of 4–5 rounds of panel interviews following a CV shortlist procedure, apart from a simple test process. The test itself is pretty simple with Quantitative Reasoning and English sections. Once the CV is shortlisted, the interviews take place along with the other companies and take up to 3 hours to get through.\n\nHow to prepare for them:\n\nFirstly, ONE DOES NOT NEED A FINANCE BACKGROUND TO SECURE AN INTERNSHIP AT DB. This is the most important point to be kept in mind. They just see how well you have done whatever you put on your CV and how they feel you would fit into their work environment. While this sort of decision is subjective at best, it allows you to be yourself through the interview process. At the same time, some proficiency in Probability, Statistics and basic Quant ability is expected of the candidate (an entire round is usually dedicated to this aspect). In short, be confident of what you have done and you should do fairly well in the DB selection process.\n\nYour Project Details:\n\nI worked on FX Hedging Methodologies while at DB. I am, however, unable to disclose more about the same.\n\nCompany Culture:\n\nThe Desk that I worked with was Fixed Income and Currencies: APAC Region, which consists of people from various backgrounds who do a variety of work, which makes it an excellent learning opportunity for someone who’s just delving into the world of finance. They are a really fun, yet at the same time, an insightful bunch with whom I spent a really great 2 months. There’s a pretty good work-life balance which allows you to enjoy not just the internship but the city of Mumbai as well so that’s a plus.\n\nAccording to you who should ideally apply for the intern:\n\nI feel everyone should apply for this Company because there is no right or wrong “profile”, per say. If you be draft your CV well enough, you should get good shortlists, although that is subjective and the only thing that may stop you short. However, upon making it to the interview rounds, as long as you’re candid with them about your expectations from the internship, there isn’t much that should stop you from making it.\n\nAnd what advice will you give to them:\n\nI don’t have any DB-specific advice, to be honest. However, to everyone sitting for an internship, be it their third or fourth year, I strongly recommend you to try out a new field; something you haven’t done in the past. College is the only time you get to explore and I hope you make the best of it.Best of luck and cheers!"
    },
    {
        "job_role": "Finance",
        "company_name": "Nomura",
        "info": "Anyone and everyone can definitely apply for this internship.",
        "content": "FORESIGHT(2019): Summer Internship Nomura’s Global markets | Pallav Bhutani\n\n--\n\nListen\n\nBrief Introduction:\n\nHi! My name is Pallav Bhutani. I am a final year undergraduate student of the department of Chemical Engineering (enrolled in its dual degree course :P). I had the chance to work in Nomura’s Global markets division during these summers. Global Markets is the ‘trading side’ of Nomura. Powai office is integrated with various trading desks most importantly Asia except Japan(AeJ) and Europe.\n\nSelection Procedure:\n\nHow to prepare for them:\n\nFor the group discussion, all you can do is form groups ideally a week before Day 1 and practice them, take feedback from the groupmates, work on it a practice again. Other companies that have a GD are ITC & HUL.For the interviews, as already mentioned above, it an interviewee led interview. The interviewers want to see your strong points and the understanding you have of the same. So if you try to impress them by your background in finance, make sure you can answer any question they throw at you (Not having a finance background helped in my case :P). They can pick up any word you have mentioned in your CV and have a 10 min discussion on it. Be clear on why you want to do finance and why Nomura is the perfect match for you. For guesstimates, you can see a couple of videos on Youtube. No need to practice for weeks but have an understanding of what it is.\n\nYour Project Details:\n\nNomura’s internship program is very well structured and a lot of importance is given to the interns there (owing to the fact that they hire recent graduates only from this program). The 2-month internship is equally divided into two teams. The work might vary from team to team. There is no single project, interns have the chance to work on multiple projects.I had the privilege to work in ‘Equity Linked Strategies’ where my work was to make multiple analysis tools related to finding outliers in various equities, convertible bonds and options. One model I made was related to delta hedging of convertible bonds and various strategies that can be used for the same. One other project was related to portfolio screening and backtesting.Both the projects were in sync with the traders in HK/Europe.In my next month, I worked in ‘Asset-Backed Securities’ strategy team. One interesting fact about the team is that it was Lehman Brothers’ ABS team before Nomura (Watch Big Short if you can’t relate). My work in ABS was to construct a screening model to find outlier ABS deals that have the possibility for rating up-gradation/degradation.Nomura also added a sideline competition for the interns which we took very seriously. The aim was to invest 1Million USD in various indices (S&P 500, Shanghai Composite etc), safe havens, crude oil etc and get the most returns at the end of the intern. As a matter of fact, our final presentation was 90% on this competition. We worked on this on weekends and absolutely loved it.\n\nCompany Culture:\n\nNomura is a Japanese bank and you can see the Japanese culture in the way work is carried out. Nomura is a very respected investment bank that takes a lot of pride in its employees. Nomura gives a lot of power to its employees, the learning curve is very steep. A lot of focus is given to the interns. There will be multiple networking lunches and high teas with the leadership team of Nomura which consists of all EDs and MDs. The exposure an intern at Nomura gets is immense. The culture is to meet as many people as you can on the floor. You are considered as an employee during your internship, I was on a call with a trader. It will not be unusual to be on a call with a client if your team does that.\n\nAccording to you who should ideally apply for the intern:\n\nAnyone and everyone. It is a misconception that Nomura hires only CFAs/FRMs or for that matter people with a background in finance. I had absolutely no exposure in finance. I clearly mentioned it in the interview. They understood and asked me on the work I have done in campus. They do not need finance guys. They need smart people that can be given responsibility. Finance you can learn, the person you are you cannot change. Finance is no rocket science and internships are for learning, Nomura understands that. So make use of this learning opportunity and start preparing for the process with grit.\n\nAnd what advice will you give to them:\n\nBe clear in what you want to do. The last thing an interviewer wants to see is a person in two minds. Have a clear understanding of why you want to do finance if you don’t have previous experience in finance. Be confident in the work you have done on campus and know everything about your past work experience. Be completely honest with the interviewers, no need to overexaggerate at any point. But definitely, know about the happenings in the finance world like US-China trade war, US- Iran tensions, Fed rate cuts etc, this will give added talking points."
    },
    {
        "job_role": "Finance",
        "company_name": "Nomura Structured Financial Services",
        "info": "This internship is perfect for anyone wanting to know how the finance industry operates,no matter one has prior knowledge in finance.",
        "content": "FORESIGHT(2019): Summer Internship Nomura Structured Financial Services | Amandeep Singh\n\n--\n\nListen\n\nBrief Introduction:\n\nMy name is Amandeep Singh. I am a third year undergraduate student from the department of Mechanical Engineering enrolled in its 4 year BTech course of manufacturing science and engineering. I did my internship at Nomura Structured Financial Services in the Global Markets division in the summer of 2019.\n\nSelection Procedure:\n\nThe process begins by applying to Nomura with one of your 3 CVs made on the CDC website. There is no hard cutoff on the basis of CG but it pays to be above 8. After you are selected on the basis of your CV, you have to appear for a GD. The topics of the GD can be anything ranging from abstract analogies for the professional world to contemporary issues. Post the GDs, there are 2 technical interviews followed by an HR interview.\n\nHow to prepare for them:\n\nDuring the technical interviews, it does pay to have some basic knowledge of financial securities, however, there is no hard and fast rule. The best thing would be to back up your CV such that you can explain the learnings from virtually every experience written on your CV. It’s also beneficial to have a decent idea about guesstimates and brain teasers. “Heard on the street” is a good book to prepare for the same.\n\nYour Project Details:\n\nApart from a lot of ad hoc and BAU work, my main project was creating a tool that could calculate Initial Margin requirements for derivative transactions underlying Bespoke CSAIDs both using SIMM and Schedule IM models. The work mostly revolved around excel and also some VBA so it does help a lot to have some decent understanding of Excel beforehand.\n\nCompany Culture:\n\nThe company culture is pretty chilled out where everyone from the analyst sitting beside you to an MD overseas lend an ear to help you with your work. You are expected to dress in formals as they have a pretty strict dress code. The best part, however, is that the timings are flexible as long as you complete the work assigned to you. The amiability and approachability of senior management is a great motivator and weekends are usually as awesome as you can imagine. Overall, the culture is amazing.\n\nAccording to you who should ideally apply for the intern:\n\nThis internship is perfect for anyone looking to get an idea of how the finance industry operates irrespective of whether you have any prior knowledge or experience in finance. The company provides a plethora of reading material to learn on your own pace once selected and you even learn on the job hence that is not an issue. Someone who already is interested in finance shoulddefinitely apply because the practical knowledge that you’d gain is in no way achieved with any course, certification you may have already done.\n\nAnd what advice will you give to them:\n\nStay calm during the technical rounds. The aim of the interviewers is in no way to intimidate or grill you. The more interested you can keep them and steer the interview into a conversation, the better your chances. Stay to the point during explaining your past experiences and try to weave your CV into a story wherein you show how an internship or a project reinforced your belief about joining the industry. Most importantly, just try and smile. It does wonders!"
    }
]