[
    {
        "job_role": "FMCG",
        "company_name": "P&G",
        "info": "Revising fundamental concepts of your core engineering discipline for a couple of weeks before the process starts can prove advantageous. Familiarity with supply chain management basics can be beneficial.",
        "content": "FORESIGHT(2024) : Internship at Procter & Gamble | Kalidindi Rohan |\n\n--\n\nListen\n\n1)Brief introduction and description of offered role\n\nHello, I am Kalidindi Rohan, a 4th year undergraduate student from the Department of Industrial and Systems Engineering enrolled in its Dual Degree course. As for my involvements on campus, I was a CDC Departmental Representative and a Student Placement Coordinator at the Career Development Centre. I am from Hyderabad, Telangana.\n\nI received an internship offer from Procter and Gamble (P&G) in the product supply role for the summer of 2024 and I am currently interning with them at their Mandideep plant.\n\n2) How did you get into Procter & Gamble ? What was the selection procedure?  P&G is one of the world’s largest consumer goods companies and is one of the major recruiters in the FMCG domain from IIT Kharagpur. Its selection procedure consists of 3 stages:\n\nPsychometric test:\n\nThis assessment comprises situational questions designed to evaluate your personality traits and alignment with P&G's values, measuring if you are a potential fit to the company's work culture. Additionally, it includes mental ability challenges featuring various tasks like grid challenges, digit challenges, switch challenges, etc. These challenges consist of multiple difficulty levels, requiring you to achieve as many correct responses as possible within a limited time frame.\n\nGroup Discussion\n\nInterview\n\n3) How to prepare for them?\n\nThe psychometric test comprises mental ability questions, so there isn’t anything specific to prepare for them. However, going through some basic puzzles, practicing rapid math, and similar exercises would be beneficial. The second test focuses on situational and behavioral questions, emphasizing the importance of maintaining consistency while aligning responses with the company’s values. Reviewing P&G’s principles and values on their website would be beneficial. During the group discussion round, situational questions prompt candidates to draw from their past experiences, including positions of responsibility, projects and internships. Responding to these questions in a structured manner, aligning with P&G’s values would be helpful. In the interview phase, questions typically revolve around projects listed in your CV. This stage presents an excellent opportunity to express your enthusiasm for joining the firm and engage the interviewer by asking questions about the firm.\n\n4) When did you start preparing for this role and according to you what is the ideal time for aspirants to begin their preparation?\n\nThere isn't a specific preparation strategy for the FMCG profile. However, revising fundamental concepts of your core engineering discipline for a couple of weeks before the process starts can prove advantageous. Familiarity with supply chain management basics can be beneficial.\n\n5) What difficulties did you face while preparing for this Company/Profile? How did you overcome them?\n\nThe selection process for FMCG roles varies across companies. For instance, P&G prioritizes cultural alignment and the candidate’s ability in situation assessment and decision-making. But the process is different in case of HUL, ITC. Personally engaging with seniors who have interned or secured positions in FMCG firms proved to be a valuable resource for me.\n\n6) Are there any specific requirements such as department, CGPA, or other criteria for this position? Additionally, do certain PORs or EAAs enhance one's chances of securing this internship?\n\nAt P&G, the department of the candidate is not a determining factor, and individuals from various departments have successfully made it through the selection process. While a strong CGPA is advantageous, it's evident from the shortlist that it's not the sole criterion considered. P&G values candidates with well-rounded CVs, emphasizing not only academic excellence but also involvement in extracurricular activities and campus engagement. Additionally, possessing managerial experiences on campus is highly regarded, as the company seeks individuals capable of eventually managing production lines.\n\n7) According to you, who should ideally apply for this job?The Product Supply position at P&G offers a wide-ranging scope, focusing on innovation-driven optimization efforts. The candidates would be given a deep understanding of industry intricacies to devise solutions for diverse challenges. It suits individuals who enjoy tackling large-scale problems.\n\n8) What are some of the major points you think would be valid to mention in CV while targeting this profile?\n\nMentioning positions of responsibilities on campus and extracurricular activities would be helpful as students with good managerial experiences and diverse skills are preferred. Also mentioning projects related to supply chain and utilization of optimization techniques would give an upper hand.\n\n9) Lastly, what advice would you like to give to the students aiming to grab CDC internships this year?\n\nI recommend gaining a clear understanding of your preferred profile and ensuring you have a backup option is a must. Given the lengthy and hectic process, maintaining composure and patience is crucial. Regularly seek guidance from seniors who have experienced similar situations and pursued similar career paths, as their advice can prove invaluable at every stage. Remember, securing an internship offer is just one milestone in your journey at KGP, so it's not worth excessively stressing over. Wishing you best of luck for the drive, I hope your efforts pay off!!"
    },
    {
        "job_role": "FMCG",
        "company_name": "ITC",
        "info": "They check how we can implement the projects we have done in their company. However, if one wants to prepare for any FMCG role, one needs to be thorough with your CV, have a good grasp of basic physics and chemistry, look at guesstimated, and have a diverse profile. Apart from this, you need to have good decision-making skills and on spot-thinking, as the HR round was very tricky and logical.",
        "content": "FORESIGHT(2023): Summer Internship at ITC | Vardhan |\n\n--\n\nListen\n\n1) Brief Introduction\n\nI am Vardhan, 4th year UG student from the Department of Chemical Engineering enrolled in its Dual Degree Course, pursuing a minor in CS and micro in AI and EP. I am a boarder of RP Hall. I am from Visakhapatnam, Andhra Pradesh\n\n2) How did you get into ITC? What was the selection procedure?\n\nITC is one of the leading FMCG companies in India. The selection procedure focuses more on the diversity of the profile and how much of a fit you are for the company. There were, in total, three rounds; firstly, we needed to fill out a form, which is very important to get a shortlist; next, we had a group discussion round followed by a PI. In the PI, there were two rounds, first the HR round followed by a technical round.\n\n3) How to prepare for them?\n\nI prepared nothing in particular for ITC; they check how we can implement the projects we have done in their company. However, if one wants to prepare for any FMCG role, one needs to be thorough with your CV, have a good grasp of basic physics and chemistry (as I was asked questions in this domain), look at guesstimated, and have a diverse profile. Apart from this, you need to have good decision-making skills and on spot-thinking, as the HR round was very tricky and logical.\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nThe problem I faced during preparation is that there is no particular topic on which ITC questions (for example, a software company mostly focuses on CP, which isn’t the case with FMCG roles). To overcome this, the best way is to be thorough with the CV and also about the company and how you can add value to the company.\n\n5) According to you, who should ideally apply for this job?\n\nIn my opinion, people with good decision-making skills and a diversified profile should give a shot at this company. Also, according to the previous statistics, ITC prefers CH, ME, EE/EC students over other departments.\n\n6) Any specific advice you want to give to the junta sitting for internships this year.\n\nThe process will be long and hectic; you might feel like giving up and feeling worthless, but don’t let any of this let you down; having a peer group would always cheer you up, and you cheer them up when they require you. Once the process is over, you will feel so relieved, and on that day, thank everyone who was with you!\n\n7) What are some of the major points you think would be valid to mention in your CV while targeting this profile?(any specific suggestions you would like to make?)\n\nFor this particular profile, I suggest you focus on the projects and internships (a minimum of 3) and mention your PoRs (a minimum of 3 again), a major talking point in the HR round."
    },
    {
        "job_role": "FMCG",
        "company_name": "HUL",
        "info": "Preparation included practising cases with seniors and batchmates and revising basic concepts of supply chain which were covered in the course Logistics and Supply Chain Management of Industrial department. Else one can also take a good look at the book : Supply chain Management by Chopra and Meindl.",
        "content": "FORESIGHT(2023): Summer Internship at HUL| Sravani Gopi|\n\n--\n\nListen\n\n1) Brief Introduction and description of your offered role.\n\nHi ! I’m Sravani Gopi, a fourth year undergraduate student of the department of Industrial and Systems Engineering. I will be interning at Hindustan Unilever Limited this summer as a Supply Chain Intern .\n\n2) How did you get into Hindustan Unilever Limited? What was the selection procedure?\n\nWe had to go through 4 brief set of tests that filtered out people at each level . First was a psychometric test and the later was a form that contained questions related to past experiences and what leadership means to that person and how the company’s values align with those of anyone attempting the test. Third test was a video case study round which had basic supply chain case questions and one has to answer them within the time frame and in a concise and punctual manner which was tough as in my case I had to answer 4 questions and each question has very limited time to be answered and solved. But since I had good practice of cases and had good knowledge of supply chain concepts I made it through the round . The last round was obviously a personal interview where in my case the interviewer was very tough on my project which was supply chain related and also on my coursework information. He kept digging more and more onto minute details that I mentioned related to subjects or any technical term that I’ve used and expected me to dwell more on the details that he asked . He also gave me an instant case and asked me to solve it given that I knew supply chain basics . The interviewer tried to overwhelm me with more and more questions and details but one should try to keep their cool and maintain good communication with the interviewer which I felt were detrimental for me to pass the last round .\n\n3) How to prepare for them?\n\nPreparation included practising cases with seniors and batchmates and revising basic concepts of supply chain which were covered in the course Logistics and Supply Chain Management of Industrial department. Else one can also take a good look at the book : Supply chain Management by Chopra and Meindl.\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem\n\nFor me the main difficulty I faced in the preparation process was chalking out a good solving strategy for the video case study round . As one would be given only a minute or two to read and solve the question and close to 4 or 5 minutes to speak and walk through the answer . This was the toughest part as while practising with few practice questions myself I felt the difficulty in winding up my answer within the given time and keeping my answer short and precise. But practice made my answers better and concise .\n\n5) According to you, who should ideally apply for this job?\n\nIf you are someone who is very intrigued by how supply chains work and If your values align with HUL you definitely have a good go . Ps : HUL values leadership a lot ! In terms of CGPA one should maintain a minimum CGPA of 8 or above .\n\n6) Any specific advice you want to give to the junta sitting for internships this year.\n\n7) What are some of the major points you think would be valid to mention in your CV while targeting this profile?(any specific suggestions you would like to make?)"
    },
    {
        "job_role": "FMCG",
        "company_name": "HUL",
        "info": "The key is to convince the interviewer that you are capable enough of molding yourself to this type of role given how you have done the same in past (with your real-life experience).",
        "content": "FORESIGHT(2023): Summer Internship at HUL| Hari G|\n\n--\n\nListen\n\nBrief Introduction\n\nHey everyone. My name is Hari G, I am a 4th year undergraduate student in the Department of Ocean Engineering and Naval Architecture enrolled in its Dual Degree course. I am a boarder of the Nehru Hall of Residence. In the past, I have worked on various interns and projects related to the field of Machine Learning & Data Science.\n\nHow did you get into Hindustan Unilever Limited ? What was the selection procedure?\n\nThere are 3 stages to the selection process :\n\n1. Google Form\n\n2. HireVue Test\n\n3. Interview\n\n1. Google Form :\n\nOnce you have applied in ERP with your CV, you will get a Google Form from the company that needs to be filled. It will have 5 sections (Your Basic Info, Your Achievements, Your Hobbies, Psychometric Questions, Reviewers). The answers to the questions is given in a subjective format with word limit of 150 characters.\n\n2. HireVue Test\n\nOnce you get past 1st round, you will be sent a test link in the name of HireVue Test. Details of the HireVue Test:\n\nTest Duration : 15mins\n\nTest Window : ~ 1 day\n\nQuestions : 3\n\nBreakdown : 1 min (for question narration) + 1 min (for thinking through the solution ) + 3mins (for answering the question)\n\n3. Interview\n\nOnce you clear the HireVue test, you will be notified about the interview. There is only 1 interview which lasts for ~30–40mins. Here questions were of 3 types : Department-related, CV-related, HR.\n\nHow to prepare for them?\n\n1. Google Form :\n\nWith this form, they look out for your character and credibility. There is no time limit for the form. So you should take time and answer each question as best as possible. Answer each question as exhaustive as possible. Make sure your answers aligns with the company’s values (which you should go through and consider while writing your answers).\n\nIn case of reviewers, you are required to submit contact details of people who know best about you from internships such as your manager, your faculty advisors etc.,.\n\n2. HireVue Test\n\nEach question was from different domain. One of the questions was strategy-related, other two were more industry-related. To prepare for this test, going through the role and trying to have a general knowledge on the technologies and procedures related will help. Also, doing a bit of case study will help when it comes to strategy related questions.\n\n3. Interview\n\nGoing through your department courses will be very necessary since the questions start from there. If your department isn’t related to the role, then refer one of the Mechanical Department courses (such as Thermodynamics / Fluid Mechanics).\n\nFor supply chain, you can go through the Supply Chain Management course slides from Industrial Engineering Department (In my case, I wasn’t questioned on these concepts)\n\nTo prepare for HR questions, refer to Divyam Sharma’s Medium articles and some general HR questions. The questions covered there were exhaustive enough. I would recommend to write answers for those questions and have it prepared in case you are not sure of your performance. Again, for these questions try to go through the job description and answer based on the requirements for the role.\n\nLink : https://medium.com/@divyamsharma_iitkgp\n\nDuring the entire interview, the aim is to ensure that the interviewer is always focused towards the answers. Therefore you should be confident in the interview and provide answers calmly and clearly.\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nIn my case, my department and my CV (ML-oriented) is not related to the role. Therefore during my interview, I was questioned on my ability to perform well in the role. The key is to convince the interviewer that you are capable enough of molding yourself to this type of role given how you have done the same in past (with your real-life experience).\n\nAccording to you, who should ideally apply for this job?\n\nIf you have a flair for management and collaborating with multiple teams is something you are interested in, then this is ideal for your role. This role isn’t more technical in terms of requirement for hard skills.\n\nAny specific advice you want to give to the junta sitting for internships this year?\n\nThere is no set of rules for getting selected in this role as the selection process is more subjective from the start. Supply Chain Management roles primarily intake students from the Circuital / Industrial / Chemical / Mechanical Department. So if you don’t belong to these departments, then apply for this role only as backup.\n\nJust to give a perspective, this year (2022–23), the intake of HUL has increased to 5 people from 1 person last year.\n\nTherefore if you don’t get selected for this role, don’t worry. There are multiple other companies with other roles and good offers in subsequent days.\n\nWhat are some of the major points you think would be valid to mention in your CV while targeting this profile? (any specific suggestions you would like to make?)\n\nIn Hindustan Unilever Limited, the selection program is called Unilever Leadership Internship Programme (ULIP) . For this role, internships and Position of Responsibility are valued equally. If you can justify yourself with work you have done in your internships and societies from a leadership standpoint ( such as by giving real-life examples for your communication skills) , that will be enough."
    },
    {
        "job_role": "FMCG",
        "company_name": "ITC",
        "info": "Linear thinking and simple case solving can be practiced to ensure a solid performance in the GD.",
        "content": "FORESIGHT(2023): Summer Internship at ITC | Aditya Uppal |\n\n--\n\nListen\n\n1) Brief Introduction\n\nMy name is Aditya Uppal. I am a third year undergraduate from the mechanical engineering department. As for my involvements on campus, I was the CDC Departmental Representative of the Mechanical Engineering department as well as a part of AGV and Encore.\n\n2) How did you get into ITC? What was the selection procedure?\n\n3) How to prepare for them?\n\nThe Google form basically collects your academic track record in addition to your motivation to join the company. I suggest writing concise and crisp answers, strongly highlighting why you want to work for ITC and how you shall be able to contribute to the same. It may come as a bummer to some but SGPA is also taken into account in addition to CGPA. Consistency is rewarded. The GD is there to test your communication skills as well as your ability to translate problems into smaller, more digestible bits. Linear thinking and simple case solving can be practiced to ensure a solid performance in the GD. The topics mentioned on your CV, especially from your core department, have to be prepared thoroughly as they might be asked in the interview. Ensure that you are thorough with at least 3 topics from your depth curriculum. The HR round is fairly straightforward and tests your quick thinking and reasoning ability. I was presented with the task of employing what I have done in my previous internship at IISc in a real life scenario in the final interview.\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem\n\nAccording to me the most unpredictable part of the whole process is the first shortlist, that is after the Google Form. There is no specific criteria on which you are judged, so you can not necessarily predict if you’ll be shortlisted or not. Having a decent CGPA helps a ton but giving solid answers for your motivation to work at the company will also be a major role. Ensure that you take advice from your mentors/ seniors.\n\n5) According to you, who should ideally apply for this job?\n\nITC offers interns the ability to work on large, real life problems which can offer an extremely enriching experience with a steep learning curve. It truly is an experience and I would suggest everyone who has the will to make a difference to consider applying to the job. The projects you get are based on your strengths and points highlighted in your interview/CV.\n\n6) Any specific advice you want to give to the junta sitting for internships this year.\n\nI would suggest having at least one project in core/field you want to work in. It greatly helps in driving the interview as well as ensures that the interviewer does not deviate too much and ask questions which are either too difficult or irrelevant. It also helps in covering up gaps in your preparation of core topics. In addition to this being confident, having a positive outlook as well as a no-nonsense approach to answers will get you a long way. All the very best, internships are just a very small step in the long journey that awaits you all. Don’t fret, you got this.\n\n7) What are some of the major points you think would be valid to mention in your CV while targeting this profile?(any specific suggestions you would like to make?)\n\nAs I mentioned before, have some projects and prepare them thoroughly. Think of real life applications of the same so that you can tie that in during the interview. Mention academic courses very carefully as you can be grilled on the same. Prepare theory of the courses you have mentioned at the very least. PORs help, but are not necessary as I did not have any specific POR when I sat for the internship process."
    },
    {
        "job_role": "FMCG",
        "company_name": "AB InBev",
        "info": "Students with good PORs and leadership experience targeting managerial roles in the future can apply for this profile.",
        "content": "FORESIGHT(2022): Summer Internship at AB InBev| Sumit Kumar\n\n--\n\nListen\n\n1) Brief Introduction\n\nI am Sumit Kumar, a 4th-year dual degree student from the department of Agricultural and food engineering with an M.Tech specialization in Artificial intelligence and machine learning applications at IIT Kharagpur. I am from Bhiwani, Haryana. I have an interest in programming and web development. I am quite engrossed in watching and playing several sports and have been an integral part of IIT Kgp’s cricket team for the past 3 years.\n\n2) How did you get into AB InBev? What was the selection procedure?\n\nTest round -\n\nGroup discussion round -\n\nSome possible topics of discussion can be:\n\nInterview round -\n\n3) How to prepare for them?\n\nTest round -\n\nPrepare all types of questions mentioned above. This stage is much easier for ABI as compared to most of other companies.\n\nGroup discussion round -\n\nGo through their website and attend the PPT to have an idea about the company.\n\nInterview round -\n\nPrepare your CV in detail and be sure of all the points that it reflects. As the interview will also have HR questions like your introduction, why do you want to join ABI? Your long-term career goals? etc., prepare these questions as well.\n\nProactiveness and ownership is highly valued in the interview. PORs, EAAs could give you such instances to cite from. You can also justify this using any past internship experience or project, whatever you are comfortable with.\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nI could not attend the PPT and also forgot to go through their website before the GD. Fortunately, I was able to handle the GD deftly. But I sensed that my peers used their knowledge about the company to their advantage. So doing the 2 tasks mentioned above will definitely help you.\n\nI visited their website before the PI and went through some recent articles. It helped in answering some of the questions. Reading about beer and the beer industry will also benefit you in structuring your answers in a more professional way. Driving the conversation forward is important in the interview, so try to be elaborative in your answers.\n\n5) According to you, who should ideally apply for this job?\n\nABI comes with an open profile. They assign students to live projects in their organization partially based on their past projects and internships. Therefore, past projects will have a slight effect on the internship task assigned.\n\nBased on interest, students inclined towards data science and web development can apply. Also, students with good PORs and leadership experience targeting managerial roles in the future can apply for this profile.\n\n6) Any specific advice you want to give to the junta sitting for internships this year?\n\nThe primary focus should be on acing your coding tests. Preparations for them would be similar for the majority of the companies, so that needs to be settled first. Then you can move on to preparing for interviews and further selection processes of the companies you wish to target.\n\n7) What are some of the major points you think would be valid to mention in your CV while targeting this profile? (any specific suggestions you would like to make?)\n\nIn the first place, describe all your projects and previous internships thoroughly in your CV. That will have a substantial impact throughout the process.\n\nNext, for some situation-based questions, like — Tell me about a time when you handled a disagreement as a team, tell me about a time you failed and what learnings you got from it, etc., having suitable PORs and EAAs where you dealt with such situations would really help.\n\nLastly, fill the entire page for your CV. Try to find anything that seems valuable enough to be added to it. Filling it with the least significant points will still be more cordial than leaving empty spaces at the bottom."
    },
    {
        "job_role": "FMCG",
        "company_name": "ITC",
        "info": "The role is Techno-Mangerial based, so people who want management-based jobs and experience without leaving their technical background completely",
        "content": "FORESIGHT(2022): Summer Internship at ITC | Ayush Sahoo\n\n--\n\nListen\n\nBrief Introduction\n\nHey, this is Ayush Sahoo, I just completed my third year in Instrumentation Engineering of the Electrical Department. I have been selected for the KITES ITC internship via CDC, IIT Kgp and I am willing to share some important information regarding the same,\n\nHow did you get into ITC? What was the selection procedure?\n\nThe complete process is summarized as under:\n\n1. Online Application: Interested students are required to apply through an online portal where a form is required to be filled out. The form essentially requires details from your resume and some essay-type questions to be answered mentioning your goals and motivation to join ITC.\n\n2. Shortlisting: Based on the form filled, a shortlist is issued for the psychometric test. The information that you fill in this form is reassessed at various stages from your personality test to the point then you actually join one of the divisions of ITC and serve as a medium for the company (and especially your guides and mentors) to know you.\n\n3. Psychometric Test: This test is designed to evaluate your intelligence, personality and decision-making skills through some situational questions. The aim is to check if you are a good fit for the company’s work environment or not. The rejection rate at this stage is negligible and you will pass through unless you decide to deliberately screw it up.\n\n4. Group Discussion: The students selected from the psychometric test are divided in groups of 7–8 for the group discussion round. This stage of the selection procedure is designed to judge your people handling and convincing skills. The reading time given to you is about 5 minutes, hence, you need to be really quick in grasping the essence of the problem and coming up with logical arguments. The problems may range from discussing upcoming business strategies for a product or simply just discussing the best course of action after an accident. These case problems do not require any prior preparation but you are expected to be logically sound in your arguments and be able to convince your audience for the same. The number of students selected from a GD is not fixed and may range from 1–4 per GD.\n\n5. Personal Interview: This is the last stage of the selection procedure and in my opinion the most interesting one, the reason you’ll get to know in the following paragraphs:\n\na. Technical Round: Based on your CV they ask random questions, I had a core profile in electrical engineering and also practiced quite a bit of CP earlier from January, but I was asked questions mostly from the core electrical domain and real-life problems based on core electrical engineering\n\nb. HR Round: This round is basically an interaction between the student and some senior officials from the company who are interested in knowing your interest in working with them.\n\nHow to prepare for them?\n\nI think the CV shortlisting criteria is purely based on CGPA, apart from this having a good grip over the core subjects is quite important to crack the technical rounds. Apart from that if you have mentioned other things like data structures, CP, ML, etc too in your core CV(if they are linked in any way to the projects that you have done) then questions might be asked from those fields as well.\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nFor me the problem was mainly in GD, I did not have much prior experience in this but I believe the topics are intuitive and if we are able to articulate well and convey our points then it’s easy to crack. One point to be kept in mind is that there is no actual winner or loser in a discussion, just put your point of view to HR as to why you feel your suggestion would sustain in the scenario.\n\nAccording to you, who should ideally apply for this job?\n\nThe internship role is Techno-managerial based, so people who want to pursue management-based jobs or are interested in the same can have good kickstart and experience while interning at ITC, without leaving their technical background completely.\n\nWhat are some of the major points you think would be valid to mention in your CV while targeting this profile? (any specific suggestions you would like to make?)\n\nThe most important thing which I believe is you have to be thorough with your CV. The interviewer asks for every single detail that we mention, so no point writing things in which you are not confident about. Hence, mention only the relevant projects or previous internships in which you have complete surety and credibility.\n\nAny specific advice you want to give to the junta sitting for internships this year\n\nI think the selection process is refined enough to check each and every aspect for the profile. Personally, I didn’t have any previous internships in the supply chain/ management domain, so there is no such hard and fast rule to have the same but as I said early if we have mentioned projects or internships based on any field eg core, software, etc. we have to thorough with each and every aspect of it because companies like ITC have branches in nearly every category starting from FMCG to IT as well as healthcare."
    },
    {
        "job_role": "FMCG",
        "company_name": "Piramal",
        "info": "Piramal offers projects in the field of Business Scale using core engineering principles and Strategic Projects in the field of Logistics & Supply Chain",
        "content": "FORESIGHT(2022): Summer Internship at Piramal| Sankalp Bose\n\n--\n\nListen\n\nBrief Introduction\n\nHi, My name is Sankalp Bose, I’m a 3rd-year undergraduate student from the Department of Chemical Engineering (B. Tech).\n\nI am currently interning at Piramal Pharma Solutions, Riverview, Michigan as a GEL Intern in the field of Supply Chain & Logistics.\n\nHow did you get into Piramal? What was the selection procedure?\n\nSo, Piramal recruits for it’s Global Emerging Leaders (GEL) Internship Programme from the old 5 IITs only. There are 3 rounds of selection post a general CV shortlist. The first round is a gamified assessment testing your analytical skills followed by a GD round and finally a Personal Interview. Do note, that as of last year, they only recruit students from the Chemical Engineering Department.\n\nThe gamified assessment is similar to the one FMCG firms conduct for hiring and hacks can be found on YouTube to ace the same.\n\nThe GD is based to test your personality and evaluate a role-fit for a management/leadership role. Unlike general GDs, in our case, every candidate was given 1.5 minutes strictly to introduce themselves, answer a situational judgement case study question (FMCG hiring 101) and tell them something we were passionate about.\n\nMy personal interview was taken by a Senior VP & an HR. It revolved mostly around my CV. There were a few simple questions related to basic core principles and a few regarding Supply Chain & Business Strategy as I had mentioned it on my CV. The HR would stress more on your communication skills and the POR/Extracurricular section.\n\nHow to prepare for them?\n\nA well-balanced CV with spikes in a few sections would be sufficient to get an initial shortlist. There is no CGPA cutoff/bias. One needs to have decent communication skills to clear the rest of the rounds. Decent knowledge of either core principles or relevant Supply Chain theory is important to clear the Personal Interview Round.\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nThe only concepts you need to be well-versed with include your core principles/Supply Chain concepts. I chose the latter, hence it would be beneficial if you read up a few problems and concepts related to general Supply Chains along with latest news, technological developments in the Pharma industry. Research well about the firm and develop reasoning as to how you can solve problems relevant to the firm with skills mentioned in your CV.\n\nAccording to you, who should ideally apply for this job?\n\nPiramal offers projects in the field of Business Scale using core engineering principles and Strategic Projects in the field of Logistics & Supply Chain. Hence, students who are interested in either should be an ideal fit. The company culture is worth pointing out and the stipend provided is quite attractive if that falls under your consideration.\n\nAny specific advice you want to give to the junta sitting for internships this year.\n\nThis period was honestly the most stressful point during my KGP life. Hence, I would lay a lot of emphasis on students to please take good care of themselves during the same. Please reach out to your family, friends & seniors at any point of time and keep yourself motivated even if you do not secure an internship in the first week. Fantastic opportunities are waiting for you, hence please do not give up and keep up the grind. Wishing you all the best for the same!\n\nWhat are some of the major points you think would be valid to mention in your CV while targeting this profile?(any specific suggestions you would like to make?)\n\nPlease review your CV thoroughly with your seniors and be extremely well versed with every word written. Specifically for this role, highlight the impact you’ve created in your projects, achievements and showcase your management skills through your POR & Extra-Curricular Sections. If there are any internships/competitions that are relevant to the Pharma/Supply Chain field, it would be an added plus to talk about during your interviews."
    },
    {
        "job_role": "FMCG",
        "company_name": "ITC Limited",
        "info": "If you want a first-hand experience of industrial/factory training in a extreme time crunch, then ITC offers a great oppurtunity.",
        "content": "FORESIGHT(2018): Summer Internship ITC Limited| Harsh Saraf\n\n--\n\nListen\n\nBrief Introduction:\n\nI am Harsh Saraf, a Final Year B.Tech Undergraduate in the Department of Mechanical Engineering. I did my summer internship in the Chocolates Category of ITC Limited — Foods Business Division in Bangalore.\n\nSelection Procedure:\n\nThe summer internship program that ITC offers is called the KITES program (Knowledge, Initiative & Talent Excellence Series). The entire process consists of 4 stages: KITES Application Form and CV Submission, Psychometric Test, Group Discussion and 2 rounds of Interviews spanning over roughly 7–10 days.\n\nHow to prepare for them:\n\nPractice general topics asked in the GD round with a group of friends/wingmates at least twice or thrice to get comfortable with the concept.\n\nFor interview rounds, revise core subjects taught in the curriculum such as Fluid Mechanics, Thermodynamics, Mechanics and Dynamics along with its application in today’s industry. Do not go into a lot of depth but have a good understanding of each of them and about the major and important derivations. You might or might not be asked in-depth questions on them but it entirely depends on the interviewer. Be thorough with the most common HR and personality questions.\n\nYour Project Details:\n\nMy project was in the Chocolates Category in the Foods Business Division. ITC manufactures a luxury brand under the name of Fabelle. My project was operations-related to the luxury chocolate bars that they manufacture. The plant and its operations were very labour intensive and my major part revolved around increasing the overall productivity of the line. The other part of my project was experimental where I had to work on increasing the liquid centre filling in the chocolate bar.\n\nCompany Culture:\n\nThe projects are very carefully chosen and are designed in such a way that it provides a lot of learnings to both the candidate and the company. The intern is given complete freedom to utilise the resources as per his/her requirement without any restrictions. The projects given are often very critical and can create a significant impact and hence if successful are often implemented at the very moment. As an intern, you are given utmost importance and provided with all resources as necessary.\n\nEverybody is very cooperative and helpful. It is up to the intern to try to maximise the information you can extract from their guides, managers and other experienced employees.\n\nAccording to you who should ideally apply for the intern:\n\nIf you’re interested in the applications of the curriculum taught on an industrial scale and want to get a first-hand experience of industrial/factory training and working with an extreme time crunch, then ITC offers a great opportunity. However, the internship will push you to your limits and outside your comfort zone and if this is something which you don’t wish to experience then it might become a burden.\n\nAnd what advice will you give to them:\n\nBe thorough with each point mentioned in your resume. Don’t try manipulating points as they interviewers are more often than not alumnus of KGP or people who has been through the same process. So there is no hiding anywhere. Get in touch with as many graduates who have been working in the company to get an idea about the job description and make sure it aligns with your likings and interests.\n\nThe tests, interviews and even the internship will be a great experience altogether irrespective of where you do it, try having fun.\n\nCheers."
    },
    {
        "job_role": "FMCG",
        "company_name": "ITC",
        "info": "For someone wanting know how a corporate life is and how big organizations operates, can surely apply.",
        "content": "FORESIGHT(2019): Summer Internship ITC | Rajat Goel\n\n--\n\nListen\n\nBrief Introduction:\n\nHi! I am Rajat Goel, I did my Internship at ITC during the summers of 2019. ITC is one of India’s foremost private sector companies with a market capitalization of INR 3.74 trillion and a turnover of INR 550 billion. ITC is rated among the World’s Best Big Companies, Asia’s ‘Fab 50’ and the World’s Most Reputable Companies by Forbes magazine and among India’s Most Valuable Companies by Business Today. ITC has a diversified presence in FMCG, Hotels, Paperboards & Specialty Papers, Packaging, Agri-Business, and Information Technology.\n\nSelection Procedure:\n\nFor the students of top-notch colleges (IITs, IIMs etc.), a program names KITES is launched every year. The selection procedure of ITC is a bit comprehensive.\n\nHow to prepare for them:\n\nThe answers to the fields asked in the internship application form should be honest. For Psychometric Test, the key is to read the questions carefully, you’ll find same questions asked in different manners multiple times just to check the mental stability of your mind. For the GD round, my advice is to search for a few case GD topics online and practice with your friends on the same. This will help a lot during the final GD. I firm grip on core subjects (the applicant should be ready with 2 strong subjects) and conceptual clarity is required. Knowledge about the accomplishments written in the internship form (like the past internship work, academic project) is must for the interviews.\n\nYour Project Details:\n\nI was working in the Agri-Business Division of ITC at Guntur, Andhra Pradesh where my major project was to Digitalise a Spice Processing Facility up to Industry 4.0 standards. This was a critical project as a capital expenditure of about 175 Cr INR was at stake. The project demanded thorough knowledge of Spice Processing as well Digitalisation Trends being adopted across industries so I planned and visited many ITC/non-ITC plants located in different parts of the country including Bangalore, Pune, Chirala etc. This was a really enriching experience and the best part is all your travel expenses are handled by ITC itself. I also contacted international vendors through video conferences for fixing deals and budget finalisation. For these jobs, I was working at the Agri-Business Division HQ at Guntur. Apart from this I was also assigned 2 minor projects related to facility’s construction phase.\n\nCompany Culture:\n\nThe work culture at ITC is very professional. The corporate exposure that one gets at ITC is unmatchable in my opinion. People treat you equal to themselves and give importance to your ideas/inputs instead of treating you like some students who are still studying. Each and every project is very well thought upon. You are given a feeling of ownership towards the project which makes you more dedicated towards it. The thing that I liked the most at ITC was “Appreciation for Talent”, people acknowledge your efforts for any job which makes you feel motivated to deliver more. Apart from this with a brand name like ITC attached with you, international firms and organisations respect your designation which also adds to your corporate profile for any future endeavours. For future interns, you’ll enjoy a grand welcome party cum workshop during March/April for the Intern Summit at Bangalore in one of the finest Luxury-Collection Hotel of ITC (ITC Windsor).\n\nAccording to you who should ideally apply for the intern:\n\nIn my opinion, someone who wants to experience corporate life to the fullest, learn how big organisations work should definitely seek for an internship. Someone who wants to utilise the opportunity instead of enjoying 2 months away from home should seek for the internship. Someone who not only wants to learn but also make an impact by his/her contribution should definitely seek for an internship.\n\nAnd what advice will you give to them:\n\nWhen I got Guntur as my internship location, I was sad as it is not a very great city to chill out. But now I feel it does not matter at all; what matters at the end if the experience, knowledge and exposure that you take from the internship. Also, students focus on the high stipend that ITC pays; it is to be understood that if such a high amount is being paid the same amount of efforts should be visible from your side. Even if you contribute a little, they’ll acknowledge your efforts and surely will offer you a PPO. Last thing, Keep Calm, SAB PEACE HOGA. Day-1/Day-10 kuch fark nahi padta. BE MOTIVATED!!"
    }
]