[
    {
        "job_role": "Markets",
        "company_name": "Credit Suisse",
        "info": "Anyone who's looking to explore avenues in Quantitative Finance should apply for this internship.",
        "content": "FORESIGHT(2018): Summer Internship Credit Suisse| Shweta Gupta\n\n--\n\n1\n\nListen\n\nBrief Introduction:\n\nI am Shweta Gupta, a final year student, specializing in Financial Engineering. I have recently completed my summer internship in Market Liquidity & Risk Management(MLRM) profile at Credit Suisse, Mumbai.\n\nSelection Procedure:\n\nCredit Suisse has a very reasonable selection procedure and gives equal opportunity to all the departments. The whole procedure tests quantitative aptitude and problem-solving skills. Knowledge of Finance gives an edge but is not mandatory and the company provides sufficient training to enable understanding and completion of the project. The selection procedure consists of four steps:\n\nStep 1: CV Shortlisting. The company shortlists a good number of candidates for the written test and there is no fixed CG criteria as such.\n\nStep 2: The Test. The selection test conducted is very unique and is the most important factor in the selection process. It mainly consists of subjective questions centred around Probability & Statistics, Partial Differentials, Integrals and a few basic questions from Finance(typically Derivatives). Presenting the solution properly is of prime importance as the approach adopted for each question is critically judged.\n\nStep 3: The Interviews. After the test, the selected candidates have to go through two rounds of interviews, depending upon the candidate. The interview starts with discussing the test questions(primarily the unattempted ones) followed by a few puzzles and CV based questions. There is no ideal way of preparing for these interviews as these depend a lot on the individual’s profile as well as your conversation with the interviewers. Prepare your CV well and keep your mind fresh. The interviewers are very helpful and will guide you in case you stutter sometimes.\n\nStep 4: HR Interview. Again, there is no straightforward technique to prepare for this. All you can do is have a look at some common HR questions. Asking a lot of questions is key in this round, as well as this internship.\n\nHow to prepare for them:\n\nStudy the relevant topics from Iyengar, Montgomery, Class Notes and practice puzzles from Heard on the Street, 50 Challenging Problems in Probability. For questions based on Finance, a basic understanding of Derivatives from Investopedia/Khan Academy or other online sources would be sufficient. If you are a Financial Engineering student or have some background in Finance, be well versed with all the completed courses/internships.\n\nYour Project Details:\n\nAll interns are assigned different teams and different projects. There is a lot of variety in projects across different teams, each requiring a different skillset. My project was under the Solutions Methodology Team which works on developing and implementing Market Risk Methodologies for Rates, FX & Commodities. I had to document the Interest Rate Curve Construction details for Emerging Market Economies which required understanding their framework and the products involved.\n\nCompany Culture:\n\nTotally in love with the company culture! The work hours are flexible and require a daily minimum of 8–9 hours. Everybody in the company is very approachable and helpful. Employees have a good work-life balance and actively participate in the extra-curricular activities, philanthropy events and awareness drives. We also had various Speaker Series Session, where senior executives across the globe, shared their experiences and gave useful and interesting career insights. Overall, it was a great learning experience.\n\nAccording to you who should ideally apply for the intern:\n\nAnyone who’s looking to explore avenues in Quantitative Finance should apply for this internship.\n\nAnd what advice will you give to them:\n\nCDC Internship process is a totally new and different experience for the most of us. Every company has a different strategy and looks for a specific skill set. It is therefore very important to first select profiles you are interested in and prepare accordingly. Take every little step as a challenge and keep on delivering your best.\n\nGood Luck!"
    }
]