[
    {
        "job_role": "Product",
        "company_name": "P&G",
        "info": "The first step of the selection procedure comprises online gamified assessments which consist of various types of challenges such as grid challenge, digit challenge, switch challenge, etc.",
        "content": "FORESIGHT(2023): Summer Internship at P&G | Pratik Koranne |\n\n--\n\nListen\n\nBrief Introduction:\n\nHi, my name is Pratik Koranne, I’m a pre-final year undergraduate student of the Department of Chemical Engineering enrolled in its Dual Degree course.\n\nI received an internship offer from Procter & Gamble( P&G) in the Product Supply role through CDC for the summer of 2023 and I am currently interning with them at their Hyderabad plant.\n\nHow did you get into P&G? What was the selection procedure?\n\nAfter applying through ERP, we had to apply for the role in the company’s portal as well. The first step of the selection procedure comprises online gamified assessments which consist of various types of challenges such as grid challenge, digit challenge, switch challenge, etc. There are unlimited levels and you need to get as many correct as possible. If you clear this round, you’ll get another link for an assessment that consists of behavioral and situational-type questions.\n\nFinally, they released a shortlist of around 20 students for Group Interviews ( 3 candidates in each panel) followed by a HR round on Day 1 with further shortlisted candidates.\n\nHow to prepare for them?\n\nThe psychometric test consists of general aptitude-based questions and so there isn’t much you can do to specifically prepare for them. You can have a look at basic puzzles, practice quick math, etc. My suggestion would be to attempt the test in a quiet and focused environment free from distractions. The second test consists of situational and behavioral type questions in which you have to stick to your ideology while keeping in mind the values of the company and answering the questions. I would suggest you to go through the company’s website and understand its principles and values.\n\nThe group interview consists of questions where you would be asked to cite some situations from your previous experiences( be it your internships, POR’s or academic achievements) and how you went about solving the problem at hand. The key here is to answer in a concise manner keeping in mind the CAR( Context, Action, Response) framework. The other type of questions is where they’ll ask you to assume yourselves in a particular situation and then try to find possible solutions. Remember to never cut off your fellow interviewees while they are speaking and listen carefully to their responses as well.\n\nHR round consists of basic questions on your introduction and is a chance to interact with the interviewer on his experience in the company and also telling him about your motivation for the internship. You should always ask some questions to the interviewer here, which could be about the role, the company, or the industry in general.\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nThe preparation for this profile varies from company to company. My interview at P&G did not focus on core engineering knowledge but was more inclined towards evaluating my decision-making abilities in various situations with a focus on cultural fit as well. However, the same is not true for other FMCG companies like HUL and ITC. My suggestion here would be to prepare some basic concepts of your engineering discipline and familiarise yourselves with a bit of supply chain knowledge in order to prepare for the profile and reach out to seniors who have interned in these companies in the past for relevant preparation advice.\n\nAccording to you, who should ideally apply for this job?\n\nThe role of Product Supply offered by P&G is super diverse and typically pertains to working on various innovation-driven optimization opportunities within the company spreading across functions. The role involves techno-managerial work with an understanding of the technicalities of the industry and coming up with solutions to various challenges. Anyone who enjoys solving problems at scale, and optimizing various technicalities of the industry would be a good fit.\n\nAny specific advice you want to give to the junta sitting for internships this year?\n\nOne of the most important things is to keep believing in yourself throughout the process. You must be clear about what you want out of this process and be specific about the roles you are targeting. Always stay connected with relevant seniors for resources/mock interviews and a group of friends preparing for similar profiles for collaborative preparation. The process of CDC can sometimes be unpredictable and uncertain, but always keep your cool and keep working.\n\nWhat are some of the major points you think would be valid to mention in your CV while targeting this profile?(any specific suggestions you would like)\n\nProjects or internships related to supply chain or industrial optimization are a plus. Also, they prefer previous techno-managerial experiences, so mentioning your POR’s on campus will give you an upper edge. Projects or competitions on environmental sustainability are also worth mentioning.\n\nHere’s wishing all the very best to the CDC junta this year! Feel free to reach out in case of any queries!"
    },
    {
        "job_role": "Product",
        "company_name": "Limechat",
        "info": "I believe product roles for the company require two primary skills: Problem-Solving and Stakeholder Management",
        "content": "FORESIGHT(2022): Summer Internship at Limechat| Tanaya Ramane\n\n--\n\nListen\n\nBrief Introduction\n\nHi Everyone! I am Tanaya Ramane, a fourth-year Dual Degree student from the Department of Industrial & Systems Engineering, enrolled in its Quality Engineering Design & Manufacturing course. I am interning at Limechat as part of its Product team in the summer of 2022.\n\nHow did you get into Limechat? What was the selection procedure?\n\nIn the CDC internship drive, the number of companies coming for products is generally less. Limechat came on Day-3 for two profiles, Software, and Product. For Product in the initial CV shortlist, around 8 people were shortlisted. Out of which, 3 of us were offered an internship at the end.\n\nThe interview was divided into three phases essentially:\n\n1: CV grilling — Based on relevant past projects and how they would align with the intern role\n\n2. Product Case study — I was asked about a product case study of building an app from scratch\n\n3. HR round — Example: Questions mostly about why Product over any other role…\n\nHow to prepare for them?\n\nFor CV grilling:\n\n1. Make sure you are thorough with what you write in your CV\n\n2. You can drive the interview flow, so choose your words wisely. In my case, I knew which of my interns would be the most relevant and deliberately mentioned that role in my answers. This eventually led the interviewer to ask me questions about that particular role.\n\nFor Product Case Study -\n\nGeneral Awareness\n\nGood problem-solving skills\n\nHave a structured approach and try to think of MECE buckets\n\nAsking the right questions, mainly to clarify the problem statements and even within the case\n\nHave a two-way conversation, don’t just deep dive into the case and give a final output, have discussions with the interviewer.\n\nAfter the case, ask for feedback: do you want me to explore any other aspect of this case?\n\nIs the solution feasible?\n\nIf you are quoting any problem, instead of simply assuming, convey that to the interviewer: I think that the main issue faced by our users is XYZ. Does the company face a problem with this? Should I look into this? Etc.\n\nHR Round:\n\nYou can get plenty of videos for this out there, and this is something that you need to look out for once you get a shortlist\n\nThese are all straightforward and basic tips, but people often panic over the interview and miss out on a few. Just brainstorm as much as you can on the case, and keep the interviewer in the loop. Please don’t make it a one-sided monologue!\n\nAccording to you, who should ideally apply for this job?\n\nI don’t think I would be the best person to comment on this(because I’m also a naive beginner, I would say😅). There are, again, many youtube videos out there for this.\n\nI believe product roles require two primary skills:\n\nProblem-solving\n\nStakeholder Management\n\nYou need to take the initiative and look for improvements, come up with possible solutions, develop an implementation plan, check if it’s feasible, and get validation from the customers by experimenting. And for all this, you need to work with multiple stakeholders. So, if you are someone who enjoys these things and loves to work across cross-functional teams, then this space might work well for you.\n\nWhat are some of the major points you think would be valid to mention in your CV while targeting this profile? (any specific suggestions you would like to make?)\n\nAn all-rounded CV is preferred(that’s what I’ve heard), and past interns in Product might help. Idk about the exact shortlisting criteria, so I won’t be able to comment much on this part.\n\nAny specific advice you want to give to the junta sitting for internships this year.\n\nThe CDC process is daunting. It’s fine if you don’t get an internship through CDC. There are a lot of opportunities off-campus, especially in product roles. Make sure you talk to your parents/friends, whoever you are comfortable sharing your bt with!\n\nDon’t lose hope/confidence, even if you are not able to make it. Your career is a 30+ years journey ahead. 1/2 years up and down hardly contributes to 3% of it. So don’t give up hopes, keep hustling, and you can find a career that satisfies you!"
    },
    {
        "job_role": "Product",
        "company_name": "Optum",
        "info": "If you have worked on AI and possess interest in business strategy, this role would be perfect for you.",
        "content": "FORESIGHT(2021): Summer Internship at Optum | Shubham Ekapure\n\n--\n\nListen\n\nBrief Introduction:\n\nMy name is Shubham Ekapure, and I am pursuing B.Tech. in Mechanical Engineering at IIT Kharagpur. I interned at Optum, a part of UnitedHealthcare Group, during the summers of 2021. I worked with the Clinical Quality Analytics team under the profile of Product Management.\n\nSelection Procedure:\n\n2020 was the first year when Optum came for a product management role in Engineering Schools. They usually hired PM interns from Business Schools in India. The selection process is more involved than other profiles.\n\nThe initial screening was based on CV shortlisting and CGPA. The shortlisted students were then interviewed.\n\nAll the interviews take place on the same day and overall the entire interview process takes around 3–4 hours. Finally, 2 people were selected for the product management profile.\n\nHow to prepare for them:\n\nHaving Projects, Internships, or domain knowledge of Machine learning and Deep learning will be very helpful as the company solutions are themselves based on AI. Be very thorough with what you have in your CV, and practice guesstimates can come in handy. If you have time, do look for some business points for your internships/projects. Be familiar with standard HR and personality-based questions.\n\nYour Project Details:\n\nMy project was to create a machine learning-based solution that will generate target strategies for Health Plan managers in the US. Because the market was already identified by work mainly on the technical and UI part of the product, i.e., creating the predictive model and integrating it to a website. This was then benchmarked as the minimum viable product. Other than these, I completed some team automation for reading patient-level data, comparing huge chunks of healthcare data, etc.\n\nHow was your experience working from home? What difficulties did you face?\n\nI didn’t have any issues with the internship being remote, overall I’d say I had a very fruitful time interning with Optum. My mentor and manager were both friendly and we used to have daily meetings for the project much like a scrum call. The only challenges I faced were when I had power cuts or internet shutdowns because of maintenance but it’s a part of a remote setup.\n\nWhat effect could COVID have in the upcoming internship process?\n\nI think that after the 2020 and 2021 internships, most of the companies have accepted the current state in which we are. So that’s a bright side to look at. If the pandemic situation resolves out well till next year some companies may have on-site internships too. Be regularly updated with all the notices from CDC.\n\nAccording to you, who should ideally apply for this internship?\n\nYou don’t need to have prior knowledge of the US Healthcare system or product management. Ideally, it will improve your chances if you have some projects in AI or AI for Healthcare. Having a case study competition on your cv can also be helpful. If you have worked on AI and have a keen interest in business strategy, this role would be perfect. Any product management company having domain knowledge of their signature, After,, and overall products always helps.\n\nAnd what advice will you give to them?\n\nBe calm and be patient for your chance. Shortlist your prioritized companies beforehand and start preparing for them. Get in touch with seniors who are working there or have interned there. The CDC internship process can be very stressful but make sure you learn as much as you can from it.\n\nAll the best :)"
    },
    {
        "job_role": "Product",
        "company_name": "",
        "info": "To apply at ZestMoney prepare case-studies, guesstimates and subjects of finance or product-management a month prior",
        "content": "FORESIGHT(2020): Summer Internship ZestMoney| Shalina Kumari\n\n--\n\nListen\n\nBrief Introduction:\n\nHello, I am Shalina Kumari, a final year undergraduate student from the Department of Physics enrolled in its integrated M.Sc. course. I interned at ZestMoney — a lending Fintech company, during summer 2020 as a part of its Product Management team. ZestMoney uses Mobile Technology, Digital Banking, and AI to provide the fastest way to pay using EMI even if you do not have a credit card.\n\nSelection Procedure:\n\nThe selection procedure includes CV shortlisting, online test, and interview. The online test was to make a blueprint focusing on the feasibility and implementation of a real-case scenario. 10 students were selected for the final PI round. It was a telephonic interview, where they first focussed on CV and then questioned the feasibility and implementation part from the blueprint.\n\nHow to prepare for them:\n\nFor the online test, you can prepare case studies. I have studied some cases before but I mostly applied the knowledge from the course “Product Development” I had that semester. For the interview round, be thorough with your CV and solve puzzles from online sites like geeksforgeeks. Prepare Quant and Guesstimates from books or any online source. If you havetime, you can revise your case studies and the online test questions too.\n\nYour Project Details:\n\nI have analyzed the problems faced by current users using user research and proposed ideas to improve user feedback in the form of Product Requirements Document (PRD). I have used the Agile methodology to develop and execute the detailed version of product roadmaps to create a better ecosystem for merchants and researched user stories to prioritise features using Story Mapping techniques.\n\nHow was your experience working from home? What difficulties did you face?\n\nI had an amazing experience working with ZestMoney even from home. Mentors were quite encouraging and friendly. At a certain point, I faced some issues regarding the internet, and since I was on Campus, I had to travel back home but they were quite supportive and even recorded the session for me. They also conducted fun activities which I enjoyed a lot. The experience was totally invaluable.\n\nWhat effect could COVID have in the upcoming internship process?\n\nCOVID has already affected quite a few Internships and placements. Students would have to compete more to get certain positions in the internship. Make your mindsets already to work for experience and gaining knowledge. I would suggest students to not panic and support each other during these hard times.\n\nAccording to you, who should ideally apply for this internship?\n\nZestMoney doesn’t require a candidate to have prior knowledge in finance or product management. They see your interests but it really helps if you have already got some knowledge or experience. If you want to apply for this particular company, then prepare case studies and guesstimates a month prior and you can also take some subjects related to product or finance.\n\nAnd what advice will you give to them?\n\nMy advice to the upcoming batch would be to have confidence and believe in yourself. Apply for each and every company and go give tests for each of them too, especially when you don’t know which one is best for you! It’s all a part of learning and getting experience."
    }
]