[
    {
        "job_role": "Quant",
        "company_name": "AlphaGrep",
        "info": "The test scores really matter and not the CGPA, according to me. You can practice on Leetcode, CSES, Codeforces and Atcoder to practice such types of questions.",
        "content": "--\n\nListen\n\n1) Brief introduction and description of offered role\n\nMy name is Nabhya Khoria. I am a pre-final year undergraduate student of the Department of Mathematics. I will be joining AlphaGrep as a Quant intern from May‘24.\n\n2) How did you get into AlphaGrep? What was the selection procedure?\n\nThe selection process consisted of a coding test followed by three rounds of interviews. The coding test comprised four coding questions based on binary search, dynamic programming and trees mixed with some basic probability concepts. I managed to solve all of them. Those who solved all the questions from non-CSE departments were only shortlisted for interviews. For CSE students, solving 3+ was sufficient.\n\nThe first round involved questions about mean and median. A problem on conditional probability was then given for me to solve. A few basic puzzles, guesstimate and sharpe ratio were followed. The last few questions involved Markov Chains. The interviewer was quite interactive and helpful. He didn’t look for a straight answer and rather insisted on the approach.\n\nThe second round was the toughest one, involving tough questions on probability and mathematics. I was asked about the infinite power tower convergence problem. Then, I was given a puzzle, which was a strategic winning puzzle. These types of questions can be solved if one practices Brainstellar and Fifty Challenging Problems. In this round as well, the approach and letting the interviewer know what you’re thinking was important.\n\nThe third round was on market making. I was asked to estimate the population of Italy. This was followed by creating a spread of 1 crore. The interviewers gave their own spreads regarding the same, and then subsequent transactions were followed by buy and sell. After a few transactions, I was told to correct my spread. After a hint, I was able to correct my spread. This round primarily consisted of market simulation, similar as the stock market. You don’t need to prepare for this round beforehand.\n\n3) How to prepare for them?\n\nYou must be well prepared for DSA and must practice solving questions within a limited time frame. The test scores really matter and not the CGPA, according to me. You can practice on Leetcode, CSES, Codeforces and Atcoder to practice such types of questions. I personally used the AlgoZenith course for my DSA preparation. For the interviews, you must solve Fifty Challenging Problems, Brainstellar and Heard on the Street. Try to maintain a decent Codeforces rating (1600+ will do). If you are targeting a Systems role, go through OS, Networks and OOPS. Make sure you also go through C++ concepts like smart pointers from learncpp.com.\n\n4) When did you start preparing for this role and according to you what is the ideal time for aspirants to begin their preparation?\n\nI started my preparation in the summer after my second year. I couldn’t prepare well in my third year. I resumed it in the summer after my third year.\n\nThe ideal time to start is as early as possible. The first summer is indeed the ideal time to start your preparation. Simply because it is difficult to manage time during classes and other campus activities. Try putting maximum hours\n\nin the holidays to cover up all the syllabus in time, and be miles ahead compared to others. Do not worry if you don’t have much time left, as you will be at your maximum efficiency right now, and one can complete everything if he/she puts in the last-minute effort.\n\n5) What difficulties did you face while preparing for this Company/Profile? How did you overcome them?\n\nThe difficulty that I mainly faced was the rating growth. I was unable to improve my ratings despite my efforts. I overcame them by practicing more and more questions, giving mocks, and clearing all my doubts. I kept myself motivated by giving GoC contests and securing decent ranks on the leaderboard. I tried to give all the contests of Codeforces and Codechef. I also tried sometimes to upsolve the questions of the contests. Remember, practice is the key to growth.\n\n6) Are there any specific requirements such as department, CGPA, or other criteria for this position? Additionally, do certain PORs or EAAs enhance one’s chances of securing this internship?\n\nYes, only circuital departments were allowed, i.e., CS, MA, EC and EE, to register for this position. A minimum CGPA of 8.0 was also required to sit for the tests.\n\nNo PORs or EAAs will usually enhance one’s chances of securing this internship. However, at the end of my second interview round, I was asked about what I do in my free time. Here, if you answer chess, bridge, or poker, it can slightly enhance your chances.\n\n7) According to you, who should ideally apply for this job?\n\nOnes who are targeting Software or Quant roles should ideally apply for this position, as getting into AlphaGrep requires preparation for these roles. Those preparing for Data roles, if you practice coding questions well, you should too sit for this role.\n\n8) Kindly attach your CV/Resume. What are some of the major points you think would be valid to mention in CV while targeting this profile?\n\nCV is not really important in this role. As long as you have good ratings and good problem-solving skills, you are good to go. You can keep 2–3 projects primarily based on coding. If you don’t have any, try finding some simple projects on the web. Mention your ratings of different platforms in the CV. Also, mention your ranks in various contests you have achieved. Try incorporating Machine Learning and Deep Learning as well; this will slightly increase your chances. PORs will certainly not help, but it is not a problem if you have them on your resume. They asked me for a summary of my resume in Round 1, and that’s it. They don’t really care about your CV. Please note this is not true for other companies.\n\n9) Lastly, what advice would you like to give to the students aiming to grab CDC internships this year?\n\nPrepare well and give the time it requires. Make sure you maintain calm and composure during the coding tests. This is the time when you should focus on performing extremely well in a few tests rather than performing “decent” in a lot. Even if you screw up a lot of tests, it is totally fine. You must manage to perform great in a few. Have a small group of friends to discuss and to keep each other motivated. For the interviews, I would recommend asking your batchmates and/or seniors to help you with your last-minute preparation, like your introduction and HR. Do not indulge yourself in some courses that won’t help you a lot and would just consume your time. Discuss with your friends and your mentor about your preparation and take their advice. Remember, communication is the key part in an interview; always speak your “mind.” Also, understand that CDC is not the end of the world and try to stay calm throughout the process."
    },
    {
        "job_role": "Quant",
        "company_name": "Goldman Sachs",
        "info": "I focused on data structures and algorithms, probability concepts, and aptitude questions. Engaging with competitive programming on platforms like Codeforces, and Leetcode helped me a lot to prepare in a time-constrained setup.",
        "content": "FORESIGHT(2024) : Internship at Goldman Sachs | Vipin |\n\n--\n\n1\n\nListen\n\n1. Brief introduction and description of offered role.\n\nHello, I am Vipin Kumar, a 4th-year dual degree student in the Mechanical Engineering Department. In this blog, I’ll talk about how I got a summer internship offer at Goldman Sachs as a quantitative strategist.\n\n2. How did you get into Goldman sachs? What was the selection process?\n\nImagine this: you apply on a whim, not checking the shortlist because you think it’s a long shot, and then a buddy tells you you’re in! That was my experience.\n\nThe process started when I submitted my CV for the quant intern role, not very sure at that time as I was majorly focusing on ML roles. The first filter was an online test with a mix of 20 questions — math, probability, coding, ml, and aptitude. I managed around 15 of these. Out of my expectations, I was shortlisted for the interview.\n\nWhat followed were three intense rounds of interviews where I was grilled on everything from my internships and projects to data structure, probability and statistics, puzzles, and machine learning algorithms. Each interview round peeled back another layer, pushing me to showcase not just what I knew, but how I thought and approached problems.\n\n3. How do you prepare for them?\n\nSimple but effective rule: You need consistent practice and a bit of strategy.\n\nI was preparing for analytics profiles. So, I immersed myself in machine learning and data science projects for over a year, which was like building stamina. Then, three months before the CDC internship, I started sprinting; I focused on data structures and algorithms, probability concepts, and aptitude questions. Engaging with competitive programming on platforms like Codeforces, and Leetcode helped me a lot to prepare in a time-constrained setup.\n\nYou need to balance focus on technical skills with a broader engagement in relevant projects. This not only builds your expertise but also gives you plenty to talk about in interviews.\n\n4. Are there any specific requirements such as department, CGPA, or other criteria for this position? Additionally, do certain PORs or EAAs enhance one’s chance of getting this internship?\n\nGoldman Sachs is quite inclusive regarding academic backgrounds; they don’t restrict applications based on your department. However, CGPA does play a role, especially for quant positions — higher is usually better, but it’s not the sole decider.\n\nAs for Positions of Responsibility (PORs) or Extra Academic Activities (EAAs), they’re not necessary but can certainly help in building your soft skills like teamwork and communication, which are crucial during interviews.\n\n5. According to you, who should apply for this job?\n\nIf you’re the type who thrives on challenges, especially those involving numbers or complex problems, this opportunity is tailor-made for you. You don’t need a background in finance for this role in GS, but a decent foundation in mathematics, statistics, and problem-solving is crucial. The role is perfect for those who enjoy dissecting multilayered problems, whether in competitive programming, mathematical problems, or similar domains. If problem-solving excites you, don’t hesitate to apply\n\n6. What are some of the major points you think would be valid to mention in CV while targeting this profile?\n\nYour CV should highlight relevant projects and internships, particularly those involving data science, machine learning, or any quantitative analysis. Demonstrating your proficiency in DSA through competitive programming rankings or notable achievements will give you an edge. Remember, clarity and relevance are key — make sure every item on your CV aligns with the skills required for your targeted role.\n\n7. What advice would you like to give to students aiming to grab a CDC internship this year?\n\nFirst off, keep the preparation running and polishing your skills, but also make time to step away and spend time with friends — you don’t want to be overwhelmed by this hectic process.\n\nSecond, when you’re in the interview, treat it like a problem-solving session with your friends or mentor. Be honest when you’re stumped — ask for hints or discuss your thought process. Interviewers aren’t just interested in the right answer, but how you approach problems.\n\nAnd remember, last-minute applications can sometimes lead to unexpected opportunities. So, even if it’s the eleventh hour and you have no expectations, throw your hat in the ring — you might just be exactly what they’re looking for!"
    },
    {
        "job_role": "Quant",
        "company_name": "Goldman Sachs",
        "info": "For coding preparation, understanding DSA concepts and practicing standard questions is essential. I started with videos and resources of Striver and Luv DSA.",
        "content": "FORESIGHT(2024) : Internship at Goldman Sachs | Sanskar Gupta\n\n--\n\nListen\n\nHey everyone! I’m Sanskar Gupta, a 4th-year undergraduate student pursuing an integrated MSc in Economics. I’ll be interning at Goldman Sachs as a Quantitative Strategist.\n\n2. How did you get into Goldman Sachs ? What was the selection procedure?\n\nGoldman Sachs conducts two tests, one for the SDE and one for the Quant roles. Since I wasn’t targeting SDE, I only took the Quant test. It was a one-hour test on the HackerRank platform, comprising several sections:- Two subjective HR questions focusing on how will you handle team member performance issues and my lessons from previous projects/internships.- The quantitative aptitude section covers basic aptitude, probability, statistics, and JEE-level calculus and trigonometry questions.- Coding Section with three easy to medium standard questions from graph and array topics.\n\n3. How to prepare for them?\n\nPreparing for a Quant role at Goldman Sachs requires a strong understanding of probability and statistics. For this, you can follow the following resources:- Stats110 for building foundational concepts.- Solving 50 challenging problems in probability and statistics, especially the first 30 problems.- Studying chapters 1 and 2 of “Heard on the Street.”- Practicing easy and medium Brainstellar puzzles.\n\nFor coding preparation, understanding DSA concepts and practicing standard questions is essential. I started with videos and resources of Striver and Luv DSA. For the practice of the question, I used GFG along with LeetCode Blind 75.\n\n4. When did you start preparing for this role, and what is the ideal time for aspirants to begin their preparation?\n\nI started preparing for roles like this at the end of my second year, focusing on Machine Learning/Data Science. I began coding during the winter holidays after the 5th semester, as it will be required for most of the companies. You have to start coding practice as early as possible and dedicate significant time during the summer holidays to prepare for probability and statistics and refining your CV.\n\n5. What difficulties did you face while preparing for this Company/Profile? How did you overcome them?\n\nManaging a broad syllabus within a limited timeframe was one of the biggest challenges. To overcome this, I created a detailed roadmap prioritizing resources and kept track of my progress. Initially, the sheer volume of content and conversion rate may seem overwhelming. However, persisting and accomplishing small targets consistently prove beneficial in the long run.\n\n6. Are there any specific requirements such as department, CGPA, or other criteria for this position? Additionally, do certain PORs or EAAs enhance one’s chances of securing this internship?\n\nGoldman Sachs doesn’t have specific departmental criteria; candidates from various backgrounds were shortlisted. While a high CGPA is preferred, there’s no explicitly stated cutoff. For the Quant role, project/internship experience and competitions hold more weight than Positions of Responsibility (PORs).\n\n7. According to you, who should ideally apply for this job?\n\nThis role suits individuals who enjoy problem-solving, have a strong inclination toward mathematics, and are interested in exploring finance.\n\n8. Kindly attach your CV/Resume. What are some of the major points you think would be valid to mention in CV while targeting this profile?\n\nIn a CV targeting this profile, start with internships/projects and competitions, as these provide substantial topics for interview discussions. Maintain consistency and highlight the impact of your work, using numbers where possible for credibility. Only include points you can defend in interviews. Projects related to finance and analytics can boost your chances of selection. Seek feedback from peers and seniors on your CV, and conduct mock interviews to identify strengths and weaknesses.\n\n9. Lastly, what advice would you like to give to the students aiming to grab CDC internships this year?\n\nStay confident in your preparation and keep working diligently. Seek support from friends and seniors whenever needed. Don’t stress over early results; many good opportunities are available later. Remember, a CDC internship is not the end-all; plenty of other opportunities will exist. Keep working hard, and success will follow in due time."
    },
    {
        "job_role": "Quant",
        "company_name": "Goldman Sachs",
        "info": "For probability and puzzles, I followed the standard interview books. Heard on the street, 50 challenging problems in probablity, brainstellar etc",
        "content": "FORESIGHT(2024) : Internship at Goldman Sachs | Birru Lavanya |\n\n--\n\n1\n\nListen\n\n1)Brief introduction and description of the offered role.\n\nHey all. I am Birru Lavanya, a pre-final undergraduate student in economics at IIT Kharagpur. I am from Warangal, Telangana. I will be interning at the Controllers division of Goldman Sachs this summer.\n\n2)How did you get into Goldman Sachs? What was the selection procedure\n\nGoldman Sachs offers two roles at our campus, quant and software, and is open to all departments with no CGPA cutoff. The selection procedure consisted of an online test at first. The online test had four sections:1) A few questions on probability, maths and puzzles.2) 2 subjective HR questions. It’s mostly the same every year.3) Two coding questions with medium-hard difficulty.4) Questions on CS fundamentals.A day before day one, candidates were shortlisted for offline interviews at Nalanda based on their test performance. I was shortlisted for quant interviews. There were three rounds of interviews. The first round started with a brief introduction, CV grilling and a few questions on probability, puzzles and some basic coding questions.\n\nAfter performing well in the first round, I was immediately sent to the second round, where I was asked probability questions, puzzles and coding questions. This round consisted of many follow-up questions for each question. Through careful analysis and brainstorming, I could answer each of them and impress the interviewer. The third was with the manager, who started grilling my CV and caught his eye on my econometrics project. He gave me a situation where I had to design the experiment and perform statistical tests. With a lot of communication, I convinced him of my experiment.\n\nLater, he moved to a coding question of medium-hard difficulty. All the rounds were interactive and engaging. I had three back-to-back interviews within a combined 2 hours. I was not asked to code anything explicitly, but I had to explain the logic and direction. There was no HR round as such for me. Immediately, I was told I was selected.\n\n3)How to prepare for them?\n\nFor probability and puzzles, I followed the standard interview books. Heard on the street, 50 challenging problems in probablity, brainstellar (it’s a website :)), etc. (I am adding this line because my Grammarly suggested it. I heard on the street that there were 50 challenging problems in probability, brainstellar, etc. lol).\n\nFor DSA, I enrolled in Algozenith in my fourth semester and practised some leetcode questions. I didn’t participate in any coding competitions as such, but I recommend doing so to get acquainted with the test environment.\n\n4)When did you start preparing for this role and according to you what is the ideal time for aspirants to begin their preparation?\n\nI didn’t specifically target this company. I was a mentee in Quantitative Research at JP Morgan. Towards the end of the mentorship, I was given an opportunity to interview for an internship (I wasn’t selected). Resources were provided, and they were the same for any standard quant role interviews. (Here, I can say that I got those from the interviewers themselves :D). I started preparing three months before the on-campus tests and interviews. I recommend preparing at least three months before the CDC internship process starts. But it’s never too late and never too early. I also recommend practising coding and participating in various coding competitions as early as in 2nd year.\n\n5)What difficulties did you face while preparing for this Company/Profile? How did you overcome them?\n\nThe difficulties I encountered during my preparation were mainly the need for more time and overwhelming resources to complete. I also had to attend classes and do assignments as a part of JP Morgan’s mentorship. We also had to do a case study for about a week at the end, which wasgetting in the way of my preparation.\n\n6)Are there any specific requirements such as department, CGPA, or other criteria for this position? Additionally, do certain PORs or EAAs enhance one’s chances of securing this internship?\n\nThere are no specific requirements, such as department, CGPA, or other factors, for this position. Additionally, PORs and EAA would not enhance the chances of being selected since I had neither PORs nor EAA. They might help take the interview forward, but anyone would not be rejected based on PORs and EAA.\n\n7)According to you, who should ideally apply for this job?\n\nAnyone interested in finance, problem-solving or software development is ideal for this job. You will be selected for a software or quant role based on the test performance and interviews.\n\n8)What are some of the major points you think would be valid to mention in CV while targeting this profile?\n\n9)Lastly, what advice would you like to give to the students aiming to grab CDC internships this year?\n\nFeel free to reach out to me anytime :)\n\nCarpe dium!"
    },
    {
        "job_role": "Quant",
        "company_name": "DSP",
        "info": "Practice guesstimates, probability and statistics, and quizzes for a safer side. In most of the quant profiles, guesstimates and statistics are asked.",
        "content": "FORESIGHT(2023): Summer Internship at DSP | Aditi Maurya |\n\n--\n\nListen\n\n1) Brief Introduction\n\nHello everyone!\n\nMy name is Aditi Maurya, a final year undergraduate from the Department of Chemistry, enrolled in its 5-year Integrated MSc course with micro-specialization in Artificial Intelligence. I have got an internship offer at DSP Asset Managers as a Quantitative Investments and Analyst.\n\n2) How did you get into DSP? What was the selection procedure?\n\nThe selection process was resume based followed by Technical and HR interviews. In technical interviews, they asked about my past projects, the architecture of language models (since it was mentioned in my CV), some basic financial concepts (only the ones mentioned in my resume, again), and my Kaggle competitions. Apart from the resume-based questions, they asked one guesstimate. The interview was too intense and the interviewer was putting pressure to check if I’m confident in my answers. It went well.\n\nAfter the technical round, there was an HR round in which they asked basic HR questions along with some questions based on my major course ( why being in chemistry, going for a quant profile, etc.)\n\n3) How to prepare for them?\n\nMy advice for the students who are planning to appear in the DSP ( quant in general ) interview is that have a thorough understanding of the projects and competitions you have mentioned in your resume because they will dig deeper into your resume, can ask architecture of the models, the terms you have mentioned and like anything which is there in the CV, so be prepared.\n\nApart from that, have confidence in yourself and don’t get afraid if the interviewer puts pressure on you, keep calm and answer confidently. Do practice guesstimates, probability and statistics, and quizzes for a safer side. In most of the quant profiles, guesstimates and statistics are asked.\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem\n\nSince I was preparing for the quant profile (or data science profile) primarily, I practiced all the standard questions and was confident enough with my projects and competitions so, in general, I haven’t faced any issues in particular, the only challenge was to handle the pressure during the interview as I have already told it was a bit intense.\n\n5) According to you, who should ideally apply for this job?\n\nMost people who are interested in finance and quantitative profile should prepare for this job because the kind of projects we are working on is based on pure finance along with financial and statistical modeling. Also, after getting selected, one has to give the exam of NISM Mutual Fund V-A to finish their internship. This is what they will tell you during the onboarding process.\n\n6) Any specific advice you want to give to the junta sitting for internships this year?\n\nRegardless of the company, start preparing for tests at least 3–4 months early and keep in touch with your friends to be on track. Solve standard questions from heard on the street, 50 challenging problems in probability, brain stellar, puzzles, and guesstimates. Go through previously asked questions of various companies. Try giving mock interviews parallelly, so that it gives you confidence and reduces anxiety before the actual interview. Keep your introduction ready and learn it by heart. Also, talk to seniors about the hiring process of specific companies you are targeting. Try to learn about the latest products or launches by the company you are applying for and the background of the company’s foundation.\n\nOn the interview day, remain calm and keep yourself hydrated throughout the day as it will be hectic. Your mental toughness counts more than your technical skills during CDC season. Work hard smartly and handle the rejections positively, as it is a part of the process. Do never give up, Bounce back fast.\n\n7) What are some of the major points you think would be valid to mention in your CV while targeting this profile? (any specific suggestions you would like to make?)\n\nFor quant profiles in general, previous internships/projects, competitions, and strong analytical skills matter. Because of the relevant projects/internships, the interviewer gets something to talk about and you have an opportunity to make an impression. Adding competitions, especially the Kaggle competitions (if you have achieved some position) helps you to get an edge over other candidates. Try to avoid mentioning the basic Titanic Kaggle competition, I do not recommend it to anyone, try something different as there are ample competitions available. Positions of Responsibility (PORs) are not that important but look good if you have them.\n\nDo not write anything on your resume that you are not confident about. If you are mentioning any project/intern make sure you are very thorough with it. Even if you exaggerate anything, just ensure you can defend it well."
    },
    {
        "job_role": "Quant",
        "company_name": "DSP",
        "info": "Be ready with all the basic ML algorithms in case they ask to implement it from scratch. For this, you can follow any online resource like Andrew Ng on Coursera or Krish Naik’s tutorials.",
        "content": "FORESIGHT(2023): Summer Internship at DSP | Debabrata Bhakat |\n\n--\n\nListen\n\n1) Brief Introduction\n\nHey everyone!\n\nI am Debabrata Bhakat, a final-year student in the Department of Mechanical Engineering enrolled in its dual degree program. I received an internship offer from DSP Asset Managers as a Quantitative Investments and Analyst.\n\n2) How did you get into DSP? What was the selection procedure?\n\nThe selection process was resume based, followed by a Technical interview. The entire technical round went for about 40 mins. It started by asking me what DSP does and what an AMC (asset management company) does. Next, they selected an internship experience from my resume, which I had done at a FinTech startup. They told me to go through and explain the entire process of the work I had done during that internship. I explained everything in about 10 mins.\n\nDuring the interview, I faced tough questions about my methods and models. The interviewers wanted to know if there were better ways to approach the work I had done. They thoroughly examined my techniques and challenged me to consider alternative approaches that could potentially yield even better results.\n\nThey also asked me to explain a few basic ML algorithms from scratch, which is easy if you have done any course online or taken an MLFA course.\n\n3) How to prepare for them?\n\nMy advice for students preparing for DSP (or any quant/financial analyst role in general) is to be thorough with your resume. Having relevant internship experience/projects helps a lot in these profiles.\n\nBe ready with all the basic ML algorithms in case they ask to implement it from scratch. For this, you can follow any online resource like Andrew Ng on Coursera or Krish Naik’s tutorials.\n\nTo excel in the aptitude section, reviewing fundamental concepts in probability and statistics is advisable. Additionally, practising problem sets from reputable sources like Brainstellar and the book “Heard on the Street” can significantly enhance your preparation.\n\nAlso, be prepared with DSA, as they sometimes ask for it in the interviews. InterviewBit is a good platform to go through. Generally, the questions asked here are easier than the ones for software roles.\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem\n\nDuring my interview preparation phase, time management became crucial due to my simultaneous involvement in an internship. Balancing a full-time internship from 9 to 6 left me with limited energy and little time to dedicate to interview preparation. Considering my priorities and the importance of thorough preparation, I left the internship to focus fully on CDC preparations. However, it may be a different case for someone else.\n\n5) According to you, who should ideally apply for this job?\n\nAnyone interested in finance and analytics can apply for this job. The project I am working on is making financial models and algorithms which help decide when/which stocks to buy/sell. If this kind of work interests you, then you can surely apply for it.\n\n6) Any specific advice you want to give to the junta sitting for internships this year?\n\nYou should start your preparations at least three months before the process. Create a study group with like-minded friends targeting similar profiles to stay on track and meet deadlines. Practice mock interviews with group members or seniors to refine your skills. You can stay motivated together, share resources, and provide valuable feedback to ensure success.\n\nMake your CV well before the deadline and have it reviewed by seniors and friends. In case of any doubts, never feel afraid to consult your seniors.\n\nBe well-versed with your introduction and some commonly asked questions. Read a bit about the company before the interview and talk to seniors who are placed there to know about the hiring process of some specific companies.\n\nOn the day of your interview, be ready well before the time to avoid last-minute panic. Be confident, and calm, and keep yourself well-hydrated throughout the day.\n\nFinally, embrace rejection as part of the process. Stay determined, trust the journey, and never lose hope. Success awaits. Best of luck!\n\n7)What are some of the major points you think would be valid to mention in your CV while targeting this profile? (any specific suggestions you would like to make?)\n\nHighlight any relevant internships/projects you have done that shows that you have worked on real-world projects and can work in a team. Also, mention any competitions which you have won. Whatever you put in your resume, make sure that you can explain it well."
    },
    {
        "job_role": "Quant",
        "company_name": "Qube Research & Technologies",
        "info": "For the Quantitative Research profile, a good grip on Machine Learning concepts would help, 50 Challenging Problems in Probability, BrainStellar(website), Heard on the Street are few resources to exploit",
        "content": "FORESIGHT(2023): Summer Internship at Qube Research & Technologies | Ashutosh Ghuge |\n\n--\n\nListen\n\n1) Brief Introduction\n\nHey everyone! I am Ashutosh Ghuge, a third year undergraduate student pursuing Instrumentation Engineering at IIT Kharagpur. As for my campus involvements, I was the Governor of Encore. I did my summer internship at Qube Research & Technologies, Mumbai, as a Quantitative Research Intern.\n\n2) How did you get into QRT? What was the selection procedure?\n\nIt was the first time QRT visited IIT Kharagpur, and other IITs as well, for internships last year. It was a Day 3 company. It offered two profiles Quantitative Researcher and Quantitative Technologist, and I had applied for both as I was primarily targeting Quant and SDE.\n\nThe company shortlisted around 15 people for the interviews. There was no preliminary test, so the shortlisting was mostly based on department (Circuitual + Economics) and CGPA. There were three rounds of interviews.\n\nThe first round started off with a casual conversation about my interests in Machine Learning, followed by a few questions on the methods and evaluation metrics of Regression. The second round was a follow-up on the topics discussed in the first round, some basic problems to test my coding skills, and a brief discussion about a project on my CV. The final round was supposed to be an HR round but was more of a semi-technical round where a mix of HR and Machine Learning questions were asked.\n\n3) How do I prepare for them?\n\nFor the Quantitative Research profile, a good grip on Machine Learning concepts would help, as the majority of the interview was based on that. This website (https://machinelearningmastery.com/) has a very exhaustive collection of blogs on almost all topics in machine learning and could be used as a good source for brushing up concepts.\n\nApart from this, from a general Quant preparation point of view, having a sound knowledge of probability and statistics will go a long way.\n\n(A few resources to exploit: 50 Challenging Problems in Probability, BrainStellar(website), Heard on the Street)\n\nHaving finance knowledge or prior experience in the same is not a necessity, nevertheless it will definitely give you an edge.\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nAs I mentioned earlier, QRT visited campuses for the first time for internships, so my preparation was not very company specific. I was primarily targeting SDE roles at first, but during my preparation I was inclined towards quant roles as well. While preparing for SDE roles, I used to spend hours doing DSA prep, which would get highly monotonous after a point, so brushing up on probability and doing a few brain teasers would strike a good balance. Thus, in my experience, preparing for SDE and Quant roles went quite hand-in-hand.\n\n5) According to you, who should ideally apply for this job?\n\nGenerally, quant companies do not have a very strong bias towards people with prior experience with finance, so do not hold back from applying for such roles if you aren’t very well versed with finance jargon (neither was I). If you are looking for a job where you constantly have to kindle your brain and love to play around with statistics, this is definitely the place for you.\n\nThe application of deep learning in finance and quantitative trading is getting increasingly popular, so if you’ve got a knack for it, feel welcome!\n\n6) Any specific advice you want to give to the junta sitting for internships this year.\n\nWell, CDC internships is quite an interesting phase. There will be times when you’ll be questioning your life choices and wondering if you even like the field you are preparing for. Worry not; you are not alone! As good and attractive as a PPO is, internships are primarily meant for you to explore the industry a little and make clearer life choices ahead. So, as they say, it very much isn’t the “end of the road”. Off-campus holds a ton of far better opportunities. It does come at the cost of a tad bit more struggle, however I’ve seen people get the best out there.\n\nPrep as much as you can, target at least two profiles so that you have better chances, and trust your preparation. It’ll be quite the roller-coaster so do not forget to have fun! All the best, y’all!\n\n7) What are some of the major points you think would be valid to mention in your CV while targeting this profile?\n\nIt is good to have a few projects/internships and coursework regarding Machine Learning on your CV. Apart from this, some software development experience will also add value, especially for the Quantitative Technologist role.\n\nAs I mentioned earlier, finance experience is not a necessity; however, if you have any, do highlight it."
    },
    {
        "job_role": "Quant",
        "company_name": "Goldman Sachs",
        "info": "STAT 110 is a super helpful course.Easy/ moderate questions on the interview bit is compulsory.In the coursework section of CV, highlight probability and data science courses",
        "content": "FORESIGHT(2023): Summer Internship at Goldman Sachs | Harsh Sukheja |\n\n--\n\nListen\n\nBrief Introduction\n\nHello, I am Harsh Sukheja, a 4th year dual degree student from the department of E&ECE. In this blog, I am going to share my journey of how I got an internship in Goldman Sachs and their selection procedure.\n\nHow did you secure an internship at Goldman Sachs? How did you prepare for the same?\n\nMy journey started during the summer of 2021, right after the end of the 4th semester. It was a difficult time due to the pandemic, and we had very little to do. As per the advice of my seniors, I started doing CP (Competitive Programming). I was also doing two online internships simultaneously, which were unpaid, so I didn’t feel much pressure. However, I would not recommend doing two paid internships in parallel.\n\nMy main focus was on CP, although I wasn’t good at it. As soon as the 5th semester started, I stopped doing CP. I resumed it during the December break but left it again when the 6th semester started. I had secured a Mitacs internship for the summers of 2022, which was one of my biggest achievements and challenges. At that time, I didn’t want to pursue research and was worried about my preparation for the CDC internship. However, I took the offer for Mitacs for two reasons: the project was on statistics, which would boost my CV, and who doesn’t want a foreign trip?\n\nLuckily, my Mitacs project was not overloaded, and with the CDC internship in mind, I allocated an hour daily for my CDC preparation in May and June. I started ramping up those minutes in July. I cut my Mitacs internship one week short because the CDC internship test started earlier than expected, but I still missed the tests of a few companies, including Microsoft software, while I was on the flight.\n\nMy preparation was for Quant and Data profiles, and I was targeting Goldman Sachs the whole time because my CG was 8.98 at that time, so HFTs were out of scope.\n\nWhat was the selection procedure like?\n\nOn Day 1, I got shortlisted for GS only, so I was laser-focused for the interview. They took two rounds of interviews. In the first round, they asked me to give my introduction, and in the intro only, I made it clear that I wanted to go on the quant side (not telling them explicitly but giving hints like I like betting, guessing, probability, etc.). Then, they asked me questions based on my Mitacs project, for which I was well-prepared as I had just recently finished it.\n\nThen some basic probability questions and 1 CP question in each round. Few of which I remember,\n\n(i) Fair coin, prob of heads, prob of 3 heads, unfair coin: make a fair game.\n\n(ii) ant on cube can go to vertices randomly, expected time to reach diagonally opposite corner\n\n(iii) ant inside/on cube\n\n(iv) Time complexity of sieve, how its log of log\n\n(v) modified question on binary search\n\n(vi) prob of 3 points being in a semicircle\n\nOverall, my interview felt satisfactory to me and turned out satisfactory for them as well.\n\nWho should ideally apply for this job?\n\nIf you have an interest in Probability/ Combinatorics/ Statistics, you should apply for the Quant role in GS.\n\nAny specific advice for aspirants applying for internships this year?\n\nHere is some advice that is limited to the Quant role only:\n\n(i) STAT 110 is a super helpful course. I watched till lec 20 and did their exercises (important) as well.\n\n(ii) Heard on the street, Brainstellar, 50 challenging problems of Probability (attempt in this order preferably). Repeat the sequence again.\n\n(iii) Easy/ moderate questions on the interview bit is compulsory. Can/ Can’t attempt hard based on time available/ skill level.\n\n(iv) In the coursework section of CV, highlight probability and data science courses.\n\n(v) Having a project in statistics/ modeling/ probability is a huge boost.\n\nMost importantly, be calm during the whole process. I know it’s easy to say and hard to do from my experience. But I had some awesome friends around to help me do that, and everything turned out to be well after a lot of overthinking (which you should avoid).\n\nAll the best Junta for the upcoming CDC internship drive. Machake!"
    },
    {
        "job_role": "Quant",
        "company_name": "AlphaGrep Securities",
        "info": "If you are targeting Quant role, you can prepare puzzles from 50 Challenging Problems in Probability by Frederick Mosteller, Heard on the Street by Timothy Falcon I studied Object Oriented Programming from the course slides and GeekforGeeks.",
        "content": "FORESIGHT(2023): Summer Internship at AlphaGrep Securities | Rishit Singhania |\n\n--\n\nListen\n\nBrief Introduction\n\nHello! I am Rishit Singhania, a fourth year undergraduate from the Department of Mathematics, IIT Kharagpur. I am a boarder of JCB Hall of Residence. I will be interning at AlphaGrep Securities in the Summer of 2023 as a Quantitative Trading Intern.\n\nHow did you get into Alphagrep Securities? What was the selection procedure?\n\nI got my internship through the CDC Internship process.\n\nThe first step was a common coding round for both Quant and Software roles. The questions were pretty good. The test comprised 5 questions to be solved in 90 minutes. Implementation skills matter a lot in these rounds. Even if you get the logic correct, you may end up making silly mistakes in your implementation thus losing vital time debugging your code.I was shortlisted for both Quant and Software profiles. In the interview for the Quant role, I was asked questions on conditional probability, puzzles and linearity of expectation. I was also asked a few algorithmic questions.\n\nHow to prepare for them?\n\nI started Competitive Programming after my first year. I would recommend giving contests on Codeforces and Atcoder. You should regularly take part in Atcoder Beginner Contests (ABC), usually held every Saturday. I felt that I got to learn something new after every ABC I took part in. For the interviews, you should complete the problems present in Interviewbit as they are slightly different to the problems you encounter in contests.\n\nFor studying Probability and Statistics, I followed the Stats 110 course available on YouTube. If you are targeting Quant role, you can prepare puzzles from the following resources:\n\nI studied Object Oriented Programming from the course slides and GeekforGeeks. If you have mentioned other CS courses in your CV, be prepared to answer questions on those topics in the interviews.\n\nYou should also take part in Grimoire of Code CDC Series contests which are organized nearer to the start of coding rounds. These contests contain questions from previous year coding rounds and can thus can be of great help.\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nOne of the major problems that I faced was not being able to decide what to do during the last few days before the interviews. I used to waste a lot of time making changes to my CV.I would highly recommend having a group of at least 2–3 people having the same targets as you. This helps a lot during the preparation phase as it creates a healthy environment where you can learn from each other and even push each other to work harder.\n\nAccording to you, who should ideally apply for this job?\n\nIf you are interested in the Quant role, you can apply for this role. HFTs usually prefer to take people from circuital departments.You need to have a decent grasp of Competitive Programming and be good at solving puzzles.For the systems role, you need to be prepared with core CS concepts such as Object Oriented Programming.\n\nAny specific advice you want to give to the junta sitting for internships this year?\n\nDuring the internship process, there will be times when you are going to doubt yourself. You need to have faith in yourself. Whenever you feel anxious, talk to someone close to you. Taking care of your mental health is really important. Eat healthy food and get plenty of sleep. Also this is the worst time to compare yourself with others. Just focus on yourself. You are going to be fine, believe me.\n\nYou should also be aware that you get partial points in most of the coding rounds. So if you are stuck with a problem, you can submit a brute-force to pass a few test cases and get partial points. Do not panic and be calm because if you make mistakes in your implementation, you will lose crucial time debugging your code.\n\nWhat are some of the major points you think would be valid to mention in your CV while targeting this profile? (any specific suggestions you would like to make?)\n\nHaving a high rating on Codeforces is always a major plus. You can also mention the ranks that you obtained in popular coding contests such as Google Kickstart and Facebook HackerCup.\n\nIf you have taken part in ICPC, make sure to mention that too. Do not mention courses or skills just for increasing the content of your CV. If you are not able to answer questions on something mentioned in your CV, it leaves a bad impression on the interviewer.\n\nTry to keep your CGPA above 9.\n\nIf you have any doubts, you can always reach out to me on Facebook."
    },
    {
        "job_role": "Quant",
        "company_name": "Graviton",
        "info": "Apart from regular contests on Codeforces, CodeChef & Atcoder, do participate in competitions like ICPC, CodeJam, Kickstart, HashCode, HackerCup, SnackDown, etc. Mentioning good ranks in these contests give a huge boost to one’s CV.",
        "content": "FORESIGHT(2023): Summer Internship at Graviton| Shivansh Shukla |\n\n--\n\n1\n\nListen\n\nBrief Introduction\n\nHello everyone, I am Shivansh Shukla, a 3rd year undergraduate from the Department of Computer Science and Engineering, enrolled in its B.Tech course. I will be interning at Graviton Research Capital in the summer of 2023.\n\nHow did you get into Graviton? What was the selection procedure?\n\nI got into Graviton via the CDC Internship Program. Initially there was a test on HackerEarth, consisting of 2 coding problems to be solved in 75 minutes. First one was a hard shortest path problem involving Edge Space Reduction by constructing Pseudo nodes. Second problem was easy-medium based on number theory & sieve. I submitted both problems 32 minutes before the end of the test. They shortlisted 10–12 people who solved both problems.\n\nHow to prepare for them?\n\nCP is the most important skill required to grab an internship through CDC in day 1–2 companies. The difficulty of problems in coding rounds is increasing year by year. Apart from regular contests on Codeforces, CodeChef & Atcoder, do participate in competitions like ICPC, CodeJam, Kickstart, HashCode, HackerCup, SnackDown, etc. Mentioning good ranks in these contests give a huge boost to one’s CV.\n\nMake sure to upsolve at least one problem more than what you could solve during the contest otherwise you’re practically not making any significant progress despite the rating changes . Also, check out editorial & discuss with friends to get to know about alternate approaches for a problem.\n\nAlso, prepare for OOPS & have a thorough knowledge of C++ STL containers as many companies ask questions regarding them during interviews. Additionally for dual-degree students, CS fundamentals like OS, Networks, DBMS, etc also plays an important role during interviews.\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nAs I was mainly targeting HFTs for which good CP ratings play a major role, the main difficulty for me was to improve my CP skills and increase my ratings on Codeforces and Codechef.\n\nFor that, I started participating in CF from my alt account [shuklaji1102] & made sure to upsolve & look at editorials as much as possible. I also started solving A2OJ div2D ladder & covered around 30 problems there. Meanwhile, I learnt Segment Tree from cp-algorithms.com and practised problems in the CF-Edu section. After this, I spent the complete month of May on DP covering Simple DP, DP on trees, DP with bitmasking, Digit DP — first watching the respective Kartik Arora’s playlist & then solving problems mentioned in various CF blogs. I also solved & highly recommend everyone to completely solve all problems of AtCoder Educational DP round — it covers almost all types of DP problems which you would be encountering at least till reaching purple in CF. After this extensive practice, DP & tree became my strongest topics and I was even able to solve 2200–2300 rated CF problems sometimes during the contests. Besides, I participated in all GOC-CDC series contests and it helped me a lot to understand the type and difficulty of questions asked in coding rounds of last year.\n\nAccording to you, who should ideally apply for this job?\n\nAnyone having deep interest in problem-solving, willing to learn how HFTs work and is ready to spend enough time on a fast paced competitive environment should apply for this company.\n\nAny specific advice you want to give to the junta sitting for internships this year.\n\nDon’t get demotivated if things are not going according to the way you thought. Be patient, have faith in God and keep working hard, eventually you’ll reach there! Try to be in constant touch with family members or friends who can motivate you through this journey.\n\nSome points regarding Coding Rounds : Make sure you choose the language you want to code in at the beginning itself. Few platforms don’t allow copy-paste & your entire hard work may go waste. Also, try completing all problems as early as possible as many companies consider time of submission while shortlisting candidates. Do read the instructions very carefully and understand the policy of switching between various sections. If you can’t think of a complete solution or you’re not sure about your complete solution & running out of time, prefer submitting a brute force solution first with an aim to pass as many test cases as possible.\n\nWhat are some of the major points you think would be valid to mention in your CV while targeting this profile?(any specific suggestions you would like to make?)\n\nCV, as such, doesn’t play a crucial role for day 1–2 companies. For HFTs, it would be good if you mention ranks in various competitive programming competitions and also your ratings in platforms like Codeforces and Codechef. One of my interviewers explicitly asked me about my CP achievements towards the end of my interview. Projects and EAA do not matter much if you’re targeting HFTs."
    },
    {
        "job_role": "Quant",
        "company_name": "Morgan Stanley",
        "info": "You should solve the ‘top 100 puzzles asked in interviews’ from GFG as they are asked directly(in other companies’ interviews as well). Interviewbit should be enough for the coding questions.",
        "content": "FORESIGHT(2023): Summer Internship at Morgan Stanley | Mayank Agarwal |\n\n--\n\nListen\n\n1) Brief Introduction\n\nHello, I’m Mayank Agarwal, a fourth-year undergraduate student of Mathematics and Computing at IIT Kharagpur. I’ll be interning at Morgan Stanley in its Strats and Quant role.\n\n2) How did you get into Morgan Stanley? What was the selection procedure?\n\nI got into Morgan Stanley via the on-campus hiring organized by the Career Development Centre, IIT Kharagpur.\n\nMorgan Stanley had an online test that consisted of four sections — Aptitude, English, Finance, and Coding. Each section was around thirty minutes long.\n\nThe Aptitude section had questions on probability, mathematical reasoning, puzzles, etc. A lot of questions were there to be solved in significantly less time. The English section was an SVAR test that analyzed our hearing, speaking, and overall proficiency in the English language. The Finance section had questions that were new to me, so I had to make a lot of guesses. There were two questions in the coding section on Binary Search and Dynamic Programming, which were pretty straightforward.\n\nMorgan Stanley shortlisted ten students for the interviews. There were three rounds. In the first round, I was asked many questions on probability and puzzles. In the second round, I was again tested a bit on probability, and then he asked me two coding questions — binary search on a matrix and DFS on trees. The interviewer seemed to be in a hurry and was interested in the most optimal solution only. Lastly, in the HR round, we discussed my projects. She also asked me a few situational questions.\n\nFinally, two students were given the Internship offer.\n\n3) How to prepare for them?\n\nI had started giving contests on Codeforces and CodeChef in my second year and solved the programming questions on Interviewbit in the months leading to the internship tests. The online test can seem lengthy, and I recommend giving each section equal importance.\n\nFor the interviews, you should revise basic probability and statistics. You should solve the ‘top 100 puzzles asked in interviews’ from GFG as they are asked directly(in other companies’ interviews as well). Interviewbit should be enough for the coding questions. Prepare your CV well; you can expect a lot of questions on it. For the situational questions, try to give cases and be as elaborate as possible. Regarding your project, you should know what you have done and present it confidently. The topic of the project doesn’t matter much.\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nI hadn’t prepared finance for the tests or the interviews, so I couldn’t answer many questions in the test. Thankfully, it was not an issue during my interviews, as nothing was asked related to it. Companies often say that knowledge of finance is optional; however, having information about the basic concepts can be a plus.\n\nDuring my first round of interview, I was asked to solve a question on probability using a specific concept that I didn’t know. It’s okay to not know stuff. You are not expected to know everything. The interviewers are helpful. He explained it to me and gave me another question which I answered.\n\n5) According to you, who should ideally apply for this job?\n\nAnybody who likes coding and working with numbers should apply for this job. Interest in finance is not a must, and it shall come gradually.\n\n6) Any specific advice you want to give to the junta sitting for internships this year.\n\nMake the best use of the vacation. Plan accordingly to prepare your best. Give contests on sites like Codeforces to stay in the groove for your coding tests, as speed is a significant factor. Think out loud during the interviews so the interviewer may guide you if you’re stuck. Be thorough with your CV to be able to explain anything written on it.\n\n7) Kindly attach your resume. What are some of the major points you think would be valid to mention in your CV while targeting this profile? (any specific suggestions you would like to make?)\n\nHaving a project on your CV definitely helps. It can become a great point of discussion. You can also mention your achievements in coding competitions like Kickstart, Hackerrank, etc.\n\nThe whole process can be hectic. Make sure you eat and sleep properly. You can always reach out to me for any queries.\n\nBest of Luck, guys!"
    },
    {
        "job_role": "Quant",
        "company_name": "Morgan Stanley",
        "info": "For Puzzles, make sure to solve questions from the book Heard on the Street, all puzzles from Mindsteller and GeeksforGeeks. A lot of questions that were asked in interviews were direct or derived from Hard rated puzzles from GeeksforGeeks itself.",
        "content": "FORESIGHT(2023): Summer Internship at Morgan Stanley| Jaya Kediya |\n\n--\n\nListen\n\nHello, I am Jaya Kediya. I am a fourth year undergraduate enrolled in the 5-year integrated M.Sc. Course of Mathematics and Computing. I was born and brought up in Varanasi and have done most of my schooling from a boarding school in Dehradun. I enjoy solving puzzles, debating, reading, and talking about a lot of things in general, so feel free to ping me anytime :))\n\n2)How did you get into Morgan Stanley? What was the selection procedure?\n\nThe selection procedure included one online test and then interviews on Day 1 itself.\n\nThe online test had four major sections. The first was aptitude+ quant- it mostly had questions based on probability, puzzles, logical reasoning and some basic trigonometry. The second section was English — it had comprehension-based questions, basic grammar questions and also tested one’s listening and speaking skills. The third section was on finance and the fourth was coding. The coding section had two questions, which were different for every candidate. Usually one question was very easy and basic ( for eg. Finding GCD of an array ) and the other question was medium to hard (eg. Resource Allocation Problem, DP etc)\n\nDoing well in three out of four sections and having a good CGPA is enough to get one shortlisted for the interviews.\n\nThere were a total of three rounds for the interviews — 2 technical and 1 HR.\n\nThe first round began with questions based on CV. Being well prepared about all projects / interns that you have done is necessary here. The interviewer asks some questions based on any one project / internship in detail. So, it’s important to know what exactly you worked on and how it was impactful. After CV based questions, the interviewer asked a few CP questions — which ranged from medium to hard. Most of these were similar to leetcode and interviewbit questions. I was asked a few questions on trees, dynamic programming and arrays. After this, the interviewer asked a few puzzles and once he was satisfied with my performance, asked me to wait in the meeting for the second round.\n\nThe second round was slightly more tough and more quant focused. It was also a pressure test to see how one survives under pressure when asked multiple questions rapidly. There were around 8–9 questions asked in rapid fire format- as in, the interviewer wanted answers very quick. The questions ranged from probability questions to some hard puzzles. There were a lot of questions on distributions, expectations etc. I was also asked to prove a question based on geometric distributions and derive a result.\n\nAfter the second round was over, I was immediately sent to the HR round. Here, the HR asked some situational questions (eg, I was asked about a time where I have resolved a conflict in a group). The main focus is to judge whether you’re someone who is comfortable working with teams and have a collaborative and amicable nature. At the same time, they also try and get an idea about your personality and ensure you’ll be a good fit for the firm culture.\n\nSoon after the HR round ended, I received a call regarding the offer.\n\n3. How to prepare for them?\n\nFor the entire process, two things must be focused upon\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem\n\nGiven that I hadn’t done a lot of CP beforehand, the biggest challenge for me was to up my skills in that area in the summer before the CDC internship drive. One thing that helped get a quick and good grasp of concepts was Algozenith videos. They’re structured in a way that makes it easier to do well in a shorter time frame, so I’d definitely recommend that for those who haven’t been doing CP for 6 months or so already.\n\nOther than that, other challenges are getting good at thinking through puzzles. Initially, approaches to some probability questions/ puzzles might not strike as quickly, but it’s all about practice, so one should practice as many questions as possible.\n\nThe key is to be confident in your abilities and have a good set of friends who can help you get through the process.\n\n5) According to you, who should ideally apply for this job\n\nAnyone who is interested in coding, prob-stats and quant/math in general and has an inclination or interest in finance should apply for this internship. You don’t necessarily need to have much finance knowledge since this is a more quant role than finance, so don’t worry if you aren’t preparing for finance profile. There was no finance asked in the interview rounds at all.\n\n6) Any specific advice you want to give to the junta sitting for internships this year\n\nAlso, remember that this is just one part of life, and don’t be too harsh on yourself. Take care of your health, nothing is worth sacrificing on that, and give it your best shot. All the very best :))\n\n7) What are some of the major points you think would be valid to mention in your CV while targeting this profile?(any specific suggestions you would like tomake?)\n\nMention any accolades that you have academically and all projects and internships you have done in the past. Also make sure to be thorough with each of them, you should know what exactly your role was and what your work entailed in detail. Morgan Stanley also places some weightage on CGPA, so try and maintain a good CGPA. They also pay some importance to co-curriculars etc so it’s good to mention a few on your CV since that helps them get an idea of your personality.\n\nDon’t stress too much about the CV though, firms like MS have a stronger emphasis on getting to know your skills based on questions and the test, so CV doesn’t become as important. Build your CV well, get it reviewed by seniors and focus more on the prep for tests and interviews."
    },
    {
        "job_role": "Quant",
        "company_name": "NK Securities",
        "info": "Codeforces contests are helpful to increase speed and debugging skills but the type of questions asked in coding rounds and CF contests differ a lot. C++ concepts can be revised by referring to the OOPs, OS slides from the course taught in KGP",
        "content": "FORESIGHT(2023): Summer Internship at NK Securities & Google| Shrinivas Khiste|\n\n--\n\nListen\n\n1) Brief IntroductionHi, my name is Shrinivas Khiste. I am a fourth year undergraduate student from the Department of Computer Science and Engineering enrolled in its Dual Degree Programme. I am from Aurangabad, Maharashtra. For my internship, I had prepared for ML and Software roles. I had received an offer from Google and NK Securities. I chose NK over Google because the opportunity to learn at NK would be much more and if I wanted to shift to software roles later, I could do that too. You can contact me if you are interested in ML opportunities too. In CDC, I think the best role is the one from Adobe for ML. Microsoft is good too but there is a gender bias there.\n\n2) How did you get into NK Securities / Google ? What was the selection procedure?NK Securities: First there was a coding round that consisted of 2 questions with medium level CP problems. First question was an application of STL and the other was on Tree DP. Then during CDC Day 1 there were 2 interiew rounds, each lasting for about an hour. Both the rounds consisted of questions on CP, C++ Concepts, Maths Puzzles (with questions on probability) with increased difficulty in the second round. There was no HR round.\n\nGoogle: Google also started with a coding round with 2 questions. They had a time duration between which you could give the test anytime. The questions are sampled from a question bank. One question was easy and the other one more difficult. Google generally asks questions on DP and graphs. Then there were 2 rounds of interview. Interview rounds of Google are generally very easy. Both the rounds had basic question of STL in my case. But they do ask DP and Graphs sometimes. There was no HR round.\n\n3) How to prepare for them?For CP, I had taken the Algozenith course and solved Interview Bit problems. If you do not wish to take any course, then you can solve leet code problems and complete the Interview ladder. Codeforces contests are helpful to increase speed and debugging skills but the type of questions asked in coding rounds and CF contests differ a lot. C++ concepts can be revised by referring to the OOPs, OS slides from the course taught in KGP. They have sufficient detail if not more. GFG blogs can also be useful if you do not understand any concepts. The Algozenith course also covers these concepts well.For maths puzzles, questions from Brainstellar (upto medium level) and Heard on the street should be enough. Questions on probability are generally based on Expected Value calculations, Bayes theorem, etc. (Not on probability distribution). Questions on these can be found on GFG ( and Algozenith again :P).\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem? I think the major barrier is practising CP. It can be disheartening sometimes as you are unable to solve problems initially. A good peer group where you can discuss problems can help. CP is a skill that comes with practise and a lot of it. Do not give up, you will eventually get better at it.\n\n5) According to you, who should ideally apply for this job?NK: Someone interested in core computer science concepts can consider applying for the systems roles at HFTs. For quant roles, people interested in maths, probability, ML can apply. HFTs are a high effort, high reward kind of job. So you should be ready for this kind of work. If you are confused between Software and HFT roles you should try HFTs (except for maybe Glean, Rubrik) as you will be able to learn a lot more here and shifting to a software role later will be easier too. Google: After the top software startups (Glean, Rubrik), Google is the best choice for a software role.\n\n6) Any specific advice you want to give to the junta sitting for internships this year.Stay confident and believe in yourself. Try to be interactive during interviews and do not panic. You can take a short break, maybe drink some water if you loose your calm. Regarding tips during preparation, we all practise CP. But some companies ask some extra things like APT ask implementation of Data Structures you learnt in Algo 1, Nutanix asks questions on Binary Trees, Linked Lists, etc and some other companies do too. For Google prepare DP and Graph well. Keep some time just before the interviews to revise concepts specific to companies you will be interviewing for.\n\n7) What are some of the major points you think would be valid to mention in your CV while targeting this profile?(any specific suggestions you would like to make?)Some important things to mention in the CV are CF Ratings, Kickstart Ranks or any other coding competitions. I did not have very good ranks but these will matter during selections in other HFTs too. Apart from them you should have one project that you can talk about. CSE students can add their course projects too.\n\nHere is my resume (I was preparing for ML roles too hence this not how a typical software role resume will look like (you do not need such projects in your resume for software roles))."
    },
    {
        "job_role": "Quant",
        "company_name": "Trexquant",
        "info": "The test was designed to test two things: your understanding of financial markets and your approach to modelling a problem using Machine Learning.",
        "content": "FORESIGHT(2023): Summer Internship at Trexquant | Srimahn |\n\n--\n\nListen\n\n1) Brief Introduction\n\nI’m Srimahn, a final-year undergraduate student of Economics at IIT Kharagpur. I am currently working at Trexquant as a Quantitative Research Intern.\n\n2) How did you get into Trexquant? What was the selection procedure?\n\nI got into Trexquant through the CDC Internship Program. Trexquant usually recruits interns only through their GAR program, but they visited our campus this time.\n\nThere were two rounds of selection after a usual CV shortlist. The first round was a short subjective test, followed by a personal interview ( two for some candidates).\n\nThe test was very unorthodox for two reasons - one, it was purely subjective and two, we were encouraged to use the internet during the test. It was designed to test two things: your understanding of financial markets and your approach to modelling a problem using Machine Learning.\n\nThe interview was purely technical. They grilled me on my CV, and then I was asked to code a simple CP problem live (Python was preferred).\n\n3) How to prepare for them?\n\nSince quant is essentially a combination of data and finance, you would be required to do both.\n\nFinance: Zerodha Varsity and Bloomberg Market Concepts are great resources. Open a Zerodha account and just play around with some money\n\nDSA: GeeksForGeeks or any random Youtube video for arrays, sorting and searching\n\nML: Andrew NG’s is the go-to course. Do at least one project from scratch to be comfortable with implementation.\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem ?\n\nI hadn’t done any kind of CP before CDC. But most of the companies I applied for asked CP questions in some part of the selection process. Thanks to my friends, I made up for the lack of preparation by discussing problems with them over the last few days. Since I wasn’t very comfortable in C++, I coded in Python during tests (which helped during my interview).\n\n5) According to you, who should ideally apply for this job?\n\nAnyone who, has an understanding of, or willing to learn the working of the global macroeconomy and markets enjoys playing with data\n\ncan work independently in an environment which is highly competitive as well as rewarding\n\nis a rapid learner, creative and comfortable with taking risks\n\n6) Any specific advice you want to give to the junta sitting for internships this year.\n\nAlthough CDC internships are a one-time chance, you should choose companies and roles wisely. Keep working on your interests and expand your skill set; you are bound to emerge victorious at the end!\n\nMake a group of friends targeting similar profiles and help out each other during the preparation. Always feel free to reach out to seniors or anyone else for queries.\n\nLastly, it is important not to succumb to peer pressure and other overwhelming stuff around. Remember that perseverance pays off, and remarkable opportunities await.\n\n7) What are some of the major points you think would be valid to mention in your CV while targeting this profile?(any specific suggestions you would like to make?)\n\nGenerally, it is quite hard to find a project or intern relevant to this field. So, it would be optimal to have a mix of points relating to finance and data in your CV. Additionally, try to explore different techniques like NLP in addition to traditional ML.\n\nI encourage students to intern somewhere (there are a ton of new quant-related startups) in the summer so that your CV stands out."
    },
    {
        "job_role": "Quant",
        "company_name": "Goldman Sachs",
        "info": "I had two rounds of technical interviews (some people had three rounds) on Zoom where I was asked logic-based puzzles and questions on probability and statistics.",
        "content": "FORESIGHT(2023): Summer Internship at Goldman Sachs | Himadri Pandya |\n\n--\n\nListen\n\n1) Brief Introduction\n\nHi Everyone! I am Himadri Pandya, a 4th-year undergraduate student of the Department of Mechanical Engineering. I am a boarder of Sarojini Naidu/Indira Gandhi Hall of residence. I sat for the CDC Internship drive last year and have joined Goldman Sachs as a Summer Analyst for the summer of 2023.\n\n2) How did you get into GS? What was the selection procedure?\n\nIt’s fair to say that Goldman Sachs was my highest preferred company throughout my CDC preparation, after the shortlists and during the interviews. I focused my preparation around GS all throughout the summers and started solely preparing for the interviews once I was certain that I had performed well in the test and was expecting to get shortlisted for the interviews.\n\nThe selection procedure consisted of:\n\na. Test (for shortlisting): The test had 4 sections which were timed separately:\n\nb. Coding Section: This section had two medium to hard coding questions to be attempted in C++\n\nc. Probability, Statistics and Puzzles: This section had 25 questions on probability and statistics including a few easy puzzles\n\nd. Essay Question: This section was for language fluency in which we had to write a short paragraph on a given topic\n\ne. Computer Architecture: This section had around 20 questions on core CS topics including operating systems and algorithms\n\nf. Personal Interviews: I had two rounds of technical interviews (some people had three rounds) on Zoom where I was asked logic-based puzzles and questions on probability and statistics. They asked me the logic I would use to implement certain coding questions but I wasn’t asked to explicitly code anything. It started off with easy questions and progressed towards more difficult questions. I was called to a meet after these two rounds to confirm the offer.\n\n3) How to prepare for them?\n\n4) What difficulties did you face while preparing for this Company/ Profile? How did you overcome this problem?\n\nThe difficulties that I faced were primarily centered around the time that I was able to give to the preparation because of my extra-curricular involvements in KGP and the fact that I started my preparation a bit later than others. You shouldn’t face any of these problems for this particular role if you’ve been consistent and disciplined throughout your preparation\n\nOther than that, I’d suggest you contact seniors who have prepared for similar roles that you are interested in and get insights from them. Being connected will give you a more channeled approach and will also be a constant mental support when you need it.\n\n5) According to you, who should ideally apply for this job?\n\nThe selection procedure revolves around problem solving abilities so folks with a natural knack for coding and logic-based puzzles have a slight edge in the entire process. However, one can conveniently prepare for all the sections by planning out their preparation well and following the deadlines they set for themselves. The internship majorly involves coding so if you’re someone who hates programming then this possibly isn’t the best option out there.\n\nRegardless, it’s a sought-after day 1 role and a great option for those opting for tech profiles.\n\n6) Any specific advice you want to give to the junta sitting for internships this year.\n\nIn general for tech roles, coding is very important and should ideally take up at least 80% of your prep time. It is very important to plan how much time you will be devoting to each question during the tests. Try to gauge if you will be able to solve the question immediately after reading it or if you’ll have to go for a partial solution and thus a partial score.\n\nYour performance in the test is an essential data point both before and during your interview and has a role on how they perceive you throughout given the limited information they are given. So it is preferable to try to perform exceedingly well in the tests to have a good pre-impression on the interviewer. In fact, it is practically improbable to interview for more than two companies on a given day so your focus should not be to get multiple shortlists but to get preferable shortlists in the companies you’re genuinely interested in. It is better to perform “very well” in a few tests and disastrously in the others and getting 2 shortlists than performing “decently” in multiple companies and getting multiple inconvertible shortlists.\n\nAs for the interviews, be very clear about your preferences in case you have multiple shortlists. By the end of the tests you should be able to get a fair idea of whether or not you have a chance of getting shortlisted for a given company. Once you’re ready with your preferences your sole focus should be to prepare for interviews and contact as many seniors as possible to understand what type of questions are asked and be certain about evaluations metrics for various companies. For example, I was shortlisted to interview for LEK but was fairly certain about getting a shortlist at GS and since I was clear about my preferences I devoted all my time to prepare for GS while skipping any and all case prep.\n\nOther than that, once you are certain about a shortlist in a few of your highly preferred companies you can consider skipping a few tests to prepare for the interviews of your preferred companies. It can be somewhat categorized as a gamble but if done correctly it can give you a very sharp edge during interview preparation since you’ll have to draw a line for preferences at some point anyway. Better sooner, than later.\n\n7) What are some of the major points you think would be valid to mention in your CV while targeting this profile?(any specific suggestions you would like to make?)"
    },
    {
        "job_role": "Quant",
        "company_name": "APT",
        "info": "I would estimate the question complexity to span 1400–1800 Codeforces rating or so, the questions were definitely of a slightly higher level than the average CDC coding test that season.",
        "content": "FORESIGHT(2023): Summer Internship at APT | Ishan Manchanda |\n\n--\n\nListen\n\nBrief Introduction\n\nI’m Ishan Manchanda, an undergraduate student in the Industrial and Systems Engineering department, pursuing a bachelor’s degree. I’m a member of the Debating Society and now an Advisor at the Kharagpur Open Source Society. Previously, I’ve been a member of the Perception team at Aerial Robotics Kharagpur and an associate at Business Club. I sat for the CDC Internship drive last year and will have my internship in the Quantitative Research and Development role at APT Portfolio Pvt. Ltd. this summer. I’m a boarder of Nehru Hall and currently live in Gurgaon.\n\nHow did you get into APT? What was the selection procedure?\n\nThe first stage was a 2-hour online coding test. The test comprised 6 coding questions, no MCQs or anything else. I would estimate the question complexity to span 1400–1800 Codeforces rating or so, the questions were definitely of a slightly higher level than the average CDC coding test that season. I did quite well in the test — in the ballpark of 3 or 4 fully correct questions and the remaining having between 60 and 80% test cases passing, and was moderately confident about expecting a shortlist.\n\nShortlists were announced based on test performance (possibly including some contribution from the resume, I have no information about that). I had filled APT as my priority so had my first round of interviews at 8 am. The first interview was on Google Meet with a shared Hackerrank link, where I had to run my code to demonstrate correctness. There were no formal test cases, the interviewer verbally described some to me or asked me to come up with them myself and write some minimal boilerplate code to run my solution against them. The round was entirely based on trees. I was first asked about the different traversals and had to implement one. Then, I was asked to write an algorithm to edit the tree so that the in-order traversal of the new tree was equal to the pre-order traversal of the original, or something similar. I developed a solution using an external stack which the interviewer was surprised to find out. After I demonstrated correctness and implemented his test case, he asked me to optimize away this space usage by reusing pointers within the tree. I took some time here but with some hints, I was able to implement a solution. I was asked one final modification to this question which I only verbally described as we were out of time. The interview overran the timeslot and lasted 65 minutes, immediately after which I was asked to join the next round.\n\nThe next round was a change of pace as it did not involve CP at all — it was entirely based on logic puzzles such as those on Brainstellar and math questions. I was able to do most questions well, but one of the math questions was proving a theorem about the subsets of a set of numbers and I took a lot of hints and time to reach the end of it. This single question probably took 30+ minutes in the interview. I was quite disheartened during this, and I think my saving grace was that I was constantly thinking out loud so the interviewer could see that I was trying many different approaches (which might have been incorrect but were something). Toward the end of the interview, I was asked a singular non-technical question about “Why Quant?” I responded by saying it lay at the intersection of my interests in Machine Learning, Algorithms, and Securities Markets. This round also lasted ~one hour, and within 5–10 minutes of it ending, I was called back for a third round.\n\nThe third round had a mix of small CP questions that I was asked to verbally describe my approach to (along with time/space complexity analysis), along with some more puzzles and math questions. One of the math questions again involved a multi-stage proof about coloring points on a 2D plane and I was able to solve all versions of it, with some hints. The interview also ended with the same question about “Why Quant?” and I was told at the end to expect a decision within an hour. Around 40 minutes later I was called by the Placecomm member who was coordinating interviews at APT and informed of my offer.\n\nHow to prepare for them?\n\nI think preparation for this role at APT should revolve around Competitive Programming. As I’ve mentioned, CP was crucial for both the coding round as well as two out of three interviews I had. In general, my experience was that quant roles or even SDE roles at quant firms had higher levels of questions in their online coding rounds so practicing questions around the 1600–1800 level would be my recommendation.\n\nThe interview puzzles were largely standard ones and preparing from Brainstellar and Heard on the Street should be sufficient. In my opinion, one quick round of these resources can be done before test season and major prep can be done in parallel with the tests or as part of targeted interview prep for this role (more on this approach in the specific advise section). TED-Ed’s riddles videos are also a great resource for these questions.\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nDifficulties arose from my not being clear on whether to target Quant or SDE profiles early on. I was preparing for both and only at the very end did I decide to put the Quant firms higher on my priority list. Owing to this, I spent less time on puzzles than I probably should have, but it worked out in the end. I was also limited in the number of Quant opportunities available for my branch, which reduced the margin of error I was allowed in the coding tests.\n\nAside from this, I ramped up my preparation late as I was (for some reason) expecting the CDC timeline to be a month or so later than it was. Due to this, I was still polishing my CP skills during the tests instead of targeted interview prep which that time should ideally be reserved for.\n\nAccording to you, who should ideally apply for this job?\n\nThe selection procedure is tilted towards CP so people with experience and who find coding fun have an edge. The puzzles asked in the interview can be conveniently prepared for but I’m not sure how one would prepare for the ad-hoc math questions. To that extent, the procedure is more kind to people who might have a natural knack for logical or game-based puzzles, and so on.\n\nThe actual work is likely to involve a mix of Machine Learning/Data-based systems, designing and implementing algorithms, and possibly some amount of knowledge in Securities/Derivatives markets. People who find these fields interesting and have some prior experience or at least basic knowledge are likely to be more suited.\n\nRegardless, it’s a fairly coveted day 1 role and a lot of people targeting tech roles might find it interesting and enriching to apply for.\n\nAny specific advice you want to give to the junta sitting for internships this year?\n\nThis is advice geared toward tech roles.\n\nFor coding rounds: Go for partial solutions. Especially for the harder tests (quant companies in general), try and determine as soon as you read the problem if you can solve it fully or will have to go for a partial score. You mustn’t waste a lot of time on the full solution of a particular question at the expense of submitting partials to multiple questions which would’ve net you a higher score. If you have a good sense of this early, you can do the full solutions you’re comfortable with along with partials for the rest of the questions in the first pass, and then return to the question you have the fewest passing test cases or the question where you might have the highest chance of improving to a full or even a better-partial solution.\n\nAside from this, one more learning is that doing “decent”/“good” in all tests is not a useful goal. Even if you get shortlisted for everything, you can only seriously interview for only one or two (at most 3) companies/roles on a particular Day. To this end, having 2–3 really good tests and disastrous performance on the rest is far better than having “good” performance on all tests.\n\nFor interviews: By the time you’re towards the end of the test season, you should have some idea of how well you’ve done in each test and have a list of expected shortlists. Some brutal honesty would be good here and I would recommend dividing the roles into “highly likely”, “maybe”, and “highly unlikely” in terms of shortlist probability. Of course, these are based on others’ performance and as well so some idea of the baseline difficulty of the test vs your performance needs to be sought. These lists should be made on a rolling basis as tests happen and once you have a few companies which are “maybe” or better, you should start laser-focused interview prep for the 2–3 companies you aspire for and are hoping for shortlists at. I highly recommend contacting seniors who interned at these firms via Facebook and asking them in as much detail as possible about what was asked in their interviews. For example, I was very confident of a DE Shaw shortlist so I reached out to seniors and prepared OOPS in that last week just for their interview. I did not end up interviewing with them finally, but if I had walked in with only CP prep I likely would’ve been well out of my depth.\n\nI also think towards the end, if you have a few of your highest-priority companies in the “highly likely” list, it might be useful to stop giving the online tests and dedicate this time to interview prep. This is something I did at the very end and probably should have done a little sooner.\n\nWhat are some of the major points you think would be valid to mention in your CV while targeting this profile? (any specific suggestions you would like to make?)\n\nNot sure how relevant the CV is for this profile. It wasn’t brought up even once across all 3 interviews and I wasn’t asked to talk about any prior experience in my introduction. I think general tech CV advice should hold — prioritize technical experience/work at the expense of co-curricular on the CV, more relevant technologies to the role are better so try and customize CVs between quant-data and SDE roles, etc. Additionally, try to include ratings on Codeforces/other CP websites, it may not be that impactful for this role but is for other tech ones."
    },
    {
        "job_role": "Quant",
        "company_name": "Deutsche Bank Center(DBC)",
        "info": "Anyone who wants to give investment banking a try, can go for it.",
        "content": "FORESIGHT(2019): Summer Internship Deutsche Bank Center(DBC) | Chakit Chawda\n\n--\n\nListen\n\nBrief Introduction:\n\nI have interned at Deutsche Bank Center(DBC), Goregaon East, Mumbai after my fourth year. I am a student of Industrial and Systems Engineering department enrolled in its dual degree course with M.Tech. in Financial Engineering. I am a boarder of Patel Hall of Residence.My previous internships include research internship at Indian School of Business, Hyderabad in the field of Quantitative Finance and served as a research affiliate at the University of Huddersfield, England in Supply Chain Management with Financial risk measures.\n\nSelection Procedure:\n\nIt has 2 stages. First, the online test which includes questions from data interpretation and verbal reasoning. Shortlist depends upon the performance in the online test as well as CV. The second stage has Personal Interviews. I had appeared for 5 different rounds with different panels. First 2 were for checking Quantitative Aptitude followed by 1 round on CV. One with HR and finally with the Director.\n\nHow to prepare for them:\n\nYou can prepare for Quantitative Attitude from the book named “Heard on the Street”. In Finance, basic topics like Capital Market, Money Market, basic financial instruments and their derivatives, and Risk measures can be covered. Probability and Statistics in Engineering by Williams W. Hines is a good source for the foundation of Probability and Statistics.\n\nYour Project Details:\n\nI have worked with Quantitative Investment Solutions(QIS) team at DBC. My project was based on the interest rates market and the forex market. I have studied the research and backtested 2 different strategies to form portfolios for investors like pension funds and asset managers. I was supporting theLondon desk of the QIS business. I was constantly in touch with my onshore team for my project discussion. Along with my project, I was involved in helping the team members in their day to day activities like calculating risk/return attribution and generating market data. I have also worked onautomating the return attribution to reduce the time(cost) and increase efficiency. Majorly my work was on python and a little bit on MS excel.\n\nCompany Culture:\n\nDB offers a very structured internship in the field of Investment Banking. We were allotted a Project Guide, a Mentor, and a buddy for project work guidance. They were easily available on the floor which helped me a lot to solve my problems at the earliest. There were various information sessions by the top management for the interns in which they used to discuss their involvement, their desk works, and the future opportunities. They could also explain to us some basics on financial markets. On top of all these, DBC has almost all businesses that Deutsche Bank offers. The best thing about interning at DBC is the opportunity to interact with people from all of these businesses. It is very important to get to know about all of it before you select your profile/job.\n\nAccording to you who should ideally apply for the intern:\n\nAnyone who wants to give Investment Banking a try. This internship does not require any prior knowledge in Finance. But having it definitely helps a lot during the internship.\n\nAnd what advice will you give to them:\n\nStart preparing hard on the topics mentioned. Be aware of the recent news in this field. If you claim it, they gonna ask you in the interview."
    }
]