[
    {
        "job_role": "Research",
        "company_name": "Adobe",
        "info": "Having good technical projects is always desirable, as it boosts your chances. A good project related to NLP or Computer Vision would enhance your resume considerably for this profile, as most of the projects in Adobe Research are related to these fields.",
        "content": "--\n\nListen\n\n1) Brief introduction and description of offered role\n\nI am N Anushka, a 3rd-year undergraduate student from the Department of Electronics and Electrical Communication Engineering at IIT Kharagpur. In the 2023 CDC Internship Drive I got an Internship offer from Adobe Research.\n\n2) How did you get into Adobe? What was the selection procedure?\n\nThe selection process for Adobe Research consisted of one online test and one round of interview. Online Test: The online test was held on HackerRank and was around one and a half hours long. It had two parts: The first contained a total of 18 MCQs, which had questions from data structures like stack, queue, linked list, tree, etc. The second section contained two coding questions (which were of an easy to medium difficulty). You needed to solve both coding questions correctly and perform well in MCQs in order to get through. Interview Round: There was only one round of interview, which was around 20 minutes long in my case. I was asked a few questions on linear algebra which I had mentioned in my resume as my coursework. They also asked about my knowledge in graphs. Majority of the interview was spent on discussing a project I put in my resume (It was a project on machine learning). You can expect questions from Data Structures and Algorithms, Linear Algebra, Probability and Statistics. The interview was mainly on CV grilling. Being thorough with your CV is a must. Having some projects on ML will be very beneficial for the interview round.\n\n3 )How to prepare for them?\n\nFor Coding Test Round: Learning data structures and algorithms and practising DSA questions from LeetCode. In the last month to get the idea about interview questions you can practise questions on InterviewBit. For Interview Round: During the interview, try to be calm and composed and answer the questions honestly and confidently. Also, prepare a nice introduction beforehand to start well. You should be very well prepared about all the points, especially the projects you put in your resume. It’s better to avoid putting the things you are less confident about, as there may be cross-questions about anything they find interesting. Having good technical projects is always desirable, as it boosts your chances. A good project related to NLP or Computer Vision would enhance your resume considerably for this profile, as most of the projects in Adobe Research are related to these fields.\n\n4) When did you start preparing for this role and according to you what is the ideal time for aspirants to begin their preparation?\n\nI started preparation during the summer break. Starting your preparation in May is not too late. You just have to be diligent and keep a timeline so that you can finish it before the tests start as then you will not be having much time.\n\n5)What difficulties did you face while preparing for this Company/Profile?\n\nHow did you overcome them? As I was preparing for both Software and Core profile, there were too many things to prepare. To overcome this, I asked for advice from some of my friends and seniors which really helped me strategically plan my preparation, and working on it consistently throughout the summers helped me prepare well for the Internship process. I would advise, whenever you are having some difficulty regarding the preparation try to talk to your seniors or your batchmates who are also aiming for the same profile this will really help you overcome that problem.\n\n7) According to you, who should ideally apply for this job?\n\nAnyone who has a keen interest in the field of NLP or Computer Vision, and wants to innovate something in this field should apply for this internship.\n\n8) Kindly attach your CV/Resume. What are some of the major points you think would be valid to mention in CV while targeting this profile?\n\nFor this profile the most important part of the CV is the Projects and Internships section. Try to present your projects very well, as having 1–2 nice projects related to the profile will definitely increase your chances of selection. As you would be asked many questions related to your projects, prepare well for whatever you write in your CV.\n\n9) Lastly, what advice would you like to give to the students aiming to grab CDC internships this year?\n\nDon’t be stressed at a time like this. Give your best and enjoy the outcome. All the best for your journey!!!"
    }
]