[
    {
        "job_role": "Risk Assessment",
        "company_name": "JPMC",
        "info": "I will be interning at JPMC this summer as a Model Risk Governance and Review (MRGR) intern in the Global Risk and Compliance Program",
        "content": "FORESIGHT(2023): Summer Internship at JPMC| Vaishnavi Singh|\n\n--\n\nListen\n\n1) Brief Introduction\n\nHey everyone, I am Vaishnavi Singh, a fourth-year undergraduate pursuing a BTech in Metallurgy with an interdisciplinary MTech in Financial Engineering along with a micro-specialization in Artificial Intelligence. I will be interning at JPMC this summer as a Model Risk Governance and Review (MRGR) intern in the Global Risk and Compliance Program. Talking about my previous intern experiences, I interned at Godrej Housing Finance as a live Project intern in the Risk Analytics Team and as a Finance intern at Tata Motors. In addition, I also worked as a remote research intern at the University of Sussex. On campus, I have been a part of ShARE IIT Kharagpur and served as the Vice President in 2021–22.\n\n2) How did you get into JPMC? What was the selection procedure?\n\nI got the chance to interview through the JPMC Quant Mentorship Program. This is organized for pre-final year girl students across major IITs, and BITs campuses and about 2% of total applicants are selected.\n\nThe selection procedure includes a test to assess math and basic programming skills.\n\nA case study on some finance aspects which again requires math and basic programming skills in your choice of language.\n\nOnce selected for the mentorship program, it is a 6 months to a year mentorship program with teaching sessions, hackathons, fun meets and direct interaction with JPMC working professionals.\n\nAt the end of the mentorship program, all the mentees get a chance to directly interview for an internship next summer in either Quant or MRGR profiles.\n\n3) How to prepare for them?\n\nInitial screening rounds require a basic brushing up of Integration, Differentiation, Prob Stats and Permutation and Combinations for Maths and PDS level programming skills.\n\nThroughout the mentorship program, there will be assignments after teaching sessions based on what was taught. There will be additional sources on their website to learn the topics better. Topics covered would include basics of Finance, Coding and Maths. These require no prior preparation except being consistent and attentive.\n\nFor the Final Rounds ( may be multiple rounds) of interviews for the MRGR Profile:\n\nProbability and Statistics : Sources: Fifty Challenging Problems in Probability, Probability and Statistics Course(MA20104), Heard on The Street: Quantitative Questions from Wall Street Interviews\n\nMath Puzzles: Medium and Hard level questions on Brainstellar + Heard on The Street\n\nMachine Learning Basics:\n\nBasics: Machine Learning Foundation and Application, Machine learning by Andrew NG, study the popular ML Models like Logistic Regression, Naive-Bayes, SVM etc. + Basic knowledge of Mathematics used in ML\n\nTime Constraint Prep: Practice popular interview questions in ML from GeeksForGeeks, InterviewBit and other online resources.\n\nData Science:\n\nML Basics and Practice popular Interview questions from online resources.\n\nBasics of Python programming, popular libraries like numpy, matplot etc.\n\nCV Prep:\n\nPrepare short descriptions of all your projects and internships\n\nMust know the ML or Data Analysis technique used in projects, if any\n\nBrush up on related coursework that you mention in the CV like Linear Algebra, Econometrics, Probability and Stochastic Processes, Finance, MLFA etc.\n\nLastly, there is an HR round to know your interests and personality assessment.\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nDifficulties faced:\n\n1. Time Constraints before CDC\n\n2. Vast number of areas to be covered\n\n3. Nervousness before interviews\n\nTips to overcome these difficulties:\n\n1. Start interview prep at least a month before\n\n2. Keep practising Prob, Stats and Puzzles\n\n3. Make Short notes on important concepts in ML, Data Science that are usually asked in interviews\n\n4. Try giving Mock Interviews and take help from peers, seniors and JPMC mentors.\n\nLastly, maintain your calm, give it your best shot, ask for help from the interviewer if you are stuck somewhere, talk out loud while solving.\n\n5) According to you, who should ideally apply for this job?\n\nThis profile of Model Risk Governance and Review is best suited for anyone interested in Machine Learning and its application in Finance, has done some projects or internships in similar areas and has a strong hold over Prob Stats, Math and ML.\n\n6) Any specific advice you want to give to the junta sitting for internships this year?\n\nMy advice would be to\n\n2. Take help from peers and seniors\n\n3. Not to get intimidated by seeing other people’s progress as everyone has their own pace\n\n4. Spend time productively and it is very important to take short breaks in between\n\n5. Work and spend time on your CV, and get it reviewed multiple times\n\nLastly, just prepare wisely and be confident of your worth.\n\n7) What are some of the major points you think would be valid to mention in your CV while targeting this profile? (any specific suggestions you would like to make?)\n\nMajor Points to Mention in your CV:\n\n1. Any ML-related research project, internship, self project with the Model used, Accuracy, Hypothesis Testing, Data analysis methods used\n\n2. Python Programming Skills\n\n3. Relevant Coursework Information in Maths, ML, Finance\n\n4. Any Hackathons, Competitions you have taken part in ( not necessarily won something)\n\n5. Background in Finance or Finance interns, certifications etc. would be an added advantage\n\nI wish all the best to the KGP junta sitting for CDC this time. Feel free to reach out in case of any queries."
    }
]