[
    {
        "job_role": "Securities",
        "company_name": "Goldman Sachs",
        "info": "All the technology enthusiasts/coding geeks/finance loving peeps can put their trump cards to get in here",
        "content": "FORESIGHT(2018): Summer Internship Goldman Sachs| Anubhav Jain\n\n--\n\nListen\n\nBrief Introduction:\n\nMy name is Anubhav Jain and I am pursuing B.Tech. in Computer Science and Engineering at IIT Kharagpur. I interned during summers 2018 at Goldman Sachs, which is a leading global investment banking firm. I worked in the Securities Division, and my internship was 10 weeks long.\n\nSelection Procedure:\n\nGoldman Sachs is open for students of all the departments.\n\nFirstly, there is a test which a student needs to clear to qualify for the interview round. The test consists of the following three sections :\n\n1. Computer Science (Coding) — 5 MCQs on core computer science concepts, 2 coding questions.\n\n2. Quantitative Analysis (Quant) — 10 questions, MCQs/Numerical answer type questions.\n\n3. Machine Learning — 10 MCQs.\n\nOne important thing to note is that to qualify for the interview round, one doesn’t need to excel in all the three sections. Goldman Sachs comes to hire for different teams, and they expect you to expertise in at least one of the sections, but not necessarily all of them. Different teams that GS hired people for this time are Securities, Technology, Risk, Investment Management Division (though there exist many more teams). Nevertheless, the work you do here in any of the teams is technological and engineering related. These different teams shortlist candidates for interviews based on different sections of the test. So even if you excel in only one section, you’ll definitely be shortlisted by at least one team, and if you perform just moderate in all sections, you might not get shortlisted for an interview at all.\n\nNext comes the interview round. The type of questions that are asked depends on the team taking your interview. And the number of interviews you might end up giving depends on the number of teams who shortlist you and also on how you perform in subsequent interviews. I gave 5 interviews, all lasting about half an hour. Some (talking about those who got selected) were finished in 2–3 interviews only, while some ended up giving 7–8 interviews as well.\n\nHow to prepare for them:\n\nIf I talk about the written test first, then for different sections, a different kind of preparation is required. All sections consisted of all levels of questions, ranging from easy to difficult.\n\nCoding section: GeeksforGeeks for practising different algorithms and data structures, InterviewBit for coding practice. Doing these two things are more than enough.\n\nQuant section: For those who have taken ProbStats course can revise the notes and practice questions on the subject, and there is also a book “Heard on the Street” that is useful in preparing for the quant section.\n\nML section: I felt that doing only Andrew Ng’s course was not sufficient for this section. A few theoretical questions can be expected from the course, but some advanced topics like Bagging, SVM Kernels etc. were also there.\n\nThere is nothing different to be prepared for interviews. Interview questions will be similar, maybe just with a bit more level of difficulty.\n\nYour Project Details:\n\nMostly everyone here is given a unique project. My project revolved around adding a feature to an existing trading platform (coded in Java) and writing a utility to create reports (in Python).\n\nCompany Culture:\n\nThe environment here is quite chill and friendly. There are no time restrictions (come and go whenever comfortable), no particular dress code (casuals are allowed). People are very easily approachable here, one can freely talk to any person at any position without any hesitation. All in all, you grow here in a team, working together with different people at different locations.\n\nAccording to you who should ideally apply for the intern:\n\nAll the technology enthusiasts/ coding geeks/ finance loving people can freely put their trump cards to get in here.\n\nAnd what advice will you give to them:\n\nI’m going to mention this thing just to make things clear. GS is majorly an investment banking firm. Someone might think that work here majorly is related to finance and in future, if you land at GS, your field completely becomes finance-oriented. However, this is not completely true. Work for the engineering divisions, that GS hire people for from IITs, is mostly technological. But to understand the background of the work you are doing, you need to understand the finance behind the technological requirements, thus with time, you tend to develop more knowledge in finance. So yeah, you might get deeper into finance, but you won’t get your hands off the technological work you do.\n\nAlso, it’s important to keep in mind that not everyone gets the same experience at any place. What you take out of this journey definitely depends on the firm, the team you are working in and also on you, how well you adapt yourself to a corporate environment, and how well you are able to interact and mix up with everyone around you.\n\nI’d like to end this by saying “every day is a learning experience!”, take most out of whatever opportunity you get.\n\nGood luck!\n\nWarm Regards,\n\nAnubhav Jain"
    }
]