[
    {
        "job_role": "Systems",
        "company_name": "Quadeye",
        "info": "Practice CP questions to hone your algorithmic skills since they ask such questions in every technical interview. Moreover, it is important to have in-depth knowledge about CS concepts. OOPS, Networks and OS are very important for Dual Degree students.",
        "content": "FORESIGHT(2023): Summer Internship at Quadeye| Rajas Bhatt|\n\n--\n\nListen\n\nBrief Introduction\n\nHello, I am Rajas, a fourth year undergraduate student in the Department of Computer Science and Engineering.\n\nHow did you get into Quadeye? What was the selection procedure?\n\nA high CGPA, a well-prepared CV and a CS major played an important role in getting shortlisted for the interviews as Quadeye did not conduct any coding rounds. Selection involved 4–5 rounds of technical interviews which started with simple CP problems and basic CS concepts (OOPS) and moved onto complex CP problems and intermediate CS concepts involving Networks, Computer Architecture and Operating Systems (OS).\n\nHow to prepare for the role?\n\nPractice CP questions to hone your algorithmic skills since they ask such questions in every technical interview. Moreover, it is important to have in-depth knowledge about CS concepts. OOPS, Networks and OS are very important for Dual Degree students.\n\nB.Tech students need to focus on OOPS. Networks and OS would be an added plus point (not necessary, if you lack time, don’t study them).\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nCP does not come easily to a lot of people, including me. Practice is the only way to get across this hurdle. There is no other way. CS concepts can get tricky at times. I cleared them using standard CS books (CLRS for algorithms, Hennessy-Patterson for Computer Organization) whenever necessary. In most of the cases, course slides were sufficient\n\nAccording to you, who should ideally apply for this job?\n\nCS people with a high CGPA and interest in System Design\n\nSpecific Advice for people sitting for CDC Internships:\n\nDo CP first and everything else later. Do NOT forget to do InterviewBit (especially the harder problems which carry more points, DP and Graphs being top priority in that order). For people aiming to get into Software roles, OOPS is a must. Do NOT write things in your CV which you can’t explain to the interviewers.\n\nWhat are some of the major points you think would be valid to mention in your CV while targeting this profile? (any specific suggestions you would like to make?)\n\nSpecific Points to mention in CV:"
    },
    {
        "job_role": "Systems",
        "company_name": "Quadeye",
        "info": "I used textbooks like C++ Primer and Effective Modern C++ for this. I also used to spend time reading the source code of different open-source projects to get a feel for real-world code since this is not something that you usually get from coursework.",
        "content": "FORESIGHT(2023): Summer Internship at Quadeye| Vishal Subramanyam|\n\n--\n\nListen\n\nBrief Introduction\n\nHey, I’m Vishal Subramanyam, from the Department of Computer Science and Engineering, enrolled in its B.Tech. course. I interned at Quadeye in the summer of 2023 as a systems engineer. I’m writing this post hoping my preparation strategy helps those sitting for CDC better understand my journey.\n\nHow did you get into Quadeye? What was the selection procedure?\n\nQuadeye had a direct CV-based shortlisting. Unlike most companies that held CP-based programming tests as a filter, Quadeye didn’t conduct a coding round, and I was called for an interview directly.\n\nThe interview started with basic questions on common data structures like linked lists, heaps, etc. Later we progressed towards implementing basic algorithms such as binary search, where I had to write C++ code and discuss various edge cases. I then had to answer a few questions on object-oriented programming in C++ about how things like virtual functions are implemented in C++. I was also asked about modern revisions to the C++ standard and new features in recent versions. After that, there was an HR round that was simply a conversation about the company and the things I knew about it.\n\nHow to prepare for them?\n\nMy CS courses, such as Algorithms 1 and Software Engineering, were greatly helpful in setting the base. Apart from this, I studied C++ separately since that wasn’t a skill one usually learns from competitive programming. I used textbooks like C++ Primer and Effective Modern C++ for this. I also used to spend time reading the source code of different open-source projects to get a feel for real-world code since this is not something that you usually get from coursework.\n\nApart from this, I did the usual CP preparation that everyone else did, using sites such as Codeforces and InterviewBit. Although this helped me attempt the coding tests for other companies, my competitive programming skills were not tested during the Quadeye interview. So how should an interested candidate prepare for Quadeye, assuming they’re done hedging their bets by doing CP for other companies?\n\nAccording to you, who should ideally apply for this job?\n\nIf you have a deep fascination for the inner workings of computers and are constantly driven by curiosity to explore implementation-level intricacies, such as the internals of your operating system and how networking protocols function, consider applying.\n\nHFTs, in general, are a bit different in how they select interns compared to companies that usually come for software-related profiles. My company, Quadeye, cares a lot about one’s CS fundamentals, and minimal emphasis is placed on competitive programming skills. As far as I’ve seen, a student’s Codeforces or Codechef rating is not even considered. I didn’t do CP intensely; my low Codeforces rating backs that. This is not to say that other companies don’t focus on CP ratings and tests. Anyone reading this post should take coding tests seriously and prepare for them using resources such as Leetcode, InterviewBit, CSES, Grimoire of Code contests, etc., since it is wiser to hedge your bets across multiple companies.\n\nSo what exactly do these companies want? They want students with high CGPAs from departments like CS, MnC, and ECE since they believe this is a good indicator of the intern’s ability to perform well at the job. Having a CGPA above 9 is a must.\n\nThis might be disappointing to interested candidates from other departments who might be interested, but it is what it is. Assuming you’ve passed this primary filter, the company then wants you to be someone who can muck around with low-level implementation details instead of only being able to import libraries and use high-level APIs and function calls since anyone can do that.\n\nAny specific advice you want to give to the junta sitting for internships this year?\n\nI won’t be giving advice that is already common knowledge at this point. Instead, I will use this space to remind the readers that the CDC internship season shouldn’t be a toxic rat race and a measure for determining your worth. I know how pervasive the culture of propping up those who get high-paying offers is and how it can affect the psyche and goals of those who don’t get them. Companies hire and fire based on their needs, and it might not be an accurate measure of someone’s skills. This season is meant to be an interface between the industry and the student population to get a taste of the real world, and it should be viewed as such."
    },
    {
        "job_role": "Systems",
        "company_name": "Quadeye",
        "info": "The interviews cover a vast variety of topics ranging from Computer Networks, Object Oriented Programming, Operating Systems, Computer Architecture and Organization, Compilers, Competitive Programming and last but not the least mathematical puzzles.",
        "content": "FORESIGHT(2023): Summer Internship at Quadeye| Suryam Arnav Kalra |\n\n--\n\nListen\n\n1) Brief Introduction\n\nI am Suryam Arnav Kalra, 4th year Undergraduate student in the department of Computer Science and Engineering enrolled in its dual degree programme. I have a knack for solving mathematical puzzles and love doing competitive programming whenever I get time. Apart from this, I am an avid lover of mountains and love exploring nature’s beauty.\n\n2) How did you get into Quadeye? What was the selection procedure?\n\nThe selection procedure has the following steps:\n\n3) How to prepare for them?\n\n4) What difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nOne of the major difficulties I faced while preparing was actually finding the clever and short method to solve the puzzles they ask. One is you go the long way to solve the problem and other is finding the critical observation which converts the daunting problem into an easy one. To overcome this, I mostly sat with my friend Kunal Singh and he helped me with taking lots of mock interviews where he would ask me a random puzzle and helped me reach the most optimal solution through well thought out hints by him.\n\n5) According to you, who should ideally apply for this job?\n\nAn ideal student for this role is the one who is not afraid of new problems thrown at him and loves to tackle challenges. The candidate should be quick in arriving at solutions mostly intuitively. He/she should have a very deep understanding of the concepts as the questions get more and more tricky and conceptual.\n\n6) Any specific advice you want to give to the junta sitting for internships this year?\n\nPrepare Object Oriented Programming as a first step along with the fundamentals of Operating Systems. These are the main areas where candidates get stuck as they are not able to answer the factual questions asked in these topics.\n\nCompetitive Programming questions of around 1600 to 1800 codeforces rating should be practised daily and each and every contest should be given.\n\nTry and solve as many probability questions along with puzzles to develop an innate mindset of how to target them.\n\n7) What are some of the major points you think would be valid to mention in your CV while targeting this profile? (any specific suggestions you would like to make?)"
    }
]