[
    {
        "job_role": "Consultancy",
        "company_name": "Accenture",
        "info": "Coming to this job, consulting is all about dealing with clients, and working in a team",
        "content": "FORESIGHT(2022): Placement at Accenture | Pratyusha Mondal\n\nBrief Introduction\n\nHello everyone, I am Pratyusha, a final year undergraduate student from the department of Manufacturing Science and Engineering enrolled in its B.Tech course. I am from Kolkata and I will be joining Accenture as an MCD Associate in the Indian Marketing Unit.\n\nHow did you get into Accenture? What was the selection procedure?\n\nWe had to apply through the CDC portal of the ERP section as well as the link provided by the company. The role was open to almost all departments without any additional CGPA criteria.\n\nScreening test:\n\nAll the applicants were allowed to sit for the online screening test, which consisted of mainly three sections: quantitative aptitude, logical reasoning and vocabulary section. Almost after 3 weeks, the shortlist was published and one week later the interview procedure was conducted.\n\nBuddy mapping session:\n\nAround 25 students were shortlisted for the further interview rounds, and each of them was assigned a buddy by the company. The role of a buddy is to clear the individual’s doubt regarding the role or how exactly one should prepare for the interview. A buddy also helps in preparing for the case interviews.\n\nInterview procedure:\n\nGenerally, there are two separate interview rounds, but ours was conducted in one combined round. It mainly comprises of three sections-\n\nHow to prepare for them?\n\nPreparing the CV:\n\nA CV has quite an impact while applying for a job in management consulting. Generally, recruiters seek for a CV that has a perfect balance of work experiences (preferably related to finance), skills (basic ones like SQL, Excel, etc) and PORs. Try to include your academic as well as extra-curricular achievements in your resume. Always get it reviewed by your seniors; there is always a scope for improvement. Don’t go for the last moment rush and take your time in preparing a compact resume. Most importantly, don’t try to include terms that you don’t know, be honest and well-aware about whatever you are writing in your CV.\n\nScreening test:\n\nAptitude tests are generally not hard if one knows how to manage time. We had to solve 48 questions in 55 minutes. In order to get accustomed to this, you have to practice. Different mock test portals are easily available in the internet, find the quality ones and solve those within a specific time.\n\nInterview preparation:\n\nPracticing with your peer group with similar profiles is the best way to prepare for the interviews. I would suggest few books like Victor Cheng, Case in Point, etc. Solve the guesstimates and cases together, also practice some mock interviews, especially for the HR rounds. There are seniors who will always be eager to help you. Your answers should not sound mechanical. Prepare basic questions like, why do you think you are eligible for this role or what values you think you will be able to add to the company. Finally, the interview round is the last hurdle you gotta overcome to achieve your dream job, so just give your best.\n\nHow would you describe the work culture in your company? How is the work-life balance?\n\nI guess I am not in a position to answer this question. From the few meetings I have attended I would say the campus recruitment team has been quite friendly and approachable, and they are always eager to clear any kinds of doubt you have.\n\nWhat difficulties did you face?\n\nCDC procedure is always hectic, also it was an online procedure for us, and so networking and managing our mental health have been a little bit tough.\n\nAccording to you, who should ideally apply for this job?\n\nWell, not only for this job but personally I think one should go for a certain role only if he/she is really passionate about it. A career is a long-term commitment, so go for the profile which suits you the most. Coming to this job, consulting is all about dealing with clients, and working in a team which includes lots of travel and almost 60+ working hours per week. So one should consider these factors, before opting out for this profile.\n\nAny specific advice you want to give to the junta sitting for placements this year.\n\n2–3 months is enough to prepare for the placement session, so make good usage of your summer vacation. Few quick points would be these-"
    }
]