[
    {
        "job_role": "Finance",
        "company_name": "ICICI Bank",
        "info": "EATON is a very good company to start your career with due to its working culture.",
        "content": "FORESIGHT(2022): Placement at ICICI Bank | Chitranshu Ranjan\n\nBrief Introduction\n\nHi, I’m Chitranshu Ranjan. I’m a final year undergraduate from the Department of Mechanical Engineering enrolled in its B.Tech course of Manufacturing Science and Engineering. Recently, I got a placement offer from ICICI Bank for a Management Trainee profile.\n\nHow did you get into ICICI Bank? What was the selection procedure?\n\nI was selected by ICICI Bank through phase-I of campus placements 2021–22. It was open to all the departments.\n\nThe selection procedure consisted of an online shortlisting test and one technical interview round, no HR round.\n\nThe online test has MCQs on Aptitude, ML, Object-Oriented Programming, Operating Systems, Networking, and other computer science topics. It was around an hour-long online proctored test.\n\nThe interview lasted for about 40–45 minutes. After my introduction, I was asked questions from my CV. I was asked to explain one of the data analytics competitions mentioned in my CV. After giving a thorough explanation, I was asked technical questions related to my approach to the problem along with some questions related to the deployed ML algorithms. The interviewer tried to tweak the problem a bit and asked about the difference in my approach compared to the previous one. It was an interactive interview. The interviewer also gave me some insights into the problems they deal with.\n\nHow to prepare for them?\n\nI would suggest having basic knowledge of Machine Learning and Data Analytics. One should have absolute clarity about each and everything mentioned in the CV. Apart from this, one should have a grip over Data Structures Algorithms and OOP. Last but not the least, one should be able to convey their thoughts to the interviewer in a presentable and clear fashion.\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nOne thing which I realized at the time I was looking for an internship was, that even if you are preparing for non-SDE roles still you should have some grip over DSA and other CSE topics. This opens a wide spectrum of opportunities. Even if you are targeting for Data/ML profile, you should not be surprised by the coding and OOP questions in online tests. So, for the placements, apart from brushing the ML concepts and going through my projects and internships, I focused on practicing coding and learning basic OOP concepts. This will not only be a skill addition but coding will help you to think in an organized manner and approach a problem in a much better way.\n\nAccording to you, who should ideally apply for this job?\n\nAnyone interested in machine learning, mathematics, and playing with data should apply for this job.\n\nAny specific advice you want to give to the junta sitting for placements this year?\n\nThe placement process is the testing time of your KGP journey. It is a very draining and mentally demanding process. There are lots of companies visiting for different profiles. One should not go on blindly applying to every company. Rather, be clear about what you expect out of this placement process, and also keeping in mind your level of preparation, apply for the companies accordingly. Be patient and keep on trying. You may feel at a point in time that everything is going against you but that is the time when you have to keep your motivation intact and stick around. Keep interacting with your friends and help each other.\n\nAll the Best!!"
    },
    {
        "job_role": "Finance",
        "company_name": "Morgan Stanley",
        "info": "It is a client-facing job and a collaborative profile so interpersonal skills are also very important.",
        "content": "FORESIGHT(2022): Placement at Morgan Stanley| Tanmay Shah\n\nIntroduction\n\nI am Tanmay Shah, a graduate of the 2022 batch. I am a student of the Department of Humanities and Social Sciences at IIT Kharagpur, enrolled in its Integrated MSc. course in Economics. I am offered a full-time position as an Associate (Sales and Trading) in the Fixed Income Division at Morgan Stanley.\n\nHow did you get into Morgan Stanley? What was the selection procedure?\n\nThe selection process was pretty standard. First, there was an aptitude test consisting of basic aptitude, basic finance, and English. The English section also contained audio and video questions. The test was simple but the recruiters were very selective. So, try to score full marks on the test.\n\nThere were, in total, three rounds of interviews (2 Technical + 1 HR). The first round was largely based on the domain knowledge in the fixed income market, some theoretical questions about bond pricing fundamentals, general market/economic news, a couple of brainteasers, and a simple guestimate.\n\nThe second round was also technical. They grilled me on my CV and asked some elementary questions about the time value of money. A general idea of the economy etc.\n\nThe final and the easiest round was HR. They asked pretty standard HR questions like strengths/weaknesses, Why Morgan Stanley, Why this profile, Why you, etc.\n\nHow to prepare for them?\n\nFor aptitude: CAT material\n\nBrainteasers: Heard on the Street (must), Xinfeng, Zhou\n\nGuestimate/ Cases: IITB Casebook\n\nFinance: CFA Level 1 material\n\nApart from these, a good resume is a must because all the shortlisting is done based on resume and CGPA.\n\nWhat difficulties did you face while preparing for this Company/profile? How did you overcome this problem?\n\nI am not good at coding and I tried analytics but didn’t like it very much. So, finance and consulting were my only options. I didn’t have any good PORs so I was left with finance. Luckily, that’s what I liked. The problem is that there are not many companies that come for such profiles. It was a hard decision for me to stick to finance when there are ample opportunities and software and analytics. Still, I stuck with my decision and started focusing more and more on finance. I believe it is good to double down on your strengths rather than improve on your weakness because you can never be good at everything.\n\nAccording to you, who should ideally apply for this job?\n\nAn ideal candidate for this job is someone who is interested in finance and financial markets, willing to learn and explore different avenues in finance, has an above-average knowledge of finance, and has excellent communication skills. CFA is a “good to have” but not a “need to have”. It is a client-facing job and a collaborative profile so interpersonal skills are also very important.\n\nAny specific advice you want to give to the junta sitting for placements this year.\n\nPrepare for tests before you prepare for the interview.\n\nBe consistent in your efforts before and during the placements.\n\nPrepare a flawless CV and get it reviewed by as many seniors as possible.\n\nKnow your CV inside out and backwards.\n\nDon’t underestimate the HR round. It is the easiest round but also easy to mess up.\n\nDo as many mock interviews as you can with your friends and seniors.\n\nFinally, keep calm, sleep well and be confident."
    },
    {
        "job_role": "Finance",
        "company_name": "DC Advisory",
        "info": "Since the nature of the job is client-facing, they evaluate your communication skills and depth of knowledge.",
        "content": "FORESIGHT(2022): Placement at DC Advisory | Ishan Das\n\nBrief Introduction\n\nHello, I am Ishan Das; I shall join DC Advisory as an Investment Banking Junior Analyst after graduation.\n\nDC Advisory is a leading corporate finance advisor specializing in cross-border transactions. As part of an established global business, we offer access to over 500 professionals throughout Asia, Europe, and the US. DC Advisory provides tailored independent advice on M&A, debt raisings, and restructurings.\n\nHow did you get into DC Advisory? What was the selection procedure?\n\nFirst, a form was circulated in which we had to enter our prior internship and project experiences in Finance. Moreover, we had to fill in details about completed Finance certifications like CFA and FRM. This was followed by an online test with a few HR questions, a guesstimate, a puzzle, and 5–10 questions based on Financial Statements and their analysis. The finance questions were easy if you have religiously studied the CFA curriculum. DC Advisory took interviews on Day 1. I had two interviews (40–50 minutes each) (both rounds were similar). Both rounds were comprehensive — starting with generic questions to gauge the interest and drive of the candidates. Questions like — Why Finance as an engineer? Why Investment Banking? What do Investment Banking firms do? How is DC advisory different from its competitors? Tell us about the major deals of DC advisory in the past year. Then we had some discussion about the Indian deal landscape and startup ecosystem. This was followed by a discussion on the IPO scenario in India — was it a bubble? What is your view on the coming decade for India’s startup ecosystem?\n\nSince the nature of the job is client-facing, they evaluate your communication skills and depth of knowledge. It’s crucial to be a structured and thoughtful communicator. These skills are developed over time, generally with our engagements on campus. Being good at these discussions will come naturally to you if you are well-read and are passionate about Finance.\n\nThen I was asked a few guesstimates. You can follow the Case Interviews Cracked IIT-B case book, Guesstimate-Compendium, by Consulting Club FMS for guesstimates.\n\nI also highly recommend doing case preparation with your batchmates since this will help you structure your communication skills and boost your confidence.\n\nFinally, they tested my knowledge of Finance. Financial Reporting and Analysis, Economics, and understanding recent happenings are essential for Investment Banking roles. If you are comfortable with the CFA level 1 curriculum, that should be enough in most cases. In some roles, you might be grilled on advanced concepts of DCF Models, Financial Statement projections, US GAAP vs. IFRS principles, etc.\n\nFor other Finance roles (e.g., Global Markets Analyst roles) that hire from KGP — FRM Level 1 syllabus is more relevant. You should know about the various Financial asset classes (Stocks, Bonds, and other Fixed Income instruments, Options and BSM Model theory, Futures, Forwards, MBSs, CDSs, Swaps, etc.) and their valuation and risk measures. It would help if you also understood the previous Financial disasters, their triggers, how they unfolded, and the damage they did. This, combined with the knowledge of how Financial markets and institutions are organized, should be sufficient to get you an analyst role.\n\nHow to prepare for them?\n\nI devoted the month of November to revising the Finance concepts that I had already studied while preparing for FRM level 1 and CFA level 1. I was already well aware of the recent happening in the world of Business and Finance, both national and international. Apart from this, I did the vital but often overlooked HR prep. I practiced some Probability and Statistics puzzles to brush up on the basics. This was enough to get me through.\n\nFor probability, statistics and puzzles, I recommend finishing the books — Xinfeng Zhou — A Practical Guide To Quantitative Finance Interviews, Heard on the Street, Quantitative Questions from Wall Street Job Interviews-Timothy Falcon Crack, brainstellar.com and 50 Problems in Probability by Frederick Mosteller.\n\nGuesstimates — I mentioned the sources in the previous question. Don’t forget the case prep! Focus more on M&A and business strategy-related cases.\n\nFinance — CFA level 1 and FRM level 1 syllabus is enough for all Finance roles.\n\nFinancial News — Finshots, BloombergQuint, Bloomberg Finance, Wall Street Journal, the Ken, Mint, etc. Start religiously following these at least five months before the interviews. I would also advise doing CAT RCs to boost your reading speed. You can read books by authors like Ruchir Sharma and form a macro view of the markets.\n\nHow would you describe the work culture in your company? How is the work-life balance?\n\nI haven’t worked at an IB firm yet, so this is the first time I will also experience it. I have gathered that Investment Banking roles (similar to most client-facing roles like consulting) are demanding and competitive. At the same time, they offer you a fast-track career with growth and learning experiences that are hard to match in any other industry. Like any other decision, this is a tradeoff between growth and WL balance, and you should decide for yourself based on your personality and lifestyle choices. I assure you that if you enjoy the job, even 14 hours of grueling work can be enjoyable.\n\nAccording to you, who should ideally apply for this job?\n\nThis is a high-pressure job that demands a particular skill set. You should ideally apply for this job if you have a knack for business and finance and a drive to make a dent in this ever-changing hyper-competitive business world.\n\nAny specific advice you want to give to the junta sitting for placements this year?\n\nThe industry you want to work in fresh out of college will decide a significant part of your career trajectory. Many people get lost in the rat race to score the best-paying job or enter the field everyone else is chasing. Many misguided students make this major life decision with short-term goals in their minds or, even worse — by following the herd. Don’t do that! Think about the long run — decide which job suits your personality type and temperament, which job gives you satisfaction, and which jobs will help you get where you want to be ten years down the line. All the best! May you get what you want."
    },
    {
        "job_role": "Finance",
        "company_name": "AMEX",
        "info": "Anyone who is into Management and Strategy should apply.",
        "content": "FORESIGHT(2022): Placement at AMEX| Rachana Verma\n\nIntroduction\n\nHey, I am Rachana Verma, a fifth-year undergraduate student from the Department of Architecture and Regional Planning (B.Arch.).\n\nI will be joining American Express as a Management Trainee in the Credit Fraud Risk department from June ‘22.\n\nSelection Procedure\n\nThis role was open for students from all departments, with criteria of CGPA: 7 and above, and no active backlogs.\n\nThe screening test consisted of three sections: Quant (JEE level), Machine Learning (10 MCQs — easy), and Case Solving (1 case with 2 follow-up MCQs). The quant section was compulsory, while one could choose to attempt either one or both of the rest two sections. Around 65 students were shortlisted for interviews for the Management Trainee profile through this test.\n\nInterview Round 1 (eliminating):\n\nIt started with a CV walkthrough and follow-up questions regarding previous internships and projects, followed by a root cause analysis and strategy case.\n\nInterview Round 2:\n\nThis round consisted of multiple short cases and questions based upon the credit card system and its workings, with an emphasis on aspects like customer risk profiling, the business model of credit card networking companies, and credit fraud detection. These were followed by common HR Questions about you and your motivation to join the company.\n\nHow to prepare for them?\n\nScreening Test:\n\nInterviews:\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nThe initial screening test seemed a bit lengthy considering the time limit and difficulty level, I felt that it could have been attempted better with more practice for the quant section.\n\nAnother hurdle I faced was that I wasn’t very much aware of the workings of credit card networking companies until 3 days before the interview, so had to rush through the reading and understanding of concepts. This can be handled better if you have prior knowledge that some parts of the interviews would be focused on such topics.\n\nLastly, I was very nervous during the interview as it was my first interview ever in the CDC process (Archi students don’t sit for CDC internships), so all I would like to say is that try not to be too nervous and just answer calmly. If you’ve been preparing for the placements all these days, it’s gonna be fine :)\n\nAccording to you, who should ideally apply for this job?\n\nAnyone who is into Management and Strategy should apply. They don’t expect you to have a very close background to the role/department they are hiring you for, so if you’re open to learning and exploring new domains while upskilling, I believe it would be a good choice. Rest can be said only once I join :P\n\nAny specific advice you want to give to the junta sitting for placements this year.\n\nThe time when you prepare for CDC Placements can be scary and cruel on some days, but know that you’ll sail through it, and you’ll sail through it well :) All the months of preparation, the fear of not being good enough, the rejections, all of it will end in a beautiful sweep with you and your friends getting placed with amazing offers.\n\nGet your CV reviewed by seniors, practice for tests and interviews along with your friends preparing for similar profiles — it helps you keep up with the daily prep schedule, and appear for mock interviews set up with friends and/or seniors. Prepare well, have a healthy routine, and don’t get too cut off from people at this time, your friends will need you, and you’ll need them.\n\nMay the odds be ever in your favour.\n\nALL THE BEST!! :’)"
    }
]