[
    {
        "job_role": "FMCG",
        "company_name": "P&G",
        "info": "If you think you’re good with the fundamentals of your branch and you know to manage things efficiently while being in charge.",
        "content": "FORESIGHT(2022): Placement at P&G | Keshav Bagri\n\nBrief introduction\n\nI’m Keshav Bagri, a final year undergraduate student of the Department of Mechanical Engineering, IIT Kharagpur. I’m from Kolkata. I received a job offer from P&G via CDC placements this year for the role of Product Supply Manager.\n\nHow did you get into P&G? What was the selection procedure?\n\nAfter submitting the CV via ERP, I received the details for 2 tests: a psychometric test and if you clear this round, you’ll receive another link from their portal which contains behavioral and situation-based questions. Finally, they released a shortlist of around 25 students for the group interview (which consists of 2 interviewers and 3 candidates in each panel) following which the HR round was conducted with the further shortlisted candidates.\n\nHow to prepare for them?\n\nAs such it's difficult to find resources for psychometric tests, but there are a few websites that can give you some insights. Mostly, it's something you have to do during the test itself. And behavioral + situation-based questions can be answered by using your presence of mind, your understanding of the concerned domain and practical knowledge. You can try to find something online based on the job description on ERP. In the group interview, the questions they ask are supposed to be answered in such a way that you have to cite a situation from your experience and explain what you did in the essence of the question. Try to be as concise as possible and answer each question within 2–3 minutes on average. Beating around the bush won’t help you much. And if they have further questions or they are unclear about something, they’ll attempt to clarify the same. The other type of questions that they ask usually is wherein you’ve to assume yourself in a given position and try to find possible solutions to the problem with the given set of constraints. In this, you can make valid assumptions but be sure to check with them.\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nAs such, I didn’t encounter any issues. I had experience with team/project management since I was the team manager of TeamKART. So, I was familiar with the relevant things.\n\nAccording to you, who should ideally apply for this job?\n\nFMCGs usually look for people who have techno-managerial experience in the past because the job requires you to understand the technicalities, come up with a solution and then execute the same using the resources available to you. So, if you think you’re good with the fundamentals of your branch and you know to manage things efficiently while being in charge, you should apply for such roles.\n\nAny specific advice you want to give to the junta sitting for placements this year?\n\nThe overall process starting from tests, shortlisting and interviews is very unpredictable. You never know why something happened the way it did. But keep fighting, no matter what. Make a group of friends who are targeting profiles similar to you and collaborate on the preparation. Ask your batchmates/seniors to conduct mock interviews towards the end of November, acknowledge their feedback, and act on them. Be confident about every little detail that you have mentioned in your resume. If you think your communication skills aren’t up to the mark, then work towards this. There are a ton of videos online to help you out. And lastly, take as much help as possible from your peers and be in touch with others to prevent yourself from missing any deadline. Managing academics is also tricky but you have to do it anyhow. You’re in one of the best institutions in the country and you’ve worked hard in the last 3/4 years. Now, you just have to assimilate your experience and present it in an attractive fashion, that’s it! Feel free to reach out to me or anyone else for anything that you need. All the best!!! Machake!\n\nWhat are some of the major points you think would be valid to mention while targeting this profile?\n\nThey look for technically sound individuals who are capable of efficient decision-making as a manager. So, try to add relevant things to your CV that can help them relate to what they are looking for. In my opinion, hardcore research experience which is not relevant to the industry is something you can think of not mentioning. However, if you think whatever you’ve done has industrial applications, then go ahead."
    }
]