[
    {
        "job_role": "Product",
        "company_name": "Groww",
        "info": "Students interested or inclined to work in the field of strategy or planning must try this profile.",
        "content": "FORESIGHT(2022): Placement at Groww | Abhijeet Mahato\n\nBrief Introduction\n\nMy name is Abhijeet Mahato; I am pursuing my dual degree in Agricultural and Food Engineering at IIT Kharagpur. Along with my academics, I interned at Resurgent Agric as a Product Management Intern. I worked closely with the founder to develop a product to debut in the e-commerce space. During my tenure at Resurgent Agric, I also got the opportunity to co-author a book for coffee stakeholders. Before that, I interned at VegaMX Inc., a US-based firm, where I worked on optimizing a Corn Yield Prediction Model using Machine Learning algorithms over historical and satellite imagery data.\n\nIn the last four years, I have held multiple PORs. I was the Event Head and Governor at Spectra, the fine arts and design group of IIT Kharagpur. In my hall of residence, I held the post of coordinator of fine arts and lawn tennis, where I was able to make the team secure multiple podium finishes.\n\nApart from my academics, I hold a degree in fine arts equivalent to a bachelor’s in fine arts. Currently, I am trying my hands-on micro-blogging on LinkedIn, where I have achieved 5000+ average viewership on 20+ product and agricultural-based posts.\n\nHow did you get into Groww? What was the selection procedure?\n\nWhen Groww came, they had their pre-placement talk. In that, they gave us the problem statement. We have to prepare a case study on that. The problem statement was, “as we are graduating, we are on the verge of attaining financial independence, so we have to make a digital product that would help solve the pain points of the new generation who are just graduating.” They gave 1–1.5 weeks for the submission. After the case study was submitted, they released their shortlist based on CV and case round. And then, we were allotted our buddies (current APMs working at Groww) with whom we could interact, solve issues, clarify all our queries and prepare for interviews. The buddies were allotted 3 to 4 days before the interview; after that, we interacted with the co-founder, where all the shortlisted students, like APM, business analysts, etc., had an interaction with the founder. The interview happened on Day 2, so there were four rounds. The 1st round was a simple case round in which I was asked a general question: \"Introduce yourself; how many profiles am I applying for, and why product management?” Then the interviewer asked, “How many shortlists do you have?” Then we had a root-cause analysis case.Similarly, the 2nd round involved some basic questions about myself, and they also gave me a product development case. The 3rd round was a more professional root-cause-analysis round. And the 4th and final round was an interaction with one of the co-founders of Groww.\n\nThe 1st round was around 20 mins. The case given to me was, “You are an APM at uber, and I’m hearing from my friend that the customer experience from uber is reducing and it’s not as par with its competitor,” and I have to do a root cause analysis for this.\n\nIn the 2nd round, the interviewer gave me a product development case “Suppose you are working at Groww, you are given the assignment of creating a subscription model for the users of Groww,” so I had to do a proper end-to-end discussion and make a framework that how will I make an action-plan, what all data points and parameters I will consider for creating the subscription model and why? What will be my basis for the pricing of this subscription model? What will be my main objective behind the introduction of this subscription model? How will I launch the subscription model in the market? What will be my crucial matrix to see this subscription model's success? What will be my roll-out plan? This round went a bit longer, around 40- 50 minutes, since it was a proper discussion round, and we had a good conversation like he was enacting a good company scenario.\n\nThe 3rd round was also a root cause analysis round. It was a bit detailed compared to the 1st round. It went around 30 minutes, and here also brought the problem statement from uber itself. The problem statement was, “The number of drivers canceling the orders from Uber’s end has increased.” I had to do a root cause analysis on this. I felt that the interviewer had made up his mind that he wanted to test how much I could bear him in the interview as he grilled me a lot in exploring the root cause of the problem. It became a little nerve-wracking in the end, but I kept my patience and explored different possibilities with a structured approach. He was trying to check whether I knew the news and what was happening in the external market. After that, he gave me one more problem statement, mainly based on checking my thought process. The problem statement was, “It has been observed that users are downloading the Swiggy app but later switching to the Zomato app.” So, I had to figure out why they were switching. He gave me around 5 minutes and asked me to lay down my procedure and thoughts.\n\nAnd after that, I got a call from HR that we are extending our offer to you, so don’t sit for any other interviews today.\n\nHow to prepare for them?\n\nI began my preparation specific to the APM profile somewhere around 1st week of October. Reflecting on my placement journey, I can break down my practice into 3 phases.\n\nPhase 1: October\n\nPhase 2: Up to Mid-November\n\nPhase 3: Mid to End of November\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nA few difficulties which I felt during my preparation were as follows:\n\nAccording to you, who should ideally apply for this job?\n\nWell, I have just got into this role, so I am not entirely aware of what the recruiters look for in a particular candidate for APM roles. But yes, I would answer this based on my personal experience, which may or may not be the same for all cases.\n\nIn my opinion, there are three skills essential to any candidate applying for this role:\n\nAlso, it is good to have experience leading and working in a team, solution-orientated projects, internships involving customer interaction/surveys, strategic planning, analytical solutions, etc.\n\nAn individual interested or inclined to work in the field of strategy or planning and does not exceptionally enjoy coding or data profile must try this profile. Also, individuals interested in and preparing for consulting profiles should apply for this profile.\n\nAny specific advice you want to give to the junta sitting for placements this year?\n\nMany things are essential for placements, and writing them down would be difficult as I have come out of the placement procedure. Some items might appear very silly to me, but they might be necessary for many juniors out there. However, I’ll try to give out some crucial essential advice that I feel is not discussed much in general.\n\nYour CV is the first and foremost document that creates an impression in front of recruiters. What’s the point of having excellent preparation for the interview if your CV doesn’t make curiosity about you, the recruiters? Also, on average, companies receive 100+ CVs, meaning if it doesn’t grab the viewer's attention in the first 5–6 seconds, it slims your chances of creating your impression. I want to highlight, in general, we prepare our CVs based on how I view our work and achievements. But, from my experience, I would say prepare your CV from the recruiter’s POV of what will be relevant or essential for them. Also, I would advise getting your CVs reviewed by your immediate seniors, your 2+ year seniors, your 5+ year seniors, and 10+ year seniors. The reason is, this way, you will get to know what is the general recruiters’ mindset trending these days. Thus, a minimum of 2 to 3 weeks is necessary for all these procedures and to build the best CV for yourself.\n\nOne of the best opportunities provided during interviews is the questions “Tell me about Yourself / Introduce Yourself / Walk me through your CV.” This is the perfect opportunity to determine the flow and direction of your entire interview. Thus, instead of a basic intro, prepare a good and acceptable pitch for yourself so that the listener is more interested in knowing about you as an individual. We all have a hesitant tendency to under-selling ourselves in critical and high-risk situations, which is wildly inaccurate in doing interviews. Thus, always remember you are the “salesman of yourself during placements,” and prepare a strong pitch accordingly.\n\nWhile talking about any internship, project, PoR, or anything, always address it in a way — What did you do? What was the impact? How did you do it? What did you learn? And finally, How the learning made you a better candidate for the applied profile?\n\nNarrate a story in front of the recruiters rather than just giving orthodox boring answers, which they would have heard all day long throughout several interviews.\n\nDuring placement preparations, you are very likely to get piled up with a lot of work, and it is highly likely to miss some important tasks or deadlines. Thus, I advise maintaining a whiteboard where you write every small job to be done now, tomorrow, or in the future. Also, use it as a note sheet for preparation and concept revision, as visual reminders are helpful."
    },
    {
        "job_role": "Product",
        "company_name": "Zomato",
        "info": "One of the best and worst things about this role is that it doesn’t require any specific skills or degrees.",
        "content": "FORESIGHT(2022): Placement at Zomato | Vishvesh Pandya\n\nBrief Introduction\n\nHey, I am Vishvesh Pandya, a fifth-year undergrad in the Department of Mining Engineering. I am from Ahmedabad, Gujarat. I will be joining Zomato as an Associate Product Manager.\n\nHow did you get into Zomato? What was the selection procedure?\n\nOverall, there were two rounds during the placement session 20221–22 for Zomato. For most of the companies that come for the product roles(APM), the first round is generally deck submission, but for Zomato, it was different. First-round was the online test which consisted of two parts:\n\nAround 20 students were shortlisted and there was only one round of Interviews which lasted for 1–1.5 hours. Questions asked during the round were:\n\nAdvice: They prefer the candidates to have a genuine discussion and not act too formally. During my Interview, after initial 5–10 mins, the Interviewer told me that I was being too formal in the way of talking and in dressing sense. He told me to remove the tie and blazer, be in a bit chill mode, and have a very normal conversation instead of the typical setup we follow during the placement Interviews.\n\nHow to prepare for them?\n\nProduct Management is a new role; the first and foremost thing is understanding what product management is and why you want to go into the product management field. Once having clarity on that, you can start preparing for the same and the process seems relatable.\n\nMost of the companies that visit campus during placements for product roles have majorly two rounds:\n\nDeck Submission:\n\nHere, the key to mastering is just practice and practice. Start participating in various online product case competitions and eventually, it will help in learning how to make a good deck. The deck size varies from company to company, but it will be mainly between 4 to 10 pages and keep that in mind while you practice. Some competitions you can refer to are PM school weekly challenge, ProductFolks “Product Teardown”, ProductFiniti case competitions, etc.\n\nPoints to keep in mind for the deck:\n\nProduct Case Round:\n\nFind a group of 3 people (minimum) to practice cases as each will have a different point of view towards the same situation and will help improve the thought process.\n\nBefore you start with product cases, it is advisable to begin with consult cases as it helps understand the basic things that revolve around case solving. Here, majorly there are 4–5 types of product cases that are asked at an APM/Product Analyst level:\n\nHere, start with RCA first, as it will help in learning how to define a problem, break a problem, and structure your overall thoughts. After this, start with product thinking cases by identifying the apps/problems you face in your daily life. At last, if you have sufficient time, then go through the other cases as well, which were mentioned above.\n\nVarious online resources which will help in preparation are as follows:\n\nYoutube Channels:\n\nWebsite:\n\nBooks:\n\nThe most basic questions asked in the Interviews are what product management is and why product management. At the first look, these questions seem simple, but the Interviewer puts a lot of effort into understanding the core reason and motivation. So, do focus on these questions as well.\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nTo speak honestly, at every point during the preparation phase, you will face different challenges and there is no ideal way to deal with them. You have to find your own way and keep moving forward.\n\nOne of the major problems that I faced after seeing a lot of mock Interviews on youtube channels and reading books was that I got very mechanical in solving the cases, and it looked like I was following specific steps and answering to that only. This doesn’t look good from the Interviewer’s perspective as the candidate has just mugged up the steps and followed that only. Even the worst part was that all the friends I was practicing with were also doing the same thing and we didn’t notice that it was a mistake. It got identified when I did the first case with my Flipkart Buddy once I was shortlisted after the deck round. So, to overcome that, you have to create your own structure for every type of case you do and keep improving it from the inputs you get from different people instead of just following the set method given in the books or online resources. One month of preparation during Flipkart Buddy sessions has been the best learning experience for me and it boosted my confidence through ample practice. If you need help with that, you can further contact me and I would be happy to help with that.\n\nThe other problem that I faced during the initial days was finding a partner with whom I could dedicatedly solve the cases. At that time, most of the people are looking for more than 3–4 profiles in the placements and won’t be able to dedicate that much to the practice. During this time, I came across the “Stellar peers” website and it helped me find like-minded people. In this website, go to Practice -> Mock -> Link Calendar. Once you link your calendar, you will be able to see the community along with their desired timing slots for mocks. Even you can also create your slots and connect with people to practice cases.\n\nAccording to you, who should ideally apply for this job?\n\nOne of the best and worst things about this role is that it doesn’t require any specific skills or degrees. As far as I have seen and heard, most companies don’t look for the things like department, CG, POR, etc. as well, so it’s open to all. You show your skills and ideas through the deck and get shortlisted without any other factors affecting it. And same goes for the Interviews as well; show your skills at the moment and get the job.\n\nThe core of product management revolves around solving user problems. And to do this, you will be working with a different set of people from different teams having diverse skillsets. And obviously, you can’t be an expert in each of them. Also, the work is very dynamic, i.e., one day, you will be roaming around to talk to users, and on other days you will be explaining CEO about a new product that will change the face of a company. So, one thing that will help deal with all the diverse challenges is just being curious. If you are curious enough, you will be able to learn things at a time. So, those who are curious, who want an everyday challenge, who like taking ownership of things, and who like to influence people without authority should ideally apply for the role.\n\nAny specific advice you want to give to the junta sitting for placements this year.\n\nThe most important thing to crack the placements is to stick to your own goals. There will be a lot of hassle going around you during that time, like tests, shortlists, people changing their profiles, companies not coming, etc. It’s a part of the process, it will come and go. Do not compare with others, be confident, prepare well and believe in yourself. Also, keep in touch with at least one friend who is not from IIT KGP who will help you calm yourself and with whom you can have normal discussions. Because during that time, the atmosphere gets a little toxic and competitive as most people will be in a placement race.\n\nOne thing for the folks who are preparing for product roles, start practicing the cases as soon as you can because there is no alternative to learning case-solving apart from practice. Many times you will feel after seeing the mock videos that “Aree yaar…Yeh to Kar lunga (I will be able to do it)” but trust me, until and unless you don’t do it on your own, you won’t be able to identify and undo your mistakes.\n\nKeep Calm. Machake. All the Best!"
    },
    {
        "job_role": "Product",
        "company_name": "Zomato",
        "info": "Do go through important CS topics like OOPS, OS, DBMS and try to learn SQL, this definitely would help along the way.",
        "content": "FORESIGHT(2022): Placement at Zomato | Arnab Moitra\n\nBrief Introduction\n\nHello! I am Arnab, a final year dual degree student from the Dept. of Mining Engg. IIT Kharagpur. I sat for campus placements and got an offer from Zomato in their Engineering team as a Product Engineer.\n\nHow did you get into Zomato? What was the selection procedure?\n\nZomato visited our campus and offered 4 profiles vis Core Engineer, Product Engineer, Business Analyst and Associate Product Manager. Core Engineering and Product Engineering profiles were basically Software Development Engineering Profiles. First, we had a Coding assessment, wherein we were asked 4 questions and they had to be solved within an hour. People from all the departments with CGPA > 7.5 were allowed to take the test. Those questions were of medium difficulty level.\n\nThen a form was floated wherein we were asked to fill in some of our experiences in Coding, Ratings in various Competitive Programming sites and our Github profile. Around 20–30 people were shortlisted for the final interview which was to happen on Day 2 of campus placements.\n\nThe interview consisted of only one round. This round was mainly focused on data structures and algorithms; I was asked to explain one of the projects that were listed on my resume, and some discussions on that followed. I was asked some questions on my internship project and CS topics were also asked. This interview lasted nearly 1.5 hours. There was no HR round as such.\n\nHow to prepare for them?\n\nI would recommend solving coding problems from websites like Codeforces, Codechef, Hackerearth, etc. this certainly would give an edge to the problem-solving skills that are generally asked for this profile in various companies. While interviewing, communicate your thoughts effectively and use the hints provided by the interviewer along the way. And do discuss the approach with the interviewer and start coding only when the interviewer seems to understand your approach and agrees about the same.\n\nDo go through important CS topics like OOPS, OS, DBMS and try to learn SQL, this definitely would help along the way.\n\nPrepare the CV real well, make sure you know every bit of the stuff that’s written on the CV, and can confidently answer any questions asked from the CV.\n\nThough there was no HR round for me in Zomato, preparing the HR questions beforehand is important as well.\n\nLastly, put a smile on your face and even if you are under immense pressure (which you would be) make sure you keep your calm.\n\nHow would you describe the work culture in your company? How is the work-life balance?\n\nNot sure about this! Yet to embark upon this journey and discover the culture at Zomato. With the understanding I have, I feel Zomato has a very open culture and a lot has been going on at Zomato lately, so I sort of expect to work on pretty exciting stuff ahead.\n\nHow was your experience working from home? What difficulties did you face?\n\nWhile on campus, we would have gotten a chance to prepare along with friends which would have been a big plus.\n\nImminent network issues while working at home has been a big issue.\n\nAccording to you, who should ideally apply for this job?\n\nAnyone who is inclined towards pursuing a career in tech should consider this. They don’t really bother about the department, so everyone can apply.\n\nAny specific advice you want to give to the junta sitting for placements this year\n\nCampus Placements is going to be a pretty hectic affair. Please refrain from Overthinking. It’s always beneficial to form a group of 3–4 friends targeting similar profiles and prepare together for the placements.\n\nDon’t be afraid of rejections, prepare well for stuff you have ahead of you. Don’t blindly apply to any and every profile, rather target a profile or two and prepare for those meticulously.\n\nDo practice communicating your thoughts effectively, which is very crucial. Have some mock interview sessions, and prepare your CV really really well.\n\nGet in touch with some seniors and make sure you get your CV reviewed by them. Give it your best and leave the rest!\n\nRest assured all this gonna make sense in the end.\n\nWishing you guys all the best!"
    },
    {
        "job_role": "Product",
        "company_name": "Grofers",
        "info": "Ideally, people who like business problem solving, interacting with different people, and thinking out of the box should apply.",
        "content": "FORESIGHT(2022): Placement at Grofers | Prakhar Gaur\n\nBrief Introduction\n\nHello! My name is Prakhar Gaur, and I am a final year undergraduate student from the Department of Civil Engineering enrolled in its dual degree course. I am from Delhi and will be joining as Associate Product Manager (APM) at BlinkIt (formerly Grofers) this year after my graduation. I appreciate this initiative of SWG to help the students with their career ambitions and am looking forward to sharing my experiences here.\n\nHow did you get into Grofers? What was the selection procedure?\n\nI got into Grofers through the CDC placement process in the academic year 2021–2022.\n\nThe selection procedure here consisted broadly of 2 stages-\n\nThe most important tip here is to be confident and take it forward as a discussion that involves both the interview and interviewee who are trying to solve a problem together (with a smile on their face :p)\n\nHow to prepare for them?\n\nTo put it concisely, preparation for product management requires a blend of creativity, aptitude for problem-solving, good communication skills, some product/tech awareness, and some experience. Let us see them one by one-\n\nCreativity and problem-solving- In the PM interview, generally three types of problems are asked- 1) Root Cause Analysis (For eg. How to solve the problem of Uber witnessing a decline in the number of ride bookings on its app) 2) Product Thinking Cases (For eg. Designing Netflix for kids) and 3) Market Entry case (For eg. How to go about introducing Spotify in India) for a given product. These problems can be practiced in a group by solving some cases from books like Cracking the PM Interview and Preparing for Product Interviews by IIT Madras and/or watching Youtube channels like PM School, Exponent etc. Preparation for consulting interviews helps a lot here, as it was in my case. Make sure to form groups with similarly motivated PM enthusiasts for practicing the cases.\n\nGood communication skills are required for all the interviews but more for frontend roles like a PM. A product manager is expected to liaise with different teams and bring them on the same page to achieve the objectives more efficiently. A clear, concise communication is thus required from the PM’s end. For this, one can try polishing their soft skills by participating in different speaking events/competitions and learning the basics of group discussions and interviews\n\nProduct/tech-related awareness- Staying updated with product-related news, especially for the product of the company you’re interviewing for) is really helpful. For instance, I was asked about what modifications I could suggest to the existing app of Grofers. Further, some basic tech awareness like how WhatsApp work and some key technical terms can prove to be beneficial. You can follow product-related blogs or tech news regularly for it.\n\nFinally, some experience- Having prior PM internships/startup experiences will definitely strengthen your candidature during the interview and give you an idea of the role’s demands. This will also help you make an informed decision on whether you really want to go for it or not. In my case, my startup experience (I had previously worked on a startup named as SmallPaw) actually helped me a lot since I had not done any PM internship before. I had mentioned it on my CV, and many questions were asked on it, all of which I could comfortably answer.\n\nOverall, the preparation for product management interviews generally takes only a couple of months and even less if you have done consulting preparation before (as was in my case). One should look forward to doing related internships if sufficient time is left before the placements.\n\nHow would you describe the work culture in your company? How is the work-life balance?\n\nI am not in the best position to answer this since I am yet to start the work. However, generally speaking, PM-related roles require a good no. of hours of work every day (varies from company to company) with a lot of interaction and communication with different teams. However, that can never be an issue if you actually love this role!\n\nAccording to you, who should ideally apply for this job?\n\nIdeally, people who like business problem solving, interacting with different people, and thinking out of the box should apply.\n\nHaving said this, even if you have a slight interest in major products/apps across the world and like generalist roles more, you can consider going for it.\n\nAny specific advice you want to give to the junta sitting for placements this year\n\nThe best advice would be to stay confident and believe in yourself. You still have a lot of time (trust me, a lot of time!) if you are focused enough for the placements (for the non-tech roles like consulting, PM, etc). If you have more than 4–5 months remaining before the placements, you can go for an internship (if you don’t have one in your field of interest) and start some preparation parallelly. You can go full-fledged only in the last few months. In addition, do not try to target all the fields. Choosing two fields (one as primary and one as backup) and giving your best for them is always better than preparing a bit for all the fields. Try sticking to them only even if you start doubting yourself during the placement process. This is one thing that certainly helped me.\n\nAlso, I know that it is a difficult phase for anyone but remember, you are not the only one who is facing this (even the brightest ones, from your perspective). So take it as a natural process, stay healthy and also chill a bit to keep your mind free from stress.\n\nAll the very best for your placements, Kgp junta!"
    }
]