[
    {
        "job_role": "Quant",
        "company_name": "Morgan Stanley",
        "info": "The Associate role at Morgan Stanley involves a good mix of finance, data, and coding.",
        "content": "FORESIGHT(2022): Placement at Morgan Stanley | Compilation\n\nBrief Introduction\n\nHow did you get into MORGAN STANLEY? What was the selection procedure?\n\nTalking about Morgan Stanley specifically, at first, an online test was conducted for all the students who applied for the role. This online test included general and quantitative aptitude questions, 2 coding questions (easy to moderate level), and an SVAR test which is a spoken English assessment, and after getting shortlisted the interview round was conducted. The interview lasted for four rounds including 3 rounds which lasted for about 45–60 minutes, and a final HR round.\n\nThe first two rounds were more technical in nature than the last two.\n\nThe first round of interviews was a completely finance-based interview where I was asked a lot of questions about my past interns and projects. These questions primarily focused on the understanding of various finance jargon and a thorough understanding of Derivatives and their uses. A few puzzles and prob-stats questions were also asked during the first round\n\nThe second round lasted around an hour. The interview was predominantly focused towards my trading strategies and practices in the Indian equity market which was mentioned by me in my intro itself. The latter half of the interview was on DSA where a few coding questions were asked to check the candidate’s coding acumen. In my case, I was also given a guesstimate in the end as well.\n\nThe third and fourth rounds were primarily HR rounds with each round lasting around 20–25 minutes.\n\nHow to prepare for them?\n\n2. Finance — JC Hull (must read for derivations and proofs), be thorough with all the relevant details in your CV — interns, projects, coursework, etc. Do start reading a business paper daily at least a month before the interviews to get updated with the latest market news and trends.\n\n3. Coding — Interviewbit would suffice. Can practice weak topics from Leetcode as well.\n\n4. Guesstimates — It is always beneficial to practice some cases and guesstimates before sitting for your placements irrespective of your profile. A lot of IIM casebooks have a good set of guesstimates, to begin with. If you are just starting with guesstimates, you can check books like Day One and Case Interviews Cracked.\n\n5. Quant — Must do — Xinfeng Zhou, Heard on the Street, 50 Challenging problems in probability. If time persists, you can check out GFG puzzles and Brainstellar.com as well.\n\n6. For the online test, you don’t need to do something out of the box. For interview purposes, you should prepare/revise basic probability and statistics. Solve a good number of puzzles. Just practice a lot of coding questions, solve some quantitative aptitude questions and that’s it. Prepare your project (the topic really doesn’t matter much but you should know what you’ve done and you have to present it nicely and confidently).\n\n7. Easy to moderate coding questions are enough for the interview but start with brute force and gradually think of better solutions. The most important thing is your thought process and how you are explaining your solution to the interviewer.\n\n8. In the HR round just be yourself and be confident. All the interviewers were really friendly and there is absolutely no need to get nervous. Even if you get stuck on some question they will give you hints and try to help you as much as possible.\n\nAccording to you, who should ideally apply for this job?\n\nAny specific advice you want to give to the junta sitting for placements this year?"
    },
    {
        "job_role": "Quant",
        "company_name": "Quadeye",
        "info": "For Quant role, HFTs usually prefer 9+ CGPA students from circuit departments.",
        "content": "FORESIGHT(2022): Placement at Quadeye| Arnab Maiti\n\nBrief Introduction\n\nI am Arnab Maiti, a final year Dual Degree student of the Computer Science and Engineering Department, IIT Kharagpur. I am also the CSE department representative for the academic year 2021–22.\n\nHow did you get into Quadeye? What was the selection procedure?\n\nI got into Quadeye (Quant role) through CDC placements. The selection procedure is quite standard. First you have a test on IQ questions. Then on Day-1, they have multiple rounds of interviews.\n\nHow to prepare for them?\n\nhttps://brainstellar.com/ and Heard on the street are two great resources to improve your quant. Also, I was in constant touch with probability and statistics which helped me crack the interview questions.\n\nHow would you describe the work culture in your company? How is the work-life balance?\n\nAlthough I didn’t start my job yet, from what I gauged it is a high pressure high reward scenario as Quadeye is a high frequency trading firm. HFTs are definitely not for those who are seeking a 9–5 job.\n\nHow was your experience working from home? What difficulties did you face?\n\nI didn’t start my job yet, so can’t answer this question. As far as CDC preparation is concerned, as long as you have good internet, you can prepare nicely at home.\n\nAccording to you, who should ideally apply for this job?\n\nFor Quant role, HFTs usually prefer 9+ CGPA students from circuit departments. So ideally, these students should apply for this job.\n\nAny specific advice you want to give to the junta sitting for placements this year\n\nEither focus on Software Engineering roles or Quant roles. It is not advisable to try for both at the same time, as both require different preparation. Also, if you have any plans for higher studies, don’t reveal this to the interviewers."
    },
    {
        "job_role": "Quant",
        "company_name": "JP Morgan Chase",
        "info": "Anyone who has an interest in math and is good at coding would find this role really interesting and rewarding.",
        "content": "FORESIGHT(2022): Placement at JP Morgan Chase| Gowri Jayaprakash\n\nBrief Introduction\n\nHey, I am Gowri Jayaprakash, a fifth-year undergrad in the Department of Ocean Engineering and Naval Architecture (Dual-Degree).\n\nI will be joining JP Morgan Chase as a Quantitative Research Analyst this July.\n\nSelection procedure\n\nThis role was open for students from all departments, with an initial screening based on CGPA. This was followed by a screening test which consisted of two parts.- Paper 1 MCQ Test consisting of 30 Questions to be completed in 35 minutes (1 mark for correct answer, -0.25 mark for incorrect answer)There were 3 sections:Section 1: Maths (5 Q)Section 2: Probability(14 Q)Section 3: Coding MCQ(11 Q)- Paper 2 Coding test consisting of 2 questions to be solved in 60 minutes.The maths questions were of JEE level from calculus, trigonometry, geometry, and linear algebra. The probability questions were of medium-hard level and the final coding MCQs were easy. The 2 coding questions were also easy-medium difficulty level.Around 30 students were shortlisted and there were 3 rounds of technical interviews, followed by an HR round.First-round was quant, with several questions on probability and statistics. There were many questions on concepts of expected value, linearity of expectation and probability distributions. Clearing this round is most crucial.\n\nThe second round was focused on my CV, and the interview was mainly on the work I had done for my B.Tech Thesis. Several related questions were asked to ensure I had a solid understanding of the option pricing project I did for my thesis. A few questions were also asked on my previous summer internship project.The third was a coding round with a few questions again on my summer intern project and a few questions related to data structures.\n\nHow to prepare for them?\n\nFor Quant, I mostly prepared 50 Challenging problems in probability and Xinfeng Zhou.\n\nYou need to practice solving problems fast, aiming to solve each question in approx 1–1.5 min.\n\nBrainstellar is also good for probability practice. Coding questions asked are mostly easy-medium level and revising questions from interviewbit helps. Apart from that, I was asked a few questions on basic c++ concepts, and some questions on oops.I was also asked some basic questions on stochastic calculus — what is Brownian motion, the notion of volatility in the Black Scholes model, volatility smile etc.\n\nWhat difficulties did you face while preparing for this Company/Profile? How did you overcome this problem?\n\nOne of the major hurdles was clearing the initial screening test which requires you to solve 30 quant+coding MCQs in 35 minutes.\n\nUnless you have sufficient practice solving questions with time boundedness, you won’t be able to complete the test and score well.\n\nSo it’s important to time yourself while solving probability questions. Try to do mock tests to improve your speed of solving.\n\nWho should ideally apply for this job?\n\nAnyone who has an interest in math and is good at coding would find this role really interesting and rewarding.\n\nWhat advice will you give to them?\n\nPlacements can be really hectic and emotionally draining. It is very important to stay calm and keep working hard even when you face rejections.\n\nBe confident and have faith in the process."
    },
    {
        "job_role": "Quant",
        "company_name": "JP Morgan Chase",
        "info": "Anyone who wants to work in the Finance industry has an interest in ML and Finance, coding can apply for this job.",
        "content": "FORESIGHT (2021) |QR Analyst at JP Morgan Chase |Raj Kumar Singh\n\n1\n\nBrief Introduction\n\nI am Raj Kumar Singh, I am working in JP Morgan Chase as a QR Analyst. I graduated from the Department of Mining Engineering, IIT Kharagpur in 2021 completing my dual degree course.\n\nHow did you get into JPMorgan Chase? What was the selection procedure?\n\nLast year JPMorgan QR was open for all departments but they shortlisted only those candidates for the test who had a CGPA of more than 7.5. They then had an online test consisting of 2 segments:\n\n1. 10 MCQ Quant questions consisting of tough puzzles and probability questions, 5 medium-level general maths questions consisting of questions from the topic of calculus, trigonometry, and linear algebra, and lastly 10 easy coding-based MCQ questions, all to be completed within 75 minutes.\n\n2. 2 coding questions, medium difficulty level, and mostly from the data structure to be completed within 45 minutes.\n\nAfter the test, they shortlisted around 25 candidates and they took interviews consisting of 3 rounds\n\n1. Quant Round: This is the most important round and a bit tough compared to other rounds and questions related to puzzles, probability and statics, machine learning, and CV-based questions were asked.\n\n2. Coding Round: A couple of medium-level coding questions related to data structures and dynamic programming were asked.\n\n3. HR Round: General questions were asked.\n\nHow to prepare for them?\n\n∙ For Quant I would suggest practicing quant problems as much as possible, especially from Heard on the street, 50 CPI, and brain stellar, apart from this Xinfeng and Geeks for Geeks Puzzles are good too.\n\n∙ Apart from questions focus on theories too of statistics and machine learning. You don’t need to be a master in machine learning, but basic knowledge helps a lot.\n\n∙ Coding, they don’t ask as though questions as the SWE role companies ask in our campus, but a good knowledge of data structures is a must. I would suggest practicing each and every problem from Interview Bit and a few famous questions from Leetcode.\n\n∙ They don’t demand Finance knowledge but basic knowledge helps. I would suggest knowing different types of derivatives instruments, bond valuation, basic portfolio management theories, and Economics would be sufficient.\n\n∙ For general maths, they ask in test, I would suggest not to take so much tension of it, as they are JEE level questions which most of us are already master at it.\n\nHow would you describe the work culture in your company? How is the work-life balance?\n\nThe working environment is amazing, people here are just a text away to help you with any doubts you have, the managers are super cool. Although compared to other companies in the same domain, they make you do a lot of work, a lot, but the weekends are the days where you enjoy your life to the fullest, as they don’t have on-call or other stuff as such.\n\nAlso, we have huge flexibility in working hours. you need to be in meetings whenever scheduled and complete your work on time.\n\nHow was your experience working from home? What difficulties did you face?\n\nIt wasn’t bad to be honest, as we got our flexibility for it but it came at the cost of feeling alienated at times, but we do have a lot of online teams to catch up where discussing anything of work is strictly prohibited :P and also as people were so helpful and just a text away and hence absolutely no problem was there other than network issues at times from my side.\n\nAccording to you, who should ideally apply for this job?\n\nJPMC QR has a wide variety of roles, so anyone who wants to work in the Finance industry has an interest in ML and Finance, or has an interest in coding can apply for this job.\n\nAny specific advice you want to give to the junta sitting for placements this year?\n\nThe first suggestion would be relaxing your mind, the placement is a very hectic and demanding process, and at times demand luck too which isn’t in your hand so don’t strain yourself too much, your time will come for sure. I have friends getting placed in Day 1 and I even have friends getting placed in Day 7, but all of them are doing equally well now, so don’t feel anxious, rather think positive.\n\nMy second suggestion would be not to compare yourself with anyone because the companies visiting our campus provide decent jobs to start with, so even if you got the worst placement (if in case you start thinking so) compared in your friend circle that is still one of the best jobs to start your career.\n\nMy last suggestion would be to help other people too, it is hard times with such a hectic placement schedule in which a lot of people end their days (especially in day 1–3) with 5–6 rejections daily, so it is very important to talk to people, support them and help as much as possible.\n\nOfficial CV is attached as image format."
    }
]